`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
`|                                                                                                                        |`;
`|        (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!            |`;
`|                                                                                                                        |`;
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
const ᴠʟᴋʏʀᴇ_Buttons = require(`../../ᴠʟᴋʏʀᴇ🕸️ʜᴏꜱᴛᴇʀ/ᴠʟᴋʏʀᴇ_Buttons`);
const _𝔏𝔞𝔟_ = require(`../../ᴠʟᴋʏʀᴇ🕸️ʜᴏꜱᴛᴇʀ/_𝔏𝔞𝔟_`);
const ꜰᴜᴄᴋ = require(`../../ᴠʟᴋʏʀᴇ🕸️ʜᴏꜱᴛᴇʀ/oShit`);
const fs = require(`fs`);
var ᴋᴇɪᴇx = new RegExp(_𝔏𝔞𝔟_.FOXTROT, `g`);
const vers = require(`../../package.json`);
var ᴋᴇɪ = /\/\^\[(.*)+\]\/\g/g.exec(ᴋᴇɪᴇx)[1];
var path = require(`path`);
var scriptName = path.basename(__filename);
var newScpt = scriptName.slice(0, -3).toLowerCase();
`|⬡════════════════════════════════════════════|   (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞  🛸  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛   |═══════════════════════════════════════════⬡|`;
module.exports = {
name: newScpt,
async handle(ӄ𝖗𝖆ӄ𝖎𝖓𝖟𝕷𝖆𝖇, chat, ᴠʟᴋʏʀᴇ, Needs, ꜱɪᴛʀᴀᴘ, Clock, Ping) {
try {
var աɦօֆɛռȶɦǟȶ = ᴠʟᴋʏʀᴇ.sender;
const defaultnm = ᴠʟᴋʏʀᴇ.commandName;
var աɦօֆɛռȶɦǟȶռʊʍ = աɦօֆɛռȶɦǟȶ
.substring(0, աɦօֆɛռȶɦǟȶ.length - 15)
.replace(/[+ ]/g, "");
const FinalName = defaultnm.charAt(0).toUpperCase() + defaultnm.slice(1);
`|⬡════════════════════════════════════════════|   (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞  🛸  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛   |═══════════════════════════════════════════⬡|`;
if (!ᴠʟᴋʏʀᴇ.isSenderDev) {
return ᴠʟᴋʏʀᴇ_Buttons.MTB(
ӄ𝖗𝖆ӄ𝖎𝖓𝖟𝕷𝖆𝖇,
chat,
ᴠʟᴋʏʀᴇ,
`❌𝐃𝐞𝐧𝐢𝐞𝐝: _Owner/Dev Only.You Are Not Allowed!_`
);
} else if (ᴠʟᴋʏʀᴇ.isGroup) {
return ᴠʟᴋʏʀᴇ_Buttons.MTB(
ӄ𝖗𝖆ӄ𝖎𝖓𝖟𝕷𝖆𝖇,
chat,
ᴠʟᴋʏʀᴇ,
`🪶 𝐇𝐞𝐲: @${աɦօֆɛռȶɦǟȶռʊʍ}, 

╔════◇🔒𝐏𝐞𝐫𝐦𝐢𝐬𝐬𝐢𝐨𝐧 
║💡 _This Command is Only For Private!_
╚════════════╝`
);
} else if (ᴠʟᴋʏʀᴇ.isSenderDev && !ᴠʟᴋʏʀᴇ.isGroup) {
ᴠʟᴋʏʀᴇ_Buttons.MTB(
ӄ𝖗𝖆ӄ𝖎𝖓𝖟𝕷𝖆𝖇,
chat,
ᴠʟᴋʏʀᴇ,
`
╔════| 𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™ by _Krakinz🐙kon_ 
║
║- @${աɦօֆɛռȶɦǟȶռʊʍ}, _(Verified-Admin)_
║- 𝐂𝐨𝐧𝐠𝐫𝐚𝐭𝐬 𝐎𝐧 𝐁𝐞𝐢𝐧𝐠 𝐀 𝐕𝐞𝐫𝐢𝐟𝐢𝐞𝐝 𝐀𝐝𝐦𝐢𝐧 𝐨𝐟 (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐆𝐫𝐨𝐮𝐩 𝐂𝐡𝐚𝐭.
║- 𝗥𝗲𝗺𝗲𝗺𝗯𝗲𝗿 𝗗𝗼 𝗡𝗼𝘁 𝗩𝗶𝗼𝗹𝗮𝘁𝗲 𝗮𝗻𝗱/𝗼𝗿 𝗔𝗯𝘂𝘀𝗲 𝗮𝗻𝘆𝘁𝗵𝗶𝗻𝗴/𝗼𝗻𝗲.
║- 𝗬𝗼𝘂 𝗪𝗶𝗹𝗹 𝗕𝗲 𝗠𝗼𝗻𝗶𝘁𝗼𝗿𝗲𝗱.
╚════════════╝



╔════| 🛸(𝐜)𝐕𝐥𝐤𝐲𝐫𝐞: 𝙷𝚎𝚛𝚎 𝚊𝚛𝚎 𝚝𝚑𝚎 𝚙𝚎𝚛𝚔𝚜 𝚞𝚗𝚍𝚎𝚛 𝙼𝚢 𝙳𝚊𝚝𝚊𝙱𝚊𝚜𝚎
║
║- 𝗥𝘂𝗻𝗻𝗶𝗻𝗴 𝘂𝗻𝗱𝗲𝗿 𝗽𝗼𝗿𝘁𝗮𝗹: _kzenKraby ${vers.vers}apb_
║- 𝗪𝗮𝗶𝘁 𝗧𝗶𝗺𝗲 𝗶𝘀 𝗻𝗼𝘄: _5seconds_
║- 𝗚𝗿𝗼𝘂𝗽𝘀 + 𝗣𝗿𝗶𝘃𝗮𝘁𝗲 𝗨𝘀𝗮𝗴𝗲: _On_
║- 𝗔𝘂𝘁𝗼-𝗚𝗲𝘁 𝗕𝘂𝗴𝗿𝗲𝗽𝗼𝗿𝘁𝘀: _Make Sure to inform to Devs_
║- _Allowed to be a contributer in sakura Krakinz branch_
║- 𝗦𝗽𝗲𝗰𝗶𝗮𝗹 𝗰𝗼𝗺𝗺𝗮𝗻𝗱: _reboot/broadcast/tagall/setwelcome/dyno/spam/ban/unban/scan/cooldown_
║- 𝗔𝗱𝘂𝗹𝘁 𝗰𝗼𝗺𝗺𝗮𝗻𝗱: _unlocked in all groups_
╚════════════╝`
);
return;
} else {
return ᴠʟᴋʏʀᴇ_Buttons.MTB(
ӄ𝖗𝖆ӄ𝖎𝖓𝖟𝕷𝖆𝖇,
chat,
ᴠʟᴋʏʀᴇ,
`❌𝐃𝐞𝐧𝐢𝐞𝐝: _Owner/Dev Only.You Are Not Allowed!_`
);
}
`|⬡════════════════════════════════════════════|   (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞  🛸  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛   |═══════════════════════════════════════════⬡|`;
} catch (Error) {
ꜰᴜᴄᴋ.catch(Error, ӄ𝖗𝖆ӄ𝖎𝖓𝖟𝕷𝖆𝖇, ᴠʟᴋʏʀᴇ, chat);
return;
}
},
};
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
`|                                                                                                                        |`;
`|        (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!            |`;
`|                                                                                                                        |`;
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
