("|⬡═══════════════════════════════════════════════════════════════| (c)𝐕𝐥𝐤𝐲𝐫𝐞🕊️ʙʏ🕊️ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════════════════════════⬡|");
/*
╔⧉༻ [ 𝐕𝐥𝐤𝐲𝐫𝐞🕊️𝐌𝐮𝐥𝐭𝐢𝐃𝐞𝐯𝐢𝐜𝐞 𝐀𝐏𝐈 ] 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
║ 🐞𝐃𝐞𝐯𝐞𝐥𝐨𝐩𝐞𝐫𝐬 +918436686758,917430922909
║ 
║ We won't be responsible for any kind of ban due to this bot.
║ Vlkyre was made for fun purpose and to make group management easier.
║ It's your concern if you spam and gets your account banned.
║ Also, Forks won't be entertained.
║ If you fork this repo and edit plugins, it's your concern for further updates.
║ Forking Repo is fine. But if you edit something we will not provide any help.
║ In short, Fork At Your Own Risk.
╚════════════╝
*/
("|⬡═══════════════════════════════════════════════════════════════| (c)𝐕𝐥𝐤𝐲𝐫𝐞🕊️ʙʏ🕊️ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════════════════════════⬡|");
("use strict");
function _0x4e4b(_0x16b1e2, _0x3f52d9) {
const _0x1dab02 = _0x1dab();
return (
(_0x4e4b = function (_0x4e4be2, _0x3e569e) {
_0x4e4be2 = _0x4e4be2 - 0xff;
let _0x533ff1 = _0x1dab02[_0x4e4be2];
return _0x533ff1;
}),
_0x4e4b(_0x16b1e2, _0x3f52d9)
);
}
const _0x5a39ff = _0x4e4b;
(function (_0x1a9a95, _0x1626ae) {
const _0x4f6f8a = _0x4e4b,
_0x4b5f88 = _0x1a9a95();
while (!![]) {
try {
const _0x5278c6 =
(parseInt(_0x4f6f8a(0x126)) / 0x1) *
(-parseInt(_0x4f6f8a(0x12b)) / 0x2) +
-parseInt(_0x4f6f8a(0x122)) / 0x3 +
(parseInt(_0x4f6f8a(0x132)) / 0x4) *
(parseInt(_0x4f6f8a(0x127)) / 0x5) +
-parseInt(_0x4f6f8a(0x11a)) / 0x6 +
-parseInt(_0x4f6f8a(0x114)) / 0x7 +
(-parseInt(_0x4f6f8a(0x129)) / 0x8) *
(parseInt(_0x4f6f8a(0x124)) / 0x9) +
parseInt(_0x4f6f8a(0x130)) / 0xa;
if (_0x5278c6 === _0x1626ae) break;
else _0x4b5f88["push"](_0x4b5f88["shift"]());
} catch (_0x5c9768) {
_0x4b5f88["push"](_0x4b5f88["shift"]());
}
}
})(_0x1dab, 0xd9624);
function _0x1dab() {
const _0x509bb4 = [
"#E34234",
"bgMagenta",
"isSenderTUF",
"bgGreen",
"🕐\x20𝐓𝐢𝐦𝐞:\x20",
"11215176GiawLH",
"bgBlue",
"🧛🏽‍♂️\x20𝐒𝐞𝐧𝐝𝐞𝐫:\x20",
"#810020",
"bgWhite",
"❗\x20𝐒𝐞𝐧𝐝𝐞𝐫\x20𝐀𝐝𝐦𝐢𝐧:\x20",
"4988088hLCWWs",
"concat",
"../🤖Utilities/Settings",
"@heroku-cli/color",
"subject",
"Gamboge",
"chatID",
"🧀\x20𝐆𝐫𝐨𝐮𝐩\x20𝐍𝐚𝐦𝐞:\x20",
"1318362zFDJyw",
"bgYellow",
"9OqHzaN",
"ӄօʟօʀs",
"3KsiNNs",
"325615FOxKdy",
"commandName",
"1869080GdVdbh",
"black",
"577794KiJeZB",
"bgRed",
"▷═════════════════════|✠|═════════════════════◁",
"🧛🏽‍♂️\x20𝐒𝐞𝐧𝐝𝐞𝐫𝐍𝐚𝐦𝐞:\x20",
"__esModule",
"41473470TbxWXk",
"{\x0aᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ\x20ʙʏ\x20ᴋʀᴀᴋɪɴᴢʟᴀʙ™\x0a}",
"44gKpllN",
"sender",
"isSenderAdmin",
"groupMetadata",
"key",
"hex",
"sendReadReceipt",
"default",
"bgBlack",
"chalk",
"#6082B6",
"#4d5d53",
"#e49b0f",
"Feldgrau",
"⚡\x20𝐒𝐞𝐧𝐝𝐞𝐫\x20𝐓𝐔𝐅:\x20",
"💤\x20𝐂𝐨𝐦𝐦𝐚𝐧𝐝:\x20",
"log",
];
_0x1dab = function () {
return _0x509bb4;
};
return _0x1dab();
}
(exports[_0x5a39ff(0x12f)] = !![]), require(_0x5a39ff(0x11c));
let ӄօʟօʀ = require(_0x5a39ff(0x11d));
exports[_0x5a39ff(0x125)] = async (_0x30b0af, _0x373390) => {
const _0x575c4a = _0x5a39ff;
let _0x402a15 = require(_0x575c4a(0x107)),
_0x254142 = _0x402a15["hex"](_0x575c4a(0x10a)),
_0x49743b = _0x402a15[_0x575c4a(0x103)](_0x575c4a(0x108)),
_0xd3dfc7 = _0x402a15[_0x575c4a(0x103)](_0x575c4a(0x109)),
_0x164802 = _0x402a15["hex"](_0x575c4a(0x117)),
_0x1864cd = _0x402a15[_0x575c4a(0x103)](_0x575c4a(0x10f)),
_0x9d7d4 = _0x402a15[_0x575c4a(0x103)]("#deb887"),
_0x4102e3 = await _0x373390[_0x575c4a(0x101)];
await _0x30b0af[_0x575c4a(0x104)](
_0x373390[_0x575c4a(0x120)],
_0x373390["sender"],
[_0x373390[_0x575c4a(0x102)]["id"]]
),
HEROKU_API_KEY === undefined
? (console[_0x575c4a(0x10e)](_0x254142(_0x575c4a(0x12d))),
console["log"](
ӄօʟօʀ[_0x575c4a(0x105)]["black"](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x118)](_0x575c4a(0x113)),
_0xd3dfc7(""[_0x575c4a(0x11b)](new Date()))
)
),
console[_0x575c4a(0x10e)](
ӄօʟօʀ["default"]["black"](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x118)](_0x575c4a(0x10d)),
_0x49743b(_0x373390[_0x575c4a(0x128)] || "")
)
),
console["log"](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x12a)](
ӄօʟօʀ["default"][_0x575c4a(0x118)](_0x575c4a(0x116)),
_0x164802(_0x373390[_0x575c4a(0xff)] || "")
)
),
console[_0x575c4a(0x10e)](
ӄօʟօʀ[_0x575c4a(0x105)]["black"](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x118)](_0x575c4a(0x12e)),
_0x254142(_0x373390["pushName"] || "")
)
),
console["log"](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x12a)](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x118)](_0x575c4a(0x119)),
_0x1864cd(_0x373390[_0x575c4a(0x100)] || "")
)
),
console[_0x575c4a(0x10e)](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x12a)](
ӄօʟօʀ["default"][_0x575c4a(0x118)]("⚡\x20𝐒𝐞𝐧𝐝𝐞𝐫\x20𝐓𝐔𝐅:\x20"),
_0x1864cd(_0x373390[_0x575c4a(0x111)] || "")
)
),
console[_0x575c4a(0x10e)](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x12a)](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x118)](_0x575c4a(0x121)),
_0x9d7d4(_0x4102e3[_0x575c4a(0x11e)] || "")
)
),
console[_0x575c4a(0x10e)](
ӄօʟօʀ["default"][_0x575c4a(0x12a)](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x118)](_0x575c4a(0x113)),
_0xd3dfc7(""[_0x575c4a(0x11b)](new Date()))
)
),
console[_0x575c4a(0x10e)](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x11f)](_0x575c4a(0x12d))
),
console[_0x575c4a(0x10e)](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x10b)](_0x575c4a(0x131))
))
: (console[_0x575c4a(0x10e)](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x12c)](_0x575c4a(0x12d))
),
console["log"](
ӄօʟօʀ[_0x575c4a(0x105)]["black"](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x118)](_0x575c4a(0x113)),
ӄօʟօʀ["default"][_0x575c4a(0x112)](""[_0x575c4a(0x11b)](new Date()))
)
),
console[_0x575c4a(0x10e)](
ӄօʟօʀ["default"][_0x575c4a(0x12a)](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x118)](_0x575c4a(0x10d)),
ӄօʟօʀ["default"][_0x575c4a(0x115)](
_0x373390[_0x575c4a(0x128)] || ""
)
)
),
console[_0x575c4a(0x10e)](
ӄօʟօʀ[_0x575c4a(0x105)]["black"](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x118)](_0x575c4a(0x116)),
ӄօʟօʀ["default"][_0x575c4a(0x12c)](_0x373390[_0x575c4a(0xff)] || "")
)
),
console["log"](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x12a)](
ӄօʟօʀ[_0x575c4a(0x105)]["bgWhite"](_0x575c4a(0x12e)),
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x110)](
_0x373390["pushName"] || ""
)
)
),
console[_0x575c4a(0x10e)](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x12a)](
ӄօʟօʀ[_0x575c4a(0x105)]["bgWhite"](_0x575c4a(0x119)),
ӄօʟօʀ["default"][_0x575c4a(0x123)](
_0x373390[_0x575c4a(0x100)] || ""
)
)
),
console[_0x575c4a(0x10e)](
ӄօʟօʀ["default"][_0x575c4a(0x12a)](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x118)](_0x575c4a(0x10c)),
ӄօʟօʀ["default"][_0x575c4a(0x123)](
_0x373390[_0x575c4a(0x111)] || ""
)
)
),
console[_0x575c4a(0x10e)](
ӄօʟօʀ["default"][_0x575c4a(0x12a)](
ӄօʟօʀ["default"][_0x575c4a(0x118)](_0x575c4a(0x121)),
ӄօʟօʀ[_0x575c4a(0x105)]["bgCyan"](_0x4102e3["subject"] || "")
)
),
console[_0x575c4a(0x10e)](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x12a)](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x118)](_0x575c4a(0x113)),
ӄօʟօʀ["default"][_0x575c4a(0x118)](""[_0x575c4a(0x11b)](new Date()))
)
),
console[_0x575c4a(0x10e)](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x12c)](_0x575c4a(0x12d))
),
console[_0x575c4a(0x10e)](
ӄօʟօʀ[_0x575c4a(0x105)][_0x575c4a(0x106)](_0x575c4a(0x131))
));
};
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");

//▷                                              (𝐜)Vlkyre 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!                                           ◁

("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
