`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
function _0x39fb(_0x4efcd5,_0x5851d9){var _0x4b8d7b=_0x2242();return _0x39fb=function(_0x17409a,_0x4f4d3c){_0x17409a=_0x17409a-0x64;var _0x1cbb5f=_0x4b8d7b[_0x17409a];return _0x1cbb5f;},_0x39fb(_0x4efcd5,_0x5851d9);}var _0x4670af=_0x39fb;(function(_0x6292a1,_0x13e3d4){var _0x71990c=_0x39fb,_0x28c89f=_0x6292a1();while(!![]){try{var _0x3fb17b=parseInt(_0x71990c(0x7d))/0x1*(parseInt(_0x71990c(0x71))/0x2)+parseInt(_0x71990c(0x6c))/0x3*(-parseInt(_0x71990c(0x76))/0x4)+parseInt(_0x71990c(0x7c))/0x5+-parseInt(_0x71990c(0x66))/0x6+-parseInt(_0x71990c(0x6d))/0x7*(parseInt(_0x71990c(0x74))/0x8)+parseInt(_0x71990c(0x79))/0x9*(-parseInt(_0x71990c(0x67))/0xa)+-parseInt(_0x71990c(0x64))/0xb*(-parseInt(_0x71990c(0x69))/0xc);if(_0x3fb17b===_0x13e3d4)break;else _0x28c89f['push'](_0x28c89f['shift']());}catch(_0xc8d97e){_0x28c89f['push'](_0x28c89f['shift']());}}}(_0x2242,0x1dd84));function _0x2242(){var _0x259e0a=['4874tKcuiD','apply','(((.+)+)+)+$','344fMInxt','{}.constructor(\x22return\x20this\x22)(\x20)','9852FqBUwU','trace','console','50679qpjURb','constructor','bind','29090GbjCWP','53spUGBt','./𝕷𝖆ყO𝖚𝖙','prototype','10538kUwNkl','warn','50538JDshlE','320YxBBDK','exception','4860oxOZGB','error','table','159iaXxvb','13279wKWvVR','info','search','toString'];_0x2242=function(){return _0x259e0a;};return _0x2242();}var _0x2c21f4=(function(){var _0x4930a8=!![];return function(_0x384fa5,_0x5d136f){var _0x5f5d05=_0x4930a8?function(){var _0x36b2ec=_0x39fb;if(_0x5d136f){var _0x55728e=_0x5d136f[_0x36b2ec(0x72)](_0x384fa5,arguments);return _0x5d136f=null,_0x55728e;}}:function(){};return _0x4930a8=![],_0x5f5d05;};}()),_0xd6e7d7=_0x2c21f4(this,function(){var _0x92d89=_0x39fb;return _0xd6e7d7[_0x92d89(0x70)]()[_0x92d89(0x6f)](_0x92d89(0x73))[_0x92d89(0x70)]()[_0x92d89(0x7a)](_0xd6e7d7)[_0x92d89(0x6f)](_0x92d89(0x73));});_0xd6e7d7();var _0x4f4d3c=(function(){var _0x5668c8=!![];return function(_0x388689,_0xc8dd19){var _0x410558=_0x5668c8?function(){var _0x4e3e2a=_0x39fb;if(_0xc8dd19){var _0x1733e7=_0xc8dd19[_0x4e3e2a(0x72)](_0x388689,arguments);return _0xc8dd19=null,_0x1733e7;}}:function(){};return _0x5668c8=![],_0x410558;};}()),_0x17409a=_0x4f4d3c(this,function(){var _0x3e5772=_0x39fb,_0xfafa20;try{var _0xe3370c=Function('return\x20(function()\x20'+_0x3e5772(0x75)+');');_0xfafa20=_0xe3370c();}catch(_0x5961b9){_0xfafa20=window;}var _0x26cb30=_0xfafa20[_0x3e5772(0x78)]=_0xfafa20[_0x3e5772(0x78)]||{},_0x45c82f=['log',_0x3e5772(0x65),_0x3e5772(0x6e),_0x3e5772(0x6a),_0x3e5772(0x68),_0x3e5772(0x6b),_0x3e5772(0x77)];for(var _0x2eec6e=0x0;_0x2eec6e<_0x45c82f['length'];_0x2eec6e++){var _0x19a6bf=_0x4f4d3c[_0x3e5772(0x7a)][_0x3e5772(0x7f)][_0x3e5772(0x7b)](_0x4f4d3c),_0x15bb87=_0x45c82f[_0x2eec6e],_0x51c368=_0x26cb30[_0x15bb87]||_0x19a6bf;_0x19a6bf['__proto__']=_0x4f4d3c['bind'](_0x4f4d3c),_0x19a6bf[_0x3e5772(0x70)]=_0x51c368['toString'][_0x3e5772(0x7b)](_0x51c368),_0x26cb30[_0x15bb87]=_0x19a6bf;}});_0x17409a(),require(_0x4670af(0x7e));
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
let { Caught } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Caught");
let { Image_Button } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Image_Button");
let UserPrivate = require(`../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧆𝕯𝖆𝖙𝖆𝖇𝖆𝖘𝖊/🍃𝖒𝖔𝖓𝖌𝖔/private`);
exports._ᴘᴏᴡᴇʀ = async (ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊) => {
  await UserPrivate.findOne(
    {
      ID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender,
    },
    async (𝕰𝖗𝖗𝖔𝖗, user) => {
      if (𝕰𝖗𝖗𝖔𝖗) return Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗);
      if (!user) {
        var newUser = new UserPrivate({
          ID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender,
          Amount: 1,
        });
        await newUser.save().catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗));
        return await Image_Button(
          ᴋᴜɴᴀɪ,
          Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
          Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
          "./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Red.png",
          `✋🏽‍𝐖𝐚𝐢𝐭 𝐅𝐨𝐫 𝐌𝐲 𝐎𝐰𝐧𝐞𝐫 𝐓𝐨 𝐑𝐞𝐬𝐩𝐨𝐧𝐝!
• Dear Random User, This Private Is Being Guarded By Vlkyre AI!
• Do Not Spam The Chat Box!

🌿𝐏𝐮𝐧𝐢𝐬𝐡𝐦𝐞𝐧𝐭
• 𝗪𝗮𝗿𝗻𝗶𝗻𝗴𝘀: 1/3
• You Will be Auto-Blocked After 3 warnings!`
        );
      } else if (user.Amount < 3) {
        user.Amount = user.Amount + 1;
        await user.save().catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗));
        return await Image_Button(
          ᴋᴜɴᴀɪ,
          Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
          Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
          "./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Red.png",
          `✋🏽‍𝐖𝐚𝐢𝐭 𝐅𝐨𝐫 𝐌𝐲 𝐎𝐰𝐧𝐞𝐫 𝐓𝐨 𝐑𝐞𝐬𝐩𝐨𝐧𝐝!
• Dear Random User, This Private Is Being Guarded By Vlkyre AI!
• Do Not Spam The Chat Box!

🌿𝐏𝐮𝐧𝐢𝐬𝐡𝐦𝐞𝐧𝐭
• 𝗪𝗮𝗿𝗻𝗶𝗻𝗴𝘀: ${user.Amount}/3
• You Will be Auto-Blocked After 3 warnings!`
        );
      } else {
        await user.delete().catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗));
        return await ᴋᴜɴᴀɪ
          .updateBlockStatus(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender, "block")
          .catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗));
      }
    }
  );
};
`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
