`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
const _0xc4aa53 = _0x1c36;
(function (_0x2d40dc, _0x40ec0e) {
const _0x423b6b = _0x1c36,
_0x5c61b8 = _0x2d40dc();
while (!![]) {
try {
const _0x3263e2 =
-parseInt(_0x423b6b(0x73)) / 0x1 +
parseInt(_0x423b6b(0x70)) / 0x2 +
(parseInt(_0x423b6b(0x6b)) / 0x3) * (parseInt(_0x423b6b(0x75)) / 0x4) +
-parseInt(_0x423b6b(0x6c)) / 0x5 +
parseInt(_0x423b6b(0x6d)) / 0x6 +
parseInt(_0x423b6b(0x72)) / 0x7 +
parseInt(_0x423b6b(0x74)) / 0x8;
if (_0x3263e2 === _0x40ec0e) break;
else _0x5c61b8["push"](_0x5c61b8["shift"]());
} catch (_0x548c68) {
_0x5c61b8["push"](_0x5c61b8["shift"]());
}
}
})(_0x213f, 0x4562a);
function _0x213f() {
const _0x3fe732 = [
"7028hktIbD",
"423MKwbEn",
"2624415nvuzAO",
"3370584CcoWHR",
"add",
"exports",
"5096NeJmPp",
"has",
"1366078YFOnEt",
"357512tLqugA",
"1275152OVaRPo",
];
_0x213f = function () {
return _0x3fe732;
};
return _0x213f();
}
let usedCommandRecently = new Set(),
isFiltered = (_0x15e352) => !!usedCommandRecently[_0xc4aa53(0x71)](_0x15e352),
addFilter = (_0x3662b6, _0x459509) => {
const _0x21992c = _0xc4aa53;
usedCommandRecently[_0x21992c(0x6e)](_0x3662b6),
setTimeout(() => usedCommandRecently["delete"](_0x3662b6), _0x459509);
};
function _0x1c36(_0xaa15c6, _0x3ca9ef) {
const _0x213f98 = _0x213f();
return (
(_0x1c36 = function (_0x1c3661, _0x23caf1) {
_0x1c3661 = _0x1c3661 - 0x6b;
let _0x5126ff = _0x213f98[_0x1c3661];
return _0x5126ff;
}),
_0x1c36(_0xaa15c6, _0x3ca9ef)
);
}
module[_0xc4aa53(0x6f)] = { isFiltered: isFiltered, addFilter: addFilter };
`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;