("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
 * * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
 */
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
function _0x2aa6(_0xec6bf4, _0x432263) {
  const _0x58e942 = _0x58e9();
  return (
    (_0x2aa6 = function (_0x2aa607, _0x3c4ad1) {
      _0x2aa607 = _0x2aa607 - 0x165;
      let _0x346972 = _0x58e942[_0x2aa607];
      return _0x346972;
    }),
    _0x2aa6(_0xec6bf4, _0x432263)
  );
}
const _0x512219 = _0x2aa6;
function _0x58e9() {
  const _0x4b207f = [
    "273iVEFsY",
    "../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌗E𝖛𝖊𝖓𝖙𝖘/ProTon",
    "simple-git",
    "610hNHKHI",
    "243928xwpJZe",
    "../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧆𝕯𝖆𝖙𝖆𝖇𝖆𝖘𝖊/𝖀𝖘𝖊𝖗🍣𝖒𝖔𝖓𝖌𝖔/user",
    ".././Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🛩️𝕿𝖞𝖕𝖊𝖘/ARanks",
    "../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Caught",
    "45632kPUIGK",
    "146736ySsdwm",
    "1309098ywgGKR",
    "3082470yTgLfc",
    "16826238TkievS",
    "301889lmmFmv",
    "../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧆𝕯𝖆𝖙𝖆𝖇𝖆𝖘𝖊/🍃𝖒𝖔𝖓𝖌𝖔/private",
    "../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌗E𝖛𝖊𝖓𝖙𝖘/BeutyFly",
    "100aBoUcH",
    "./𝕷𝖆ყO𝖚𝖙",
    "10mmEqjy",
    ".././Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🛩️𝕿𝖞𝖕𝖊𝖘/DenyLink",
    "../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧆𝕯𝖆𝖙𝖆𝖇𝖆𝖘𝖊/🍃𝖒𝖔𝖓𝖌𝖔/halt",
  ];
  _0x58e9 = function () {
    return _0x4b207f;
  };
  return _0x58e9();
}
(function (_0x5e7183, _0x5122db) {
  const _0xcf9db0 = _0x2aa6,
    _0x5e14fc = _0x5e7183();
  while (!![]) {
    try {
      const _0x3f0bfd =
        (parseInt(_0xcf9db0(0x176)) / 0x1) *
          (-parseInt(_0xcf9db0(0x166)) / 0x2) +
        parseInt(_0xcf9db0(0x174)) / 0x3 +
        (parseInt(_0xcf9db0(0x171)) / 0x4) *
          (-parseInt(_0xcf9db0(0x179)) / 0x5) +
        parseInt(_0xcf9db0(0x173)) / 0x6 +
        (-parseInt(_0xcf9db0(0x169)) / 0x7) *
          (parseInt(_0xcf9db0(0x16d)) / 0x8) +
        (-parseInt(_0xcf9db0(0x172)) / 0x9) *
          (-parseInt(_0xcf9db0(0x16c)) / 0xa) +
        parseInt(_0xcf9db0(0x175)) / 0xb;
      if (_0x3f0bfd === _0x5122db) break;
      else _0x5e14fc["push"](_0x5e14fc["shift"]());
    } catch (_0x108b8c) {
      _0x5e14fc["push"](_0x5e14fc["shift"]());
    }
  }
})(_0x58e9, 0xcdd71),
  require(_0x512219(0x165));
let fs = require("fs"),
  Kolor = require("chalk"),
  git = require(_0x512219(0x16b))(),
  ProTon = require(_0x512219(0x16a)),
  { Caught } = require(_0x512219(0x170)),
  { ARanks } = require(_0x512219(0x16f)),
  { ᴘᴏᴡᴇʀᴇᴅ } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧥H𝖔𝖑𝖘𝖙𝖊𝖗/ᴘᴏᴡᴇʀᴇᴅ"),
  Halt = require(_0x512219(0x168)),
  { BeutyFly } = require(_0x512219(0x178)),
  { DenyLink } = require(_0x512219(0x167)),
  Ranker = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧆𝕯𝖆𝖙𝖆𝖇𝖆𝖘𝖊/🍃𝖒𝖔𝖓𝖌𝖔/autorank"),
  LinkList = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧆𝕯𝖆𝖙𝖆𝖇𝖆𝖘𝖊/🍃𝖒𝖔𝖓𝖌𝖔/antilink"),
  { Image_Button } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Image_Button"),
  UserPrivate = require(_0x512219(0x177)),
  userBanCheck = require(_0x512219(0x16e)),
  { ᴋʀʏᴏᴛᴇɴᴏʀ } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧥H𝖔𝖑𝖘𝖙𝖊𝖗/ᴋʀʏᴏᴛᴇɴᴏʀ/ᴋʀʏᴏᴛᴇɴᴏʀ");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { help } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📜ᴍᴇɴᴜ/help");
let { yta } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📥ᴅᴏᴡɴʟᴏᴀᴅᴇʀꜱ/yta");
let { ytv } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📥ᴅᴏᴡɴʟᴏᴀᴅᴇʀꜱ/ytv");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { yts } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/yts");
let { gify } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/gify");
let { image } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/image");
let { anime } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/anime");
let { manga } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/manga");
let { lyrics } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/lyrics");
let { google } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/google");
let { iguser } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/iguser");
let { pokemon } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/pokemon");
let { pokedex } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/pokedex");
let { pinterest } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/pinterest");
let { wallpaper } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/wallpaper");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { toimg } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/toimg");
let { tourl } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/tourl");
let { steal } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/steal");
let { carbon } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/carbon");
let { sticker } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/sticker");
let { tinyurl } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/tinyurl");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { del } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/del");
let { group } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/group");
let { remove } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/remove");
let { demote } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/demote");
let { tagall } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/tagall");
let { invite } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/invite");
let { promote } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/promote");
let { setdesc } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/setdesc");
let { setgpfp } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/setgpfp");
let { antilink } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/antilink");
let { autorank } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/autorank");
let { setwelcome } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/setwelcome");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { ban } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/ban");
let { join } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/join");
let { leave } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/leave");
let { rules } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/rules");
let { unban } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/unban");
let { support } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/support");
let { bcgroup } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/bcgroup");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { zoo } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/zoo");
let { pay } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/pay");
let { buy } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/buy");
let { rob } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/rob");
let { fish } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/fish");
let { hunt } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/hunt");
let { store } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/store");
let { daily } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/daily");
let { gamble } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/gamble");
let { balance } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/balance");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { ass } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/ass");
let { cum } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/cum");
let { bdsm } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/bdsm");
let { feet } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/feet");
let { maid } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/maid");
let { orgy } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/orgy");
let { yuri } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/yuri");
let { doujin } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/doujin");
let { femdom } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/femdom");
let { hentai } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/hentai");
let { thighs } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/thighs");
let { school } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/school");
let { foxgirl } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/foxgirl");
let { glasses } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/glasses");
let { uniform } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/uniform");
let { panties } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/panties");
let { netorare } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/netorare");
let { tentacles } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/tentacles");
let { masturbation } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/masturbation");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { echo } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/echo");
let { slow } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/slow");
let { speed } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/speed");
let { phaser } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/phaser");
let { flanger } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/flanger");
let { vibrato } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/vibrato");
let { reverse } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/reverse");
let { subboost } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/subboost");
let { surround } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/surround");
let { bassboost } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/bassboost");
let { nightcore } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/nightcore");
let { vaporwave } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/vaporwave");
let { superspeed } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/superspeed");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { yt8d } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/yt8d");
let { ytecho } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytecho");
let { ytslow } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytslow");
let { ytspeed } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytspeed");
let { ytphaser } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytphaser");
let { ytflanger } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytflanger");
let { ytvibrato } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytvibrato");
let { ytreverse } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytreverse");
let { ytsurround } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytsurround");
let { ytsubboost } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytsubboost");
let { ytsuperslow } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytsuperslow");
let { ytvaporwave } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytvaporwave");
let { ytnightcore } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytnightcore");
let { ytbassboost } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytbassboost");
let { ytsuperspeed } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytsuperspeed");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { pat } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/pat");
let { hug } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/hug");
let { cry } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/cry");
let { sad } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/sad");
let { yes } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/yes");
let { kiss } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/kiss");
let { kick } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/kick");
let { bite } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/bite");
let { poke } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/poke");
let { yeet } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/yeet");
let { slap } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/slap");
let { wave } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/wave");
let { wink } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/wink");
let { baka } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/baka");
let { bonk } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/bonk");
let { kill } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/kill");
let { blush } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/blush");
let { bored } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/bored");
let { happy } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/happy");
let { smile } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/smile");
let { dance } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/dance");
let { punch } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/punch");
let { stare } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/stare");
let { cuddle } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/cuddle");
let { scream } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/scream");
let { nervous } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/nervous");
let { zerotwo } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/zerotwo");
let { confused } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/confused");
let { highfive } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/highfive");
let { goodnight } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/goodnight");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { tts } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/tts");
let { rank } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/rank");
let { joke } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/joke");
let { meme } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/meme");
let { ship } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/ship");
let { fact } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/fact");
let { neko } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/neko");
let { quote } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/quote");
let { waifu } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/waifu");
let { advice } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/advice");
let { reddit } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/reddit");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
exports.ᴘᴏᴡᴇʀ = async (ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊) => {
  if (Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.message && !Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe) {
    await git.fetch();
    var newCommits = await git.log(["𝐕𝐥𝐤𝐲𝐫𝐞📡𝐏𝐫𝐨𝐭𝐨®..origin/𝐕𝐥𝐤𝐲𝐫𝐞📡𝐏𝐫𝐨𝐭𝐨®"]);
    if (newCommits.total != 0) {
      try {
        await ᴋᴜɴᴀɪ
          .groupSettingUpdate("120363020792949649@g.us", "announcement")
          .catch((𝕰𝖗𝖗𝖔𝖗) => Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.reply(jsonformat(𝕰𝖗𝖗𝖔𝖗)));
        await ᴋᴜɴᴀɪ.sendMessage(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID, {
          text: "*💡Valkyrie Is Now Updating!*\n_Wait For 30-40seconds..._",
          mentions: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants.map((a) => a.id),
        });
      } catch (𝕰𝖗𝖗𝖔𝖗) {
        console.log(𝕰𝖗𝖗𝖔𝖗);
      }
      var h𝖛𝖑𝖐𝖕 = require("child_process").exec(
        `heroku ps:restart worker -a ${HEROKU_APP_NAME}`
      );
      h𝖛𝖑𝖐𝖕.stderr.pipe(process.stderr);
      h𝖛𝖑𝖐𝖕.on("exit", function (code, signal) {
        if (code) console.log("💡𝐄𝐱𝐢𝐭𝐞𝐝 𝐖𝐢𝐭𝐡 𝐂𝐨𝐝𝐞:", Kolor.red(code));
        if (signal) console.log("💡𝐄𝐱𝐢𝐭𝐞𝐝 𝐖𝐢𝐭𝐡 𝐒𝐢𝐠𝐧𝐚𝐥:", Kolor.blue(signal));
        process.exitCode = 1;
      });
    }
  }
  ("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
  if (Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.message) {
    await Ranker.findOne(
      {
        serverID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID,
      },
      async (𝕰𝖗𝖗𝖔𝖗, userRank) => {
        if (𝕰𝖗𝖗𝖔𝖗) return Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗);
        if (!userRank) return;
        await ARanks(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, ᴋᴜɴᴀɪ, Caught, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘);
      }
    );
  }
  ("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
  let 𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆 = Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata;
  await ProTon.Vprtn(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊);
  // if (𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆.subject.includes("Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊")) {
  //   await ᴘᴏᴡᴇʀᴇᴅ(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body);
  //   await ᴋʀʏᴏᴛᴇɴᴏʀ(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body);
  // }
  if (
    !Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe &&
    !Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF &&
    !𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆.subject.includes("Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊") &&
    𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆.participants.length < 20
  ) {
    await ᴋᴜɴᴀɪ.sendMessage(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID, {
      image: { url: "./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Red.png" },
      caption: `❌𝗘𝗿𝗿𝗼𝗿: ${𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆.subject} has _${𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆.participants.length}/20_ members!`,
      footer: "*⦓ ⒸѶ𝖆𝖑𝐤𝐲𝖗𝖎𝖊 ⦔*\nᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ",
      buttons: [
        {
          buttonId: prefix + "help",
          buttonText: { displayText: prefix + "help" },
          type: 1,
        },
      ],
      headerType: 4,
    });
    return await ᴋᴜɴᴀɪ.groupLeave(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID);
  }

  ("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
  if (
    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.message &&
    !Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin &&
    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin &&
    !Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF
  ) {
    await DenyLink(
      Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
      ᴋᴜɴᴀɪ,
      Caught,
      Image_Button,
      Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
      LinkList,
      Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body
    );
  }
  ("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
  await userBanCheck.findOne(
    {
      ID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender,
    },
    async (𝕰𝖗𝖗𝖔𝖗, userBCheck) => {
      if (𝕰𝖗𝖗𝖔𝖗) return console.log(𝕰𝖗𝖗𝖔𝖗);
      await userBanCheck.findOne(
        {
          ID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID,
        },
        async (𝕰𝖗𝖗𝖔𝖗, userGCheck) => {
          if (𝕰𝖗𝖗𝖔𝖗) return console.log(𝕰𝖗𝖗𝖔𝖗);
          if (userBCheck && userGCheck) return;
          ("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
          if (Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isCommand) {
            await BeutyFly(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, Kolor);
            let MeA = [];
            // let MeB = [];
            // let MeC = [];
            // let MeD = [];
            // let MeE = [];
            let MeTA = await ᴋᴜɴᴀɪ.groupMetadata("120363020792949649@g.us");
            // let MeTB = await ᴋᴜɴᴀɪ.groupMetadata("120363024871653603@g.us");
            // let MeTC = await ᴋᴜɴᴀɪ.groupMetadata("120363042762307739@g.us");
            // let MeTD = await ᴋᴜɴᴀɪ.groupMetadata("120363022161584857@g.us");
            // let MeTE = await ᴋᴜɴᴀɪ.groupMetadata("120363039223842047@g.us");
            for (let i = 0; i < MeTA.participants.length; i++)
              MeA[i] = MeTA.participants[i].id;
            // for (let i = 0; i < MeTB.participants.length; i++)
            // MeB[i] = MeTB.participants[i].id;
            // for (let i = 0; i < MeTC.participants.length; i++)
            // MeC[i] = MeTC.participants[i].id;
            // for (let i = 0; i < MeTD.participants.length; i++)
            // MeD[i] = MeTD.participants[i].id;
            // for (let i = 0; i < MeTE.participants.length; i++)
            // MeE[i] = MeTE.participants[i].id;
            ("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
            if (
              !Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe &&
              Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isCommand &&
              !Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF &&
              !Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body.includes("how") &&
              !Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body.includes("help") &&
              !Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body.includes("menu") &&
              !Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body.includes("support") &&
              !MeA.includes(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender)
              //   !MeB.includes(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender) &&
              //   !MeC.includes(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender) &&
              //   !MeD.includes(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender) &&
              //   !MeE.includes(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender)
            ) {
              return await ᴋᴜɴᴀɪ.sendMessage(
                Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID,
                {
                  contextInfo: { mentionedJid: [Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender] },
                  image: { url: "./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.png" },
                  caption: `╔══『 𝐏𝐫𝐨𝐟𝐢𝐥𝐞𝐫® 』
║ *❣️ ɴᴀᴍᴇ:* ${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName || "No_Name"}
║ *⚡ ɪᴅ:* ${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID.split("@")[0]}
╚═══════╝


*❗ 𝐓𝐨 𝐔𝐬𝐞 𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐉𝐨𝐢𝐧 𝐀𝐧𝐲 & 𝐠𝐞𝐭 𝐀𝐮𝐭𝐨 𝐕𝐞𝐫𝐢𝐟𝐢𝐞𝐝 ❗*
*𝗚roup⛩️:* chat.whatsapp.com/Gn50KMVAJKZHYJeaGhs3UV`,
                  footer: "*⦓ ⒸѶ𝖆𝖑𝐤𝐲𝖗𝖎𝖊 ⦔*\nᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ",
                  buttons: [
                    {
                      buttonId: prefix + "help",
                      buttonText: { displayText: prefix + "help" },
                      type: 1,
                    },
                    {
                      buttonId: prefix + "support",
                      buttonText: { displayText: prefix + "support" },
                      type: 1,
                    },
                  ],
                  headerType: 4,
                },
                {
                  quoted: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                }
              );
              ("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
            } else {
              switch (Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName) {
                case "":
                  if (Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isCommand) {
                    await ᴋᴜɴᴀɪ.sendMessage(
                      Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID,
                      {
                        text: `Hey *${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName}* .Do you mean: ${prefix}help`,
                        footer: `「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  `,
                        buttons: [
                          {
                            buttonId: `${prefix}help`,
                            buttonText: { displayText: `Commands` },
                            type: 1,
                          },
                          ,
                        ],
                        headerType: 4,
                      },
                      {
                        quoted: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                      }
                    );
                  }
                  "|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|";
                  break;
                case `pokemon`:
                  await pokemon(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `pokedex`:
                  await pokedex(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `carbon`:
                  await carbon(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `getgif`:
                case `gify`:
                case `gif`:
                  await gify(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `s`:
                case `sgif`:
                case `sticker`:
                case `stickergif`:
                  await sticker(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `toimg`:
                  await toimg(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `pin`:
                case `pinterest`:
                  await pinterest(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `tourl`:
                  await tourl(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `remove`:
                  await remove(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `promote`:
                  await promote(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `demote`:
                  await demote(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `setdesc`:
                  await setdesc(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `seticon`:
                case `setppgrup`:
                case `setgpfp`:
                  await setgpfp(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `tagall`:
                  await tagall(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `group`:
                  await group(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `invite`:
                case `grouplink`:
                  await invite(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `del`:
                case `delete`:
                  await del(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `antilink`:
                case `stoplink`:
                case `nolink`:
                  await antilink(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `autorank`:
                case `autorole`:
                  await autorank(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `setwelcome`:
                case `welcomer`:
                case `welcome`:
                  await setwelcome(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ban`:
                  await ban(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `unban`:
                  await unban(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `yta`:
                case `play`:
                case `song`:
                case `sing`:
                case `ytmp3`:
                case `ytplay`:
                case `ytaudio`:
                case `ytmusic`:
                case `youtubemusic`:
                  await yta(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ytv`:
                case `watch`:
                case `stream`:
                case `ytmp4`:
                case `ytvideo`:
                case `youtubevideo`:
                  await ytv(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `yts`:
                case `ytsearch`:
                case `ytscrape`:
                case `youtubescrape`:
                case `youtubesearch`:
                  await yts(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `sr`:
                case `reddit`:
                case `subreddit`:
                  await reddit(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `rank`:
                  await rank(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `tts`:
                case `gtts`:
                case `text2speech`:
                  await tts(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `fun`:
                case `joke`:
                case `funny`:
                case `laugh`:
                case `dadjoke`:
                  await joke(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `meme`:
                  await meme(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `tinyurl`:
                  await tinyurl(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `join`:
                  await join(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `leave`:
                  await leave(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `lyrics`:
                  await lyrics(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `gimage`:
                case `image`:
                  await image(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `web`:
                case `find`:
                case `search`:
                case `google`:
                  await google(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `take`:
                case `steal`:
                  await steal(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `iguser`:
                  await iguser(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ship`:
                  await ship(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `quote`:
                  await quote(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `fact`:
                  await fact(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `advice`:
                  await advice(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `pat`:
                  await pat(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `hug`:
                  await hug(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `kiss`:
                  await kiss(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `cuddle`:
                  await cuddle(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `kick`:
                  await kick(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `bite`:
                  await bite(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `blush`:
                  await blush(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `bored`:
                  await bored(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `confused`:
                  await confused(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `cry`:
                  await cry(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `goodnight`:
                  await goodnight(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `happy`:
                  await happy(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `poke`:
                  await poke(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `sad`:
                  await sad(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `slap`:
                  await slap(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `smile`:
                  await smile(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `wave`:
                  await wave(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `wink`:
                  await wink(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `dance`:
                  await dance(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `baka`:
                  await baka(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `bonk`:
                  await bonk(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `hi5`:
                case `highfive`:
                  await highfive(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `kill`:
                  await kill(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `nervous`:
                  await nervous(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `punch`:
                  await punch(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `scream`:
                  await scream(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `stare`:
                  await stare(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `yeet`:
                  await yeet(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `yes`:
                  await yes(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `zerotwo`:
                  await zerotwo(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `waifu`:
                  await waifu(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `neko`:
                  await neko(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `anime`:
                  await anime(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `manga`:
                  await manga(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `wallpaper`:
                  await wallpaper(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `bc`:
                case `bcgroup`:
                  await bcgroup(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `yt8d`:
                  await yt8d(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ytbassboost`:
                  await ytbassboost(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ytecho`:
                  await ytecho(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ytflanger`:
                  await ytflanger(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ytnightcore`:
                  await ytnightcore(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ytphaser`:
                  await ytphaser(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ytreverse`:
                  await ytreverse(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ytslow`:
                  await ytslow(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ytspeed`:
                  await ytspeed(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ytsubboost`:
                  await ytsubboost(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ytsuperslow`:
                  await ytsuperspeed(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ytsuperslow`:
                  await ytsuperslow(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ytsurround`:
                  await ytsurround(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ytvaporwave`:
                  await ytvaporwave(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ytvibrato`:
                  await ytvibrato(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `bassboost`:
                  await bassboost(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `echo`:
                  await echo(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `flanger`:
                  await flanger(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `nightcore`:
                  await nightcore(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `phaser`:
                  await phaser(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `reverse`:
                  await reverse(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `slow`:
                  await slow(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `speed`:
                  await speed(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `subboost`:
                  await subboost(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `superspeed`:
                  await superspeed(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `surround`:
                  await surround(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `vaporwave`:
                  await vaporwave(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `vibrato`:
                  await vibrato(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `ass`:
                  await ass(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `bdsm`:
                  await bdsm(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `cum`:
                  await cum(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `doujin`:
                  await doujin(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `feet`:
                  await feet(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `femdom`:
                  await femdom(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `foxgirl`:
                  await foxgirl(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `glasses`:
                  await glasses(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `hentai`:
                  await hentai(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `maid`:
                  await maid(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `masturbation`:
                  await masturbation(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `netorare`:
                  await netorare(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `orgy`:
                  await orgy(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `panties`:
                  await panties(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `school`:
                  await school(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `tentacles`:
                  await tentacles(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `thighs`:
                  await thighs(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `uniform`:
                  await uniform(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `yuri`:
                  await yuri(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `dly`:
                case `daily`:
                  await daily(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `fish`:
                case `pond`:
                case `fishes`:
                  await fish(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `bet`:
                case `gamble`:
                case `betting`:
                case `roulette`:
                  await gamble(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `hunt`:
                case `hunting`:
                case `pokehunt`:
                  await hunt(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `zoo`:
                case `forest`:
                case `animals`:
                  await zoo(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `pay`:
                case `loan`:
                case `borrow`:
                case `payment`:
                  await pay(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `bal`:
                case `gold`:
                case `money`:
                case `balance`:
                  await balance(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `buy`:
                  await buy(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `mall`:
                case `shop`:
                case `store`:
                case `shopping`:
                  await store(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `rob`:
                case `thief`:
                case `robbery`:
                  await rob(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `sp`:
                case `dev`:
                case `devs`:
                case `official`:
                case `support`:
                  await support(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `rule`:
                case `rules`:
                  await rules(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                case `h`:
                case `how`:
                case `help`:
                case `menu`:
                case `allmenu`:
                  await help(
                    ᴋᴜɴᴀɪ,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
                  );
                  break;
                  "|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|";
                default:
                  return await ᴋᴜɴᴀɪ.sendMessage(
                    Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID,
                    {
                      contextInfo: { mentionedJid: [Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender] },
                      image: {
                        url: "https://i.postimg.cc/qB1f08hd/Uni.png",
                      },
                      caption: `╔══『 𝐏𝐫𝐨𝐟𝐢𝐥𝐞𝐫® 』
║ *❣️ ɴᴀᴍᴇ:* ${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName || "No_Name"}
║ *⚡ ɪᴅ:* ${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID.split("@")[0]}
╚═══════╝


*❌𝕰𝖗𝖗𝖔𝖗:* Couldn't find any matching commands. Try again with the commands from the help list`,
                      footer: "*⦓ ⒸѶ𝖆𝖑𝐤𝐲𝖗𝖎𝖊 ⦔*\nᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ",
                      buttons: [
                        {
                          buttonId: prefix + "help",
                          buttonText: { displayText: prefix + "help" },
                          type: 1,
                        },
                        {
                          buttonId: prefix + "support",
                          buttonText: {
                            displayText: prefix + "support",
                          },
                          type: 1,
                        },
                      ],
                      headerType: 4,
                    },
                    {
                      quoted: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                    }
                  );
              }
            }
          }
        }
      );
    }
  );
};
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
 * * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
 */
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
