("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
* * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
*/
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
require(`./𝕷𝖆ყO𝖚𝖙`);
let ᴋᴏʟᴏʀ = require("chalk");
let ʏᴛꜱ = require("yt-search");
let ɴᴏᴅᴇꜰᴇᴛᴄʜ = require("node-fetch");
let ɢᴇᴛᴠɪᴅᴇᴏɪᴅ = require("get-video-id");
let ProTon = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌗E𝖛𝖊𝖓𝖙𝖘/ProTon");
let { ytaR } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/y2mate");
let { ARanks } = require(`../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🛩️𝕿𝖞𝖕𝖊𝖘/ARanks`);
let { Caught } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Caught");
let { DenyLink } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🛩️𝕿𝖞𝖕𝖊𝖘/DenyLink");
let { getBuffer } = require(`../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/ɴᴇᴄᴛᴏʀ`);
// let Radio = require(`../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧆𝕯𝖆𝖙𝖆𝖇𝖆𝖘𝖊/🍃𝖒𝖔𝖓𝖌𝖔/Radio`);
let Ranker = require(`../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧆𝕯𝖆𝖙𝖆𝖇𝖆𝖘𝖊/🍃𝖒𝖔𝖓𝖌𝖔/autorank`);
let { yta_var } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧥H𝖔𝖑𝖘𝖙𝖊𝖗/letiableServers");
let LinkList = require(`../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧆𝕯𝖆𝖙𝖆𝖇𝖆𝖘𝖊/🍃𝖒𝖔𝖓𝖌𝖔/antilink`);
let { Image_Button } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Image_Button");
let userBanCheck = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧆𝕯𝖆𝖙𝖆𝖇𝖆𝖘𝖊/𝖀𝖘𝖊𝖗🍣𝖒𝖔𝖓𝖌𝖔/user");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { help } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📜ᴍᴇɴᴜ/help");
let { yta } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📥ᴅᴏᴡɴʟᴏᴀᴅᴇʀꜱ/yta");
let { ytv } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📥ᴅᴏᴡɴʟᴏᴀᴅᴇʀꜱ/ytv");
let { radio } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📥ᴅᴏᴡɴʟᴏᴀᴅᴇʀꜱ/radio");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { yts } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/yts");
let { gify } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/gify");
let { image } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/image");
let { anime } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/anime");
let { manga } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/manga");
let { lyrics } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/lyrics");
let { google } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/google");
let { iguser } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/iguser");
let { pokemon } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/pokemon");
let { pokedex } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/pokedex");
let { pinterest } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/pinterest");
let { wallpaper } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/wallpaper");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { toimg } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/toimg");
let { tourl } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/tourl");
let { steal } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/steal");
let { carbon } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/carbon");
let { sticker } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/sticker");
let { tinyurl } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/tinyurl");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { del } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/del");
let { group } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/group");
let { remove } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/remove");
let { demote } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/demote");
let { tagall } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/tagall");
let { invite } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/invite");
let { promote } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/promote");
let { setdesc } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/setdesc");
let { setgpfp } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/setgpfp");
let { antilink } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/antilink");
let { autorank } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/autorank");
let { setwelcome } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/setwelcome");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { ban } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/ban");
let { join } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/join");
let { leave } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/leave");
let { rules } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/rules");
let { unban } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/unban");
let { support } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/support");
let { bcgroup } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/bcgroup");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { zoo } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/zoo");
let { pay } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/pay");
let { bag } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/bag");
let { buy } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/buy");
let { rob } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/rob");
let { fish } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/fish");
let { hunt } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/hunt");
let { store } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/store");
let { daily } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/daily");
let { gamble } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/gamble");
let { balance } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/balance");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { ass } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/ass");
let { cum } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/cum");
let { bdsm } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/bdsm");
let { feet } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/feet");
let { maid } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/maid");
let { orgy } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/orgy");
let { yuri } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/yuri");
let { doujin } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/doujin");
let { femdom } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/femdom");
let { hentai } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/hentai");
let { thighs } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/thighs");
let { school } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/school");
let { foxgirl } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/foxgirl");
let { glasses } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/glasses");
let { uniform } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/uniform");
let { panties } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/panties");
let { netorare } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/netorare");
let { tentacles } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/tentacles");
let { masturbation } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/masturbation");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { echo } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/echo");
let { slow } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/slow");
let { speed } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/speed");
let { phaser } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/phaser");
let { flanger } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/flanger");
let { vibrato } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/vibrato");
let { reverse } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/reverse");
let { subboost } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/subboost");
let { surround } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/surround");
let { bassboost } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/bassboost");
let { nightcore } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/nightcore");
let { vaporwave } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/vaporwave");
let { superspeed } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/superspeed");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { yt8d } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/yt8d");
let { ytecho } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytecho");
let { ytslow } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytslow");
let { ytspeed } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytspeed");
let { ytphaser } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytphaser");
let { ytflanger } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytflanger");
let { ytvibrato } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytvibrato");
let { ytreverse } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytreverse");
let { ytsurround } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytsurround");
let { ytsubboost } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytsubboost");
let { ytsuperslow } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytsuperslow");
let { ytvaporwave } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytvaporwave");
let { ytnightcore } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytnightcore");
let { ytbassboost } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytbassboost");
let { ytsuperspeed } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytsuperspeed");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { pat } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/pat");
let { hug } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/hug");
let { cry } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/cry");
let { sad } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/sad");
let { yes } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/yes");
let { kiss } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/kiss");
let { kick } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/kick");
let { bite } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/bite");
let { poke } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/poke");
let { yeet } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/yeet");
let { slap } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/slap");
let { wave } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/wave");
let { wink } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/wink");
let { baka } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/baka");
let { bonk } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/bonk");
let { kill } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/kill");
let { blush } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/blush");
let { bored } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/bored");
let { happy } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/happy");
let { smile } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/smile");
let { dance } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/dance");
let { punch } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/punch");
let { stare } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/stare");
let { cuddle } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/cuddle");
let { scream } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/scream");
let { nervous } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/nervous");
let { zerotwo } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/zerotwo");
let { confused } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/confused");
let { highfive } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/highfive");
let { goodnight } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/goodnight");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let { tts } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/tts");
let { rank } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/rank");
let { joke } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/joke");
let { meme } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/meme");
let { ship } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/ship");
let { fact } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/fact");
let { neko } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/neko");
let { quote } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/quote");
let { waifu } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/waifu");
let { advice } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/advice");
let { reddit } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/reddit");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
exports.ᴘᴏᴡᴇʀ = async (ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊) => {
let 𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆 = Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata;
// if (𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆.subject.includes("Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊")) {
// async function pow(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊) {
// console.log("═════════════════════|▷ Time To Send Audio!");
// console.log(
// ᴋᴏʟᴏʀ.black(
// ᴋᴏʟᴏʀ.bgWhite("🍯𝐑𝐞𝐪𝐮𝐞𝐬𝐭𝐞𝐝 𝐀𝐭: "),
// ᴋᴏʟᴏʀ.bgYellow(new Date())
// )
// );
// try {
// let ɴᴜᴍᴛʀɪᴇꜱꜰᴏʀɴᴏɴᴇᴍʙᴇᴅ = 15;
// let ᴄᴏɴᴛᴀɪɴꜱᴇᴍʙᴇᴅ = false;
// let ᴍᴀɪɴᴜʀʟ = "";
// let ᴄᴏʀᴇꜰᴇᴛᴄʜ;
// if (typeof window === "undefined") {
// ᴄᴏʀᴇꜰᴇᴛᴄʜ = ɴᴏᴅᴇꜰᴇᴛᴄʜ;
// } else {
// ᴄᴏʀᴇꜰᴇᴛᴄʜ = fetch;
// }
// let playlists = [
// {
// name: "most-viewed",
// id: "PL15B1E77BB5708555",
// max: 500,
// },
// {
// name: "billboard",
// id: "PL55713C70BA91BD6E",
// max: 500,
// },
// {
// name: "latest",
// id: "PLFgquLnL59akA2PflFpeQG9L01VFg90wS",
// max: 500,
// },
// {
// name: "popular-music-videos",
// id: "PLFgquLnL59alCl_2TQvOiD5Vgm1hCaGSI",
// max: 500,
// },
// {
// name: "top-hits-this-week",
// id: "PLw-VjHDlEOgvWPpRBs9FRGgJcKpDimTqf",
// max: 500,
// },
// ];
// let app = {
// playlist: {},
// index: null,
// baseURL: "https://www.youtube.com/embed/?list={0}&index={1}",
// queryStrings:
// "&amp;t=15&amp;wmode=transparent&amp;autoplay=1&amp;rel=0&amp;showinfo=0&amp;iv_load_policy=3&amp;showsearch=0&amp;autohide=1&amp;controls=1&amp;wadsworth=1",
// iframeSrc: "",
// };
// String.prototype.format = function () {
// let string = this;
// for (let i = 0; i < arguments.length; i++) {
// let regexp = new RegExp("\\{" + i + "\\}", "gi");
// string = string.replace(regexp, arguments[i]);
// }
// return string;
// };
// function ɢᴇɴᴇʀᴀᴛᴇʀᴀɴᴅᴏᴍ(num) {
// return Math.floor(Math.random() * num);
// }
// function ɢᴇᴛᴘʟᴀʏʟɪꜱᴛ() {
// let loc = ɢᴇɴᴇʀᴀᴛᴇʀᴀɴᴅᴏᴍ(playlists.length);
// return playlists[loc];
// }
// function ɢᴇᴛᴇᴍʙᴇᴅᴍᴜꜱɪᴄᴠɪᴅᴇᴏᴜʀʟ() {
// let playlist = ɢᴇᴛᴘʟᴀʏʟɪꜱᴛ();
// let index = ɢᴇɴᴇʀᴀᴛᴇʀᴀɴᴅᴏᴍ(playlist.max);
// return app.baseURL.format(playlist.id, index) + app.queryStrings;
// }
// async function getMainSiteYoutubeMusicVideoUrl(embedUrl) {
// if (embedUrl == null) {
// throw new Error("embedUrl is null");
// }
// let res = await ᴄᴏʀᴇꜰᴇᴛᴄʜ(embedUrl);
// let txt = await res.text();
// let realUrlStartIdx = txt.indexOf("https://www.youtube.com/watch?v=");
// if (realUrlStartIdx === -1) {
// return embedUrl;
// }
// let realUrlEndIdx = txt.indexOf("'", realUrlStartIdx);
// if (realUrlEndIdx === -1) {
// return embedUrl;
// }
// return txt.substring(realUrlStartIdx, realUrlEndIdx);
// }
// async function ʀꜰᴏᴜɴᴅ(preventEmbedded) {
// while (ɴᴜᴍᴛʀɪᴇꜱꜰᴏʀɴᴏɴᴇᴍʙᴇᴅ > 0) {
// ɴᴜᴍᴛʀɪᴇꜱꜰᴏʀɴᴏɴᴇᴍʙᴇᴅ--;
// let embedUrl = ɢᴇᴛᴇᴍʙᴇᴅᴍᴜꜱɪᴄᴠɪᴅᴇᴏᴜʀʟ();
// ᴍᴀɪɴᴜʀʟ = await getMainSiteYoutubeMusicVideoUrl(embedUrl);
// ᴄᴏɴᴛᴀɪɴꜱᴇᴍʙᴇᴅ =
// ᴍᴀɪɴᴜʀʟ.indexOf("https://www.youtube.com/embed/?list=") !== -1;
// if (!ᴄᴏɴᴛᴀɪɴꜱᴇᴍʙᴇᴅ) {
// return ᴍᴀɪɴᴜʀʟ;
// }
// }
// if (preventEmbedded && ᴄᴏɴᴛᴀɪɴꜱᴇᴍʙᴇᴅ) {
// return null;
// }
// return ᴍᴀɪɴᴜʀʟ;
// }
// ("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
// let ᴛᴜʙᴇʟ = await ʀꜰᴏᴜɴᴅ();
// let { id } = ɢᴇᴛᴠɪᴅᴇᴏɪᴅ(ᴛᴜʙᴇʟ);
// if (!id) return;
// let ꜰꜰᴏᴜɴᴅ = await ʏᴛꜱ(id);
// let ᴛꜰᴏᴜɴᴅ = ꜰꜰᴏᴜɴᴅ.videos.slice(0, 1);
// if (!ᴛꜰᴏᴜɴᴅ) return;
// if (!ꜰꜰᴏᴜɴᴅ) return;
// ᴛꜰᴏᴜɴᴅ.forEach(async function (ᴛᴜʙᴇ) {
// console.log(
// ᴋᴏʟᴏʀ.black(
// ᴋᴏʟᴏʀ.bgWhite("🐙𝐓𝐫𝐚𝐧𝐬𝐟𝐞𝐫𝐫𝐞𝐝 𝐀𝐭: "),
// ᴋᴏʟᴏʀ.bgMagenta(new Date())
// )
// );
// try {
// let { DLoader } = await yta_var(ᴛᴜʙᴇ.url, "en136");
// return await ᴋᴜɴᴀɪ.sendMessage(
// Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID,
// {
// audio: { url: DLoader },
// contextInfo: {
// externalAdReply: {
// title: `🍻𝐓𝐢𝐭𝐥𝐞: ${ᴛᴜʙᴇ.title}`,
// body: `ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ⭕ʀᴀᴅɪᴏ`,
// mediaType: 2,
// thumbnail: await getBuffer(ᴛᴜʙᴇ.thumbnail),
// mediaUrl: ᴛᴜʙᴇ.thumbnail,
// },
// },
// mimetype: `audio/mpeg`,
// fileName: `${ᴛᴜʙᴇ.title}.mp3`,
// }
// );
// ("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
// } catch (𝕰𝖗𝖗𝖔𝖗) {
// console.log(
// ᴋᴏʟᴏʀ.black(ᴋᴏʟᴏʀ.bgWhite("⚠️𝕰𝖗𝖗𝖔𝖗: "), ᴋᴏʟᴏʀ.bgRed(𝕰𝖗𝖗𝖔𝖗))
// );
// let ᴍᴇᴅɪᴀ = await ytaR(ᴛᴜʙᴇ.url, "128kbps");
// return await ᴋᴜɴᴀɪ.sendMessage(
// Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID,
// {
// audio: { url: ᴍᴇᴅɪᴀ.DLoader },
// contextInfo: {
// externalAdReply: {
// title: `🍻𝐓𝐢𝐭𝐥𝐞: ${ᴛᴜʙᴇ.title}`,
// body: `ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ⭕ʀᴀᴅɪᴏ`,
// mediaType: 2,
// thumbnail: await getBuffer(ᴛᴜʙᴇ.thumbnail),
// mediaUrl: ᴛᴜʙᴇ.thumbnail,
// },
// },
// mimetype: `audio/mpeg`,
// fileName: `${ᴛᴜʙᴇ.title}.mp3`,
// }
// );
// }
// });
// } catch (𝕰𝖗𝖗𝖔𝖗) {
// return console.log(
// ᴋᴏʟᴏʀ.black(ᴋᴏʟᴏʀ.bgWhite("⚠️𝕰𝖗𝖗𝖔𝖗: "), ᴋᴏʟᴏʀ.bgRed(𝕰𝖗𝖗𝖔𝖗))
// );
// }
// }
// ("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
// await Radio.findOne(
// {
// ID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID,
// },
// async (𝕰𝖗𝖗𝖔𝖗, uR) => {
// if (𝕰𝖗𝖗𝖔𝖗) return Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗));
// if (!uR) {
// let newRadio = new Radio({
// ID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID,
// goneRadio: 0,
// goneRadiotimeout: 0,
// });
// console.log("═════════════════════|▷ Radio guild Saved!");
// return await newRadio
// .save()
// .catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗)));
// } else {
// if (uR.goneRadiotimeout - (Date.now() - uR.goneRadio) > 0) {
// return;
// }
// uR.goneRadio = Date.now();
// uR.goneRadiotimeout = 60000;
// await uR
// .save()
// .catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗)));
// await pow(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊);
// }
// }
// );
// }
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
if (Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.message && !Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe) {
let { Message_NotMe } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊📮W𝖆𝖗𝖉𝖗𝖔𝖇𝖊/Message_NotMe");
await Message_NotMe(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊);
}
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
if (Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.message) {
await Ranker.findOne(
{
serverID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID,
},
async (𝕰𝖗𝖗𝖔𝖗, userRank) => {
if (𝕰𝖗𝖗𝖔𝖗) return Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗);
if (!userRank) return;
await ARanks(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, ᴋᴜɴᴀɪ, Caught, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘);
}
);
}
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
await ProTon.Vprtn(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊);
if (
!Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe &&
!Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF &&
!𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆.subject.includes("Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊") &&
𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆.participants.length < 20
) {
await ᴋᴜɴᴀɪ.sendMessage(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID, {
image: { url: "./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Red.png" },
caption: `❌𝗘𝗿𝗿𝗼𝗿: ${𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆.subject} has _${𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆.participants.length}/20_ members!`,
footer: "*⦓ ⒸѶ𝖆𝖑𝐤𝐲𝖗𝖎𝖊 ⦔*\nᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ",
buttons: [
{
buttonId: prefix + "help",
buttonText: { displayText: prefix + "help" },
type: 1,
},
],
headerType: 4,
});
return await ᴋᴜɴᴀɪ.groupLeave(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID);
}

("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
if (
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.message &&
!Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin &&
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin &&
!Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF
) {
await DenyLink(
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
ᴋᴜɴᴀɪ,
Caught,
Image_Button,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
LinkList,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body
);
}
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
await userBanCheck.findOne(
{
ID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender,
},
async (𝕰𝖗𝖗𝖔𝖗, userBCheck) => {
if (𝕰𝖗𝖗𝖔𝖗) return console.log(𝕰𝖗𝖗𝖔𝖗);
await userBanCheck.findOne(
{
ID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID,
},
async (𝕰𝖗𝖗𝖔𝖗, userGCheck) => {
if (𝕰𝖗𝖗𝖔𝖗) return console.log(𝕰𝖗𝖗𝖔𝖗);
if (userBCheck) {
return;
} else if (userGCheck) {
return;
} else {
if (Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isCommand) {
let { ӄօʟօʀs } = require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌗E𝖛𝖊𝖓𝖙𝖘/ӄօʟօʀs");
await ӄօʟօʀs(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊);
let MeA = [];
let MeTA = await ᴋᴜɴᴀɪ.groupMetadata("120363020792949649@g.us");
for (let i = 0; i < MeTA.participants.length; i++)
MeA[i] = MeTA.participants[i].id;
if (
!Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe &&
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isCommand &&
!Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF &&
!Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body.includes("how") &&
!Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body.includes("help") &&
!Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body.includes("menu") &&
!Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body.includes("support") &&
!MeA.includes(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender)
) {
return await ᴋᴜɴᴀɪ.sendMessage(
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID,
{
contextInfo: { mentionedJid: [Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender] },
image: { url: "./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.png" },
caption: `╔══『 𝐏𝐫𝐨𝐟𝐢𝐥𝐞𝐫® 』
║ *❣️ ɴᴀᴍᴇ:* ${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName || "No_Name"}
║ *⚡ ɪᴅ:* ${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID.split("@")[0]}
╚═══════╝


*❗ 𝐓𝐨 𝐔𝐬𝐞 𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞❗*
Join The Group and get verified to use bot anywhere in this app.
*𝗚roup⛩️:* chat.whatsapp.com/HSps2qiCNOUGR0tr8Darop`,
footer: "*⦓ ⒸѶ𝖆𝖑𝐤𝐲𝖗𝖎𝖊 ⦔*\nᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ",
buttons: [
{
buttonId: prefix + "help",
buttonText: { displayText: prefix + "help" },
type: 1,
},
{
buttonId: prefix + "support",
buttonText: { displayText: prefix + "support" },
type: 1,
},
],
headerType: 4,
},
{
quoted: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
}
);
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
} else {
switch (Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName) {
case "":
if (Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isCommand) {
await ᴋᴜɴᴀɪ.sendMessage(
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID,
{
text: `Hey *${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName}* .Do you mean: ${prefix}help`,
footer: `「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  `,
buttons: [
{
buttonId: `${prefix}help`,
buttonText: { displayText: `Commands` },
type: 1,
},
,
],
headerType: 4,
},
{
quoted: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
}
);
}
"|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|";
break;
case `pokemon`:
await pokemon(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `pokedex`:
await pokedex(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `carbon`:
await carbon(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `getgif`:
case `gify`:
case `gif`:
await gify(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `s`:
case `sgif`:
case `sticker`:
case `stickergif`:
await sticker(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `toimg`:
await toimg(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `pin`:
case `pinterest`:
await pinterest(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `tourl`:
await tourl(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `remove`:
await remove(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `promote`:
await promote(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `demote`:
await demote(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `setdesc`:
await setdesc(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `seticon`:
case `setppgrup`:
case `setgpfp`:
await setgpfp(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `tagall`:
await tagall(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `group`:
await group(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `invite`:
case `grouplink`:
await invite(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `del`:
case `delete`:
await del(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `antilink`:
case `stoplink`:
case `nolink`:
await antilink(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `autorank`:
case `autorole`:
await autorank(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `setwelcome`:
case `welcomer`:
case `welcome`:
await setwelcome(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ban`:
await ban(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `unban`:
await unban(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `radio`:
case `randmusic`:
case `randaudio`:
case `randomaudio`:
case `randommusic`:
case `suggestaudio`:
case `suggestmusic`:
await radio(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `yta`:
case `play`:
case `song`:
case `sing`:
case `ytmp3`:
case `ytplay`:
case `ytaudio`:
case `ytmusic`:
case `youtubemusic`:
await yta(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ytv`:
case `watch`:
case `stream`:
case `ytmp4`:
case `ytvideo`:
case `youtubevideo`:
await ytv(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `yts`:
case `ytsearch`:
case `ytscrape`:
case `youtubescrape`:
case `youtubesearch`:
await yts(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `sr`:
case `reddit`:
case `subreddit`:
await reddit(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `rank`:
await rank(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `tts`:
case `gtts`:
case `text2speech`:
await tts(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `fun`:
case `joke`:
case `funny`:
case `laugh`:
case `dadjoke`:
await joke(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `meme`:
await meme(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `tinyurl`:
await tinyurl(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `join`:
await join(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `leave`:
await leave(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `lyrics`:
await lyrics(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `gimage`:
case `image`:
await image(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `web`:
case `find`:
case `search`:
case `google`:
await google(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `take`:
case `steal`:
await steal(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `iguser`:
await iguser(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ship`:
await ship(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `quote`:
await quote(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `fact`:
await fact(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `advice`:
await advice(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `pat`:
await pat(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `hug`:
await hug(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `kiss`:
await kiss(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `cuddle`:
await cuddle(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `kick`:
await kick(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `bite`:
await bite(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `blush`:
await blush(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `bored`:
await bored(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `confused`:
await confused(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `cry`:
await cry(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `goodnight`:
await goodnight(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `happy`:
await happy(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `poke`:
await poke(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `sad`:
await sad(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `slap`:
await slap(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `smile`:
await smile(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `wave`:
await wave(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `wink`:
await wink(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `dance`:
await dance(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `baka`:
await baka(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `bonk`:
await bonk(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `hi5`:
case `highfive`:
await highfive(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `kill`:
await kill(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `nervous`:
await nervous(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `punch`:
await punch(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `scream`:
await scream(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `stare`:
await stare(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `yeet`:
await yeet(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `yes`:
await yes(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `zerotwo`:
await zerotwo(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `waifu`:
await waifu(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `neko`:
await neko(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `anime`:
await anime(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `manga`:
await manga(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `wallpaper`:
await wallpaper(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `bc`:
case `bcgroup`:
await bcgroup(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `yt8d`:
await yt8d(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ytbassboost`:
await ytbassboost(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ytecho`:
await ytecho(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ytflanger`:
await ytflanger(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ytnightcore`:
await ytnightcore(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ytphaser`:
await ytphaser(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ytreverse`:
await ytreverse(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ytslow`:
await ytslow(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ytspeed`:
await ytspeed(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ytsubboost`:
await ytsubboost(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ytsuperslow`:
await ytsuperspeed(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ytsuperslow`:
await ytsuperslow(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ytsurround`:
await ytsurround(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ytvaporwave`:
await ytvaporwave(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ytvibrato`:
await ytvibrato(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `bassboost`:
await bassboost(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `echo`:
await echo(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `flanger`:
await flanger(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `nightcore`:
await nightcore(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `phaser`:
await phaser(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `reverse`:
await reverse(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `slow`:
await slow(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `speed`:
await speed(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `subboost`:
await subboost(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `superspeed`:
await superspeed(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `surround`:
await surround(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `vaporwave`:
await vaporwave(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `vibrato`:
await vibrato(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `ass`:
await ass(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `bdsm`:
await bdsm(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `cum`:
await cum(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `doujin`:
await doujin(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `feet`:
await feet(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `femdom`:
await femdom(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `foxgirl`:
await foxgirl(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `glasses`:
await glasses(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `hentai`:
await hentai(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `maid`:
await maid(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `masturbation`:
await masturbation(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `netorare`:
await netorare(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `orgy`:
await orgy(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.participants,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `panties`:
await panties(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `school`:
await school(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `tentacles`:
await tentacles(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `thighs`:
await thighs(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `uniform`:
await uniform(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `yuri`:
await yuri(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `dly`:
case `daily`:
await daily(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `fish`:
case `pond`:
case `fishes`:
await fish(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `bet`:
case `gamble`:
case `betting`:
case `roulette`:
await gamble(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `hunt`:
case `hunting`:
case `pokehunt`:
await hunt(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `zoo`:
case `forest`:
case `animals`:
await zoo(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `pay`:
case `loan`:
case `borrow`:
case `payment`:
await pay(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `bal`:
case `gold`:
case `money`:
case `balance`:
await balance(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `buy`:
await buy(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `mall`:
case `shop`:
case `store`:
case `shopping`:
await store(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `rob`:
case `thief`:
case `robbery`:
await rob(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `bag`:
case `inv`:
case `loot`:
case `inventory`:
await bag(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `sp`:
case `dev`:
case `devs`:
case `official`:
case `support`:
await support(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `rule`:
case `rules`:
await rules(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
case `h`:
case `how`:
case `help`:
case `menu`:
case `allmenu`:
await help(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.fromMe,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.quoted,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isMedia,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupAdmins,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isBotAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.Body,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isReply,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByTag,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mentionByReply
);
break;
"|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|";
default:
return await ᴋᴜɴᴀɪ.sendMessage(
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID,
{
contextInfo: { mentionedJid: [Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender] },
image: {
url: "https://i.postimg.cc/qB1f08hd/Uni.png",
},
caption: `╔══『 𝐏𝐫𝐨𝐟𝐢𝐥𝐞𝐫® 』
║ *❣️ ɴᴀᴍᴇ:* ${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName || "No_Name"}
║ *⚡ ɪᴅ:* ${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID.split("@")[0]}
╚═══════╝


*❌𝕰𝖗𝖗𝖔𝖗:* No Such Command.*
Type ${prefix}help or ${prefix}menu`,
footer: "*⦓ ⒸѶ𝖆𝖑𝐤𝐲𝖗𝖎𝖊 ⦔*\nᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ",
buttons: [
{
buttonId: prefix + "help",
buttonText: { displayText: prefix + "help" },
type: 1,
},
{
buttonId: prefix + "support",
buttonText: {
displayText: prefix + "support",
},
type: 1,
},
],
headerType: 4,
},
{
quoted: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
}
);
}
}
}
}
}
);
}
);
};
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
* * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
*/
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
