`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
`|🍹|      (𝐜)𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭 | 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!       |`;
`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
`|🍹|`;
`|🍹|`;
`|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
const Sakura_Buttons = require(`../../Sakura🛰️Server/Sakura_Buttons`);
const Sakura_Static = require(`../../Sakura🛰️Server/Sakura_Static`);
const { MessageType, Mimetype } = require(`@adiwajshing/baileys`);
const cleanRF = require(`../../Sakura🛰️Server/cleanRF`);
const ꜰᴜᴄᴋ = require(`../../Sakura🛰️Server/oShit`);
const speed = require(`performance-now`);
const _𝔏𝔞𝔟_ = require(`../../Sakura🛰️Server/_𝔏𝔞𝔟_`);
var ᴋᴇɪᴇx = new RegExp(_𝔏𝔞𝔟_.FOXTROT, `g`);
var ᴋᴇɪ = /\/\^\[(.*)+\]\/\g/g.exec(ᴋᴇɪᴇx)[1];
const fs = require(`fs`);
var path = require(`path`);
var scriptName = path.basename(__filename);
var newScpt = scriptName.slice(0, -3).toLowerCase();
`|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
module.exports = {
  name: newScpt,
  async handle(ӄʀǟӄɨռʐ, mozart, ֆǟӄʊʀǟ, Needs, ꜱɪᴛʀᴀᴘ, Clock, Ping, Timers) {
    try {
      var աɦօֆɛռȶɦǟȶ = ֆǟӄʊʀǟ.sender;
      var աɦօֆɛռȶɦǟȶռʊʍ = աɦօֆɛռȶɦǟȶ.substring(0, աɦօֆɛռȶɦǟȶ.length - 15);
      const defaultnm = ֆǟӄʊʀǟ.commandName;
      const FinalName = defaultnm.charAt(0).toUpperCase() + defaultnm.slice(1);
      `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
      const hold = require("../../Sakura🛰️Server/Hold");
      hold.Hold(ֆǟӄʊʀǟ);
      `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
      return Sakura_Buttons.MIB(
        ӄʀǟӄɨռʐ,
        mozart,
        ֆǟӄʊʀǟ,
        `🦋𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 •@${աɦօֆɛռȶɦǟȶռʊʍ}, ${Timers}

╔════◇🍣 𝐀𝐧𝐢𝐦𝐞
║⬡ *${ᴋᴇɪ}anime*  _search any anime_
║⬡ *${ᴋᴇɪ}ranimewall*  _get random anime wallpaper_
║⬡ *${ᴋᴇɪ}smile*  _(gif)_ 
║⬡ *${ᴋᴇɪ}yes*  _(gif)_
║⬡ *${ᴋᴇɪ}bite*  _(gif)_
║⬡ *${ᴋᴇɪ}blush*  _(gif)_
║⬡ *${ᴋᴇɪ}bored*  _(gif)_
║⬡ *${ᴋᴇɪ}confused*  _(gif)_
║⬡ *${ᴋᴇɪ}cry*  _(gif)_
║⬡ *${ᴋᴇɪ}goodnight*  _(gif)_
║⬡ *${ᴋᴇɪ}happy*  _(gif)_
║⬡ *${ᴋᴇɪ}hi5*  _(gif)_
║⬡ *${ᴋᴇɪ}poke*  _(gif)_
║⬡ *${ᴋᴇɪ}sad*  _(gif)_
║⬡ *${ᴋᴇɪ}thinking*  _(gif)_
║⬡ *${ᴋᴇɪ}cuddle*  _(gif)_
║⬡ *${ᴋᴇɪ}hug*  _(gif)_
║⬡ *${ᴋᴇɪ}pat*  _(gif)_
║⬡ *${ᴋᴇɪ}slap*  _(gif)_ 
║⬡ *${ᴋᴇɪ}wink*  _(gif)_
║⬡ *${ᴋᴇɪ}angry*  _(gif)_
║⬡ *${ᴋᴇɪ}baka*  _(gif)_
║⬡ *${ᴋᴇɪ}bonk*  _(gif)_
║⬡ *${ᴋᴇɪ}bully*  _(gif)_
║⬡ *${ᴋᴇɪ}bye*  _(gif)_
║⬡ *${ᴋᴇɪ}chase*  _(gif)_
║⬡ *${ᴋᴇɪ}cheer*  _(gif)_
║⬡ *${ᴋᴇɪ}cringe*  _(gif)_
║⬡ *${ᴋᴇɪ}dab*  _(gif)_
║⬡ *${ᴋᴇɪ}dance*  _(gif)_
║⬡ *${ᴋᴇɪ}die*  _(gif)_
║⬡ *${ᴋᴇɪ}facepalm*  _(gif)_
║⬡ *${ᴋᴇɪ}feed*  _(gif)_
║⬡ *${ᴋᴇɪ}glomp*  _(gif)_
║⬡ *${ᴋᴇɪ}hold*  _(gif)_
║⬡ *${ᴋᴇɪ}hate*  _(gif)_
║⬡ *${ᴋᴇɪ}hi*  _(gif)_
║⬡ *${ᴋᴇɪ}kill*  _(gif)_
║⬡ *${ᴋᴇɪ}laugh*  _(gif)_
║⬡ *${ᴋᴇɪ}lick*  _(gif)_
║⬡ *${ᴋᴇɪ}love*  _(gif)_
║⬡ *${ᴋᴇɪ}lurk*  _(gif)_
║⬡ *${ᴋᴇɪ}nervous*  _(gif)_
║⬡ *${ᴋᴇɪ}nope*  _(gif)_
║⬡ *${ᴋᴇɪ}nom*  _(gif)_
║⬡ *${ᴋᴇɪ}nuzzle*  _(gif)_
║⬡ *${ᴋᴇɪ}panic*  _(gif)_
║⬡ *${ᴋᴇɪ}peck*  _(gif)_
║⬡ *${ᴋᴇɪ}poke*  _(gif)_
║⬡ *${ᴋᴇɪ}pout*  _(gif)_
║⬡ *${ᴋᴇɪ}run*  _(gif)_
║⬡ *${ᴋᴇɪ}sip*  _(gif)_
║⬡ *${ᴋᴇɪ}shoot*  _(gif)_
║⬡ *${ᴋᴇɪ}shrug*  _(gif)_
║⬡ *${ᴋᴇɪ}sleep*  _(gif)_
║⬡ *${ᴋᴇɪ}smug*  _(gif)_
║⬡ *${ᴋᴇɪ}stab*  _(gif)_
║⬡ *${ᴋᴇɪ}stare*  _(gif)_
║⬡ *${ᴋᴇɪ}tease*  _(gif)_
║⬡ *${ᴋᴇɪ}tickle*  _(gif)_
║⬡ *${ᴋᴇɪ}thumbsup*  _(gif)_
║⬡ *${ᴋᴇɪ}triggered*  _(gif)_
║⬡ *${ᴋᴇɪ}wag*  _(gif)_
╚════════════╝`,
        `./Sakura☣️Reactor/ֆǟӄʊʀǟ.png`
      );
    } catch (Error) {
      ꜰᴜᴄᴋ.catch(Error, ӄʀǟӄɨռʐ, ֆǟӄʊʀǟ, mozart);
      return;
    }
  },
};
`|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
`|🍹|`;
`|🍹|`;
`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
`|🍹|      (𝐜)𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭 | 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!       |`;
`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
