`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
`|🍹|      (𝐜)𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭 | 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!       |`;
`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
`|🍹|`;
`|🍹|`;
`|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
const Sakura_Buttons = require(`../../Sakura🛰️Server/Sakura_Buttons`);
const { formatp, runtime } = require(`../../Sakura🛰️Server/mizu`);
const _𝔏𝔞𝔟_ = require(`../../Sakura🛰️Server/_𝔏𝔞𝔟_`);
const ꜰᴜᴄᴋ = require(`../../Sakura🛰️Server/oShit`);
const { performance } = require(`perf_hooks`);
const vers = require(`../../package.json`);
const speed = require(`performance-now`);
var ᴋᴇɪᴇx = new RegExp(_𝔏𝔞𝔟_.FOXTROT, `g`);
var ᴋᴇɪ = /\/\^\[(.*)+\]\/\g/g.exec(ᴋᴇɪᴇx)[1];
const fs = require(`fs`);
const os = require(`os`);
var path = require(`path`);
var scriptName = path.basename(__filename);
var newScpt = scriptName.slice(0, -3).toLowerCase();
`|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
module.exports = {
  name: newScpt,
  async handle(ӄʀǟӄɨռʐ, mozart, ֆǟӄʊʀǟ, Needs, ꜱɪᴛʀᴀᴘ, Clock, Ping, Timers) {
    try {
      var աɦօֆɛռȶɦǟȶ = ֆǟӄʊʀǟ.sender;
      var աɦօֆɛռȶɦǟȶռʊʍ = աɦօֆɛռȶɦǟȶ.substring(0, աɦօֆɛռȶɦǟȶ.length - 15);
      const defaultnm = ֆǟӄʊʀǟ.commandName;
      const FinalName = defaultnm.charAt(0).toUpperCase() + defaultnm.slice(1);
      `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
      const hold = require("../../Sakura🛰️Server/Hold");
      hold.Hold(ֆǟӄʊʀǟ);
      `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
      const used = process.memoryUsage();
      const cpus = os.cpus().map((cpu) => {
        cpu.total = Object.keys(cpu.times).reduce(
          (last, type) => last + cpu.times[type],
          0
        );
        return cpu;
      });
      const cpu = cpus.reduce(
        (last, cpu, _, { length }) => {
          last.total += cpu.total;
          last.speed += cpu.speed / length;
          last.times.user += cpu.times.user;
          last.times.nice += cpu.times.nice;
          last.times.sys += cpu.times.sys;
          last.times.idle += cpu.times.idle;
          last.times.irq += cpu.times.irq;
          return last;
        },
        {
          speed: 0,
          total: 0,
          times: {
            user: 0,
            nice: 0,
            sys: 0,
            idle: 0,
            irq: 0,
          },
        }
      );

      let timestamp = speed();
      let latensi = speed() - timestamp;
      neww = performance.now();
      oldd = performance.now();
      `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
      var MediaUrl = `./Sakura☣️Reactor/ֆǟӄʊʀǟ.png`;
      var MainText = `🦋𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 @${աɦօֆɛռȶɦǟȶռʊʍ} ${Timers}, 
🍹𝐒𝐚𝐤𝐮𝐫𝐚 𝐈𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!

╔════◇★ 𝐒𝐲𝐦𝐥𝐢𝐧𝐤 |▷
║シ︎ ⚙️𝐄𝐧𝐠𝐢𝐧𝐞: ${vers.vers}
║シ︎ 💻𝐏𝐥𝐚𝐭𝐅𝐨𝐫𝐦: ${os.platform()}
║シ︎ 🛰️𝐋𝐚𝐭𝐞𝐧𝐜𝐲: ${latensi.toFixed(4)}ms
║シ︎ ☕𝐔𝐩𝐓𝐢𝐦𝐞: ${runtime(process.uptime())}
║シ︎ 🎮𝐑𝐀𝐌: ${formatp(os.totalmem() - os.freemem())} / ${formatp(os.totalmem())}
╚════════════╝


╔════◇🔎 𝐒𝐞𝐚𝐫𝐜𝐡 |▷
║▷ ${ᴋᴇɪ}ytsearc
║▷ ${ᴋᴇɪ}lyrics
║▷ ${ᴋᴇɪ}github
║▷ ${ᴋᴇɪ}pinterest
║▷ ${ᴋᴇɪ}weather
║▷ ${ᴋᴇɪ}google 
║▷ ${ᴋᴇɪ}wikipedia
║▷ ${ᴋᴇɪ}ud
║▷ ${ᴋᴇɪ}tenor
║▷ ${ᴋᴇɪ}gif
║▷ ${ᴋᴇɪ}wallpaper
╚════════════╝

╔════◇💰 𝗘𝗰𝗼𝗻𝗼𝗺𝘆 |▷
║▷ ${ᴋᴇɪ}shop
║▷ ${ᴋᴇɪ}zoo
║▷ ${ᴋᴇɪ}buy
║▷ ${ᴋᴇɪ}hunt
║▷ ${ᴋᴇɪ}gamble
║▷ ${ᴋᴇɪ}fish
║▷ ${ᴋᴇɪ}daily
║▷ ${ᴋᴇɪ}work
║▷ ${ᴋᴇɪ}balance
╚════════════╝

╔════◇🗂️ 𝐅𝐅𝐦𝐩𝐞𝐠 |▷
║▷ ${ᴋᴇɪ}tomp3
║▷ ${ᴋᴇɪ}img2url
║▷ ${ᴋᴇɪ}ocr
║▷ ${ᴋᴇɪ}sticker
║▷ ${ᴋᴇɪ}carbon
╚════════════╝


╔════◇🏝️ 𝐅𝐢𝐥𝐭𝐞𝐫𝐬/𝐀𝐮𝐝𝐢𝐨 |▷
║▷ ${ᴋᴇɪ}bass
║▷ ${ᴋᴇɪ}blown
║▷ ${ᴋᴇɪ}deep
║▷ ${ᴋᴇɪ}earrape
║▷ ${ᴋᴇɪ}fast
║▷ ${ᴋᴇɪ}fat
║▷ ${ᴋᴇɪ}nightcore
║▷ ${ᴋᴇɪ}reverse
║▷ ${ᴋᴇɪ}robot
║▷ ${ᴋᴇɪ}slow
║▷ ${ᴋᴇɪ}smooth
╚════════════╝


╔════◇📥 𝐃𝐨𝐰𝐧𝐥𝐨𝐚𝐝𝐞𝐫𝐬 |▷
║▷ ${ᴋᴇɪ}yt
║▷ ${ᴋᴇɪ}play
║▷ ${ᴋᴇɪ}song
║▷ ${ᴋᴇɪ}youtubeaudio
║▷ ${ᴋᴇɪ}watch
║▷ ${ᴋᴇɪ}stream
║▷ ${ᴋᴇɪ}youtubevideo
║▷ ${ᴋᴇɪ}mp3link
║▷ ${ᴋᴇɪ}mp4link
║▷ ${ᴋᴇɪ}instagram
╚════════════╝


╔════◇🐙 𝐊𝐢𝐧𝐠/𝐎𝐰𝐧𝐞𝐫 |▷
║▷ ${ᴋᴇɪ}dyno
║▷ ${ᴋᴇɪ}ban
║▷ ${ᴋᴇɪ}unban
║▷ ${ᴋᴇɪ}broadcast
║▷ ${ᴋᴇɪ}bugreport
║▷ ${ᴋᴇɪ}help
║▷ ${ᴋᴇɪ}mizuki
║▷ ${ᴋᴇɪ}reboot
║▷ ${ᴋᴇɪ}broadcast
║▷ ${ᴋᴇɪ}leave
║▷ ${ᴋᴇɪ}spam
╚════════════╝


╔════◇🍣 𝐀𝐧𝐢𝐦𝐞 |▷
║▷ ${ᴋᴇɪ}anime
║▷ ${ᴋᴇɪ}ranimewall
║▷ ${ᴋᴇɪ}smile
║▷ ${ᴋᴇɪ}yes
║▷ ${ᴋᴇɪ}bite
║▷ ${ᴋᴇɪ}blush
║▷ ${ᴋᴇɪ}bored
║▷ ${ᴋᴇɪ}confused
║▷ ${ᴋᴇɪ}cry
║▷ ${ᴋᴇɪ}goodnight
║▷ ${ᴋᴇɪ}happy
║▷ ${ᴋᴇɪ}hi5
║▷ ${ᴋᴇɪ}poke
║▷ ${ᴋᴇɪ}sad
║▷ ${ᴋᴇɪ}thinking
║▷ ${ᴋᴇɪ}cuddle
║▷ ${ᴋᴇɪ}hug
║▷ ${ᴋᴇɪ}pat
║▷ ${ᴋᴇɪ}slap
║▷ ${ᴋᴇɪ}wink
║▷ ${ᴋᴇɪ}angry
║▷ ${ᴋᴇɪ}baka
║▷ ${ᴋᴇɪ}bonk
║▷ ${ᴋᴇɪ}bully
║▷ ${ᴋᴇɪ}bye
║▷ ${ᴋᴇɪ}chase
║▷ ${ᴋᴇɪ}cheer
║▷ ${ᴋᴇɪ}cringe
║▷ ${ᴋᴇɪ}dab
║▷ ${ᴋᴇɪ}dance
║▷ ${ᴋᴇɪ}die
║▷ ${ᴋᴇɪ}facepalm
║▷ ${ᴋᴇɪ}feed
║▷ ${ᴋᴇɪ}glomp
║▷ ${ᴋᴇɪ}hold
║▷ ${ᴋᴇɪ}hate
║▷ ${ᴋᴇɪ}hi
║▷ ${ᴋᴇɪ}kill
║▷ ${ᴋᴇɪ}laugh
║▷ ${ᴋᴇɪ}lick
║▷ ${ᴋᴇɪ}love
║▷ ${ᴋᴇɪ}lurk
║▷ ${ᴋᴇɪ}nervous
║▷ ${ᴋᴇɪ}nope
║▷ ${ᴋᴇɪ}nom
║▷ ${ᴋᴇɪ}nuzzle
║▷ ${ᴋᴇɪ}panic
║▷ ${ᴋᴇɪ}peck
║▷ ${ᴋᴇɪ}pout
║▷ ${ᴋᴇɪ}run
║▷ ${ᴋᴇɪ}sip
║▷ ${ᴋᴇɪ}shoot
║▷ ${ᴋᴇɪ}shrug
║▷ ${ᴋᴇɪ}sleep
║▷ ${ᴋᴇɪ}smug
║▷ ${ᴋᴇɪ}stab
║▷ ${ᴋᴇɪ}stare
║▷ ${ᴋᴇɪ}tease
║▷ ${ᴋᴇɪ}tickle
║▷ ${ᴋᴇɪ}thumbsup
║▷ ${ᴋᴇɪ}triggered
║▷ ${ᴋᴇɪ}wag
╚════════════╝


╔════◇🔰 𝐆𝐫𝐨𝐮𝐩𝐬/𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧 |▷
║▷ ${ᴋᴇɪ}promote
║▷ ${ᴋᴇɪ}demote
║▷ ${ᴋᴇɪ}warn
║▷ ${ᴋᴇɪ}unwarn
║▷ ${ᴋᴇɪ}invite
║▷ ${ᴋᴇɪ}lock
║▷ ${ᴋᴇɪ}unlock
║▷ ${ᴋᴇɪ}admins
║▷ ${ᴋᴇɪ}groupdp
║▷ ${ᴋᴇɪ}kick
║▷ ${ᴋᴇɪ}getdesc
║▷ ${ᴋᴇɪ}getdp
║▷ ${ᴋᴇɪ}tagall
║▷ ${ᴋᴇɪ}setwelcome
║▷ ${ᴋᴇɪ}antilink
╚════════════╝


╔════◇🦄 𝐑𝐚𝐧𝐝𝐨𝐦𝐬 |▷
║▷ ${ᴋᴇɪ}rank
║▷ ${ᴋᴇɪ}joke
║▷ ${ᴋᴇɪ}meme
║▷ ${ᴋᴇɪ}tr
║▷ ${ᴋᴇɪ}tts
║▷ ${ᴋᴇɪ}pokedex
╚════════════╝

╔════◇🎨 𝐂𝐡𝐞𝐜𝐤 |▷
║▷ ${ᴋᴇɪ}gaycheck
║▷ ${ᴋᴇɪ}lesbocheck
║▷ ${ᴋᴇɪ}beautycheck
║▷ ${ᴋᴇɪ}dumbcheck
╚════════════╝


╔════◇🥃 𝐇𝐮𝐦𝐚𝐧/𝐍𝐒𝐅𝐖 |▷
║▷ ${ᴋᴇɪ}4k
║▷ ${ᴋᴇɪ}blowjob
║▷ ${ᴋᴇɪ}milf
║▷ ${ᴋᴇɪ}milk
║▷ ${ᴋᴇɪ}pussy
║▷ ${ᴋᴇɪ}slut
║▷ ${ᴋᴇɪ}tikporn
╚════════════╝


╔════◇🍄𝐇𝐞𝐧𝐭𝐚𝐢/𝐍𝐒𝐅𝐖 |▷
║▷ ${ᴋᴇɪ}porn
║▷ ${ᴋᴇɪ}ass
║▷ ${ᴋᴇɪ}bdsm
║▷ ${ᴋᴇɪ}cum  
║▷ ${ᴋᴇɪ}doujin
║▷ ${ᴋᴇɪ}feet  
║▷ ${ᴋᴇɪ}femdom  
║▷ ${ᴋᴇɪ}foxgirl  
║▷ ${ᴋᴇɪ}glasses  
║▷ ${ᴋᴇɪ}hentai
║▷ ${ᴋᴇɪ}maid 
║▷ ${ᴋᴇɪ}masturbation
║▷ ${ᴋᴇɪ}netorare  
║▷ ${ᴋᴇɪ}orgy
║▷ ${ᴋᴇɪ}panties
║▷ ${ᴋᴇɪ}pussy
║▷ ${ᴋᴇɪ}school
║▷ ${ᴋᴇɪ}tentacles
║▷ ${ᴋᴇɪ}thighs
║▷ ${ᴋᴇɪ}uniform
║▷ ${ᴋᴇɪ}yuri
╚════════════╝`;
      Sakura_Buttons.MIB(ӄʀǟӄɨռʐ, mozart, ֆǟӄʊʀǟ, MainText, MediaUrl);
      return;
      `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
    } catch (Error) {
      ꜰᴜᴄᴋ.catch(Error, ӄʀǟӄɨռʐ, ֆǟӄʊʀǟ, mozart);
      return;
    }
  },
};
`|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
`|🍹|`;
`|🍹|`;
`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
`|🍹|      (𝐜)𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭 | 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!       |`;
`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
