("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
* * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
*/
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
import ӄօʟօʀ from "@heroku-cli/color";
exports.ӄօʟօʀs = async (ᴋᴜɴᴀɪ: any, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊: any) => {
let Latest: any = new Date();
let 𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆 = await Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata;
await ᴋᴜɴᴀɪ.sendReadReceipt(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender, [Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.key.id]);
console.log(ӄօʟօʀ.black(ӄօʟօʀ.red("▷═════════════════════|✠|═════════════════════◁")));
console.log(ӄօʟօʀ.black(ӄօʟօʀ.bgWhite("🕐𝐓𝐢𝐦𝐞: "), ӄօʟօʀ.bgGreen(Latest || "")));
console.log(ӄօʟօʀ.black(ӄօʟօʀ.bgWhite("💤𝐂𝐨𝐦𝐦𝐚𝐧𝐝: "), ӄօʟօʀ.bgGreen(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.commandName || "")));
console.log(ӄօʟօʀ.black(ӄօʟօʀ.bgWhite("🧛🏽‍♂️𝐒𝐞𝐧𝐝𝐞𝐫: "), ӄօʟօʀ.bgGreen(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender || "")));
console.log(ӄօʟօʀ.black(ӄօʟօʀ.bgWhite("🧛🏽‍♂️𝐒𝐞𝐧𝐝𝐞𝐫𝐍𝐚𝐦𝐞: "), ӄօʟօʀ.bgGreen(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.pushName || "")));
console.log(ӄօʟօʀ.black(ӄօʟօʀ.bgWhite("❗𝐢𝐬𝐒𝐞𝐧𝐝𝐞𝐫𝐀𝐝𝐦𝐢𝐧: "), ӄօʟօʀ.bgGreen(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderAdmin || "")));
console.log(ӄօʟօʀ.black(ӄօʟօʀ.bgWhite("⚡𝐢𝐬𝐒𝐞𝐧𝐝𝐞𝐫𝐓𝐔𝐅: "), ӄօʟօʀ.bgGreen(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isSenderTUF || "")));
console.log(ӄօʟօʀ.black(ӄօʟօʀ.bgWhite("🧀𝐆𝐫𝐨𝐮𝐩𝐍𝐚𝐦𝐞: "), ӄօʟօʀ.bgGreen(𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆.subject || "")));
console.log(ӄօʟօʀ.black(ӄօʟօʀ.red("▷═════════════════════|✠|═════════════════════◁")));
console.log("{\nᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™\n}");
};
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
* * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
*/
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");