`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/*        
(𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
// let user = global.DATABASE.data.users[chat.sender];
// if (user.afk > -1) {
//   chat.reply(
//     `
// you stop AFK${user.afkReason ? " after " + user.afkReason : ""}
// During ${clockString(new Date() - user.afk)}
// `.trim()
//   );
//   user.afk = -1;
//   user.afkReason = "";
// }
// let jids = [
//   ...new Set([
//     ...(chat.mentionedJid || []),
//     ...(chat.quoted ? [chat.quoted.sender] : []),
//   ]),
// ];
// for (let jid of jids) {
//   let user = global.DATABASE.data.users[jid];
//   if (!user) continue;
//   let afkTime = user.afk;
//   if (!afkTime || afkTime < 0) continue;
//   let reason = user.afkReason || "";
//   chat.reply(
//     `
// Don't tag him!
// he's AFK ${reason ? "with reason " + reason : "no reason"}
// During ${clockString(new Date() - afkTime)}
// `.trim()
//   );
// }
// return true;

// function clockString(ms) {
//   let h = isNaN(ms) ? "--" : Math.floor(ms / 3600000);
//   let chat = isNaN(ms) ? "--" : Math.floor(ms / 60000) % 60;
//   let s = isNaN(ms) ? "--" : Math.floor(ms / 1000) % 60;
//   return [h, chat, s].map((v) => v.toString().padStart(2, 0)).join(":");
// }
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/*        
(𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;