#===============================================================================
#🎮ʊʟȶʀօռ™ 𝘈𝘥𝘷𝘢𝘯𝘤𝘦 𝘞𝘩𝘢𝘵𝘴𝘢𝘱𝘱 𝘜𝘴𝘦𝘳𝘣𝘰𝘵 𝘞𝘪𝘵𝘩 80+ 𝘊𝘰𝘮𝘮𝘢𝘯𝘥𝘴 𝘧𝘰𝘳 𝘣𝘰𝘵𝘩 𝘗𝘳𝘪𝘷𝘢𝘵𝘦 𝘢𝘯𝘥 𝘗𝘶𝘣𝘭𝘪𝘤..
#===============================================================================
FROM kalilinux/kali-rolling
RUN apt update 
RUN apt-get install curl -y
RUN curl -sL https://deb.nodesource.com/setup_17.x | bash -
RUN apt upgrade -y 
RUN apt install git -y 
RUN apt install nodejs -y
RUN apt install python3 -y 
RUN apt install python3-pip -y 
RUN apt install fonts-symbola 
RUN git clone https://github.com/Krakinz/Ultron.git
RUN cd Ultron
WORKDIR /Ultron
RUN npm install 
CMD node 🎮ʊʟȶʀօռ™.js
#===============================================================================
#🎮ʊʟȶʀօռ™ 𝘈𝘥𝘷𝘢𝘯𝘤𝘦 𝘞𝘩𝘢𝘵𝘴𝘢𝘱𝘱 𝘜𝘴𝘦𝘳𝘣𝘰𝘵 𝘞𝘪𝘵𝘩 80+ 𝘊𝘰𝘮𝘮𝘢𝘯𝘥𝘴 𝘧𝘰𝘳 𝘣𝘰𝘵𝘩 𝘗𝘳𝘪𝘷𝘢𝘵𝘦 𝘢𝘯𝘥 𝘗𝘶𝘣𝘭𝘪𝘤..
#===============================================================================