const _0x14205d = _0x267a;
(function (_0x4f4539, _0xabed8f) {
  const _0x433f10 = _0x267a,
    _0xd7bc6f = _0x4f4539();
  while (!![]) {
    try {
      const _0x13289c =
        (-parseInt(_0x433f10(0x110)) / 0x1) *
          (-parseInt(_0x433f10(0x111)) / 0x2) +
        (parseInt(_0x433f10(0xf8)) / 0x3) * (parseInt(_0x433f10(0xfc)) / 0x4) +
        parseInt(_0x433f10(0x10b)) / 0x5 +
        (-parseInt(_0x433f10(0x106)) / 0x6) *
          (parseInt(_0x433f10(0xfa)) / 0x7) +
        (-parseInt(_0x433f10(0xfe)) / 0x8) *
          (-parseInt(_0x433f10(0x103)) / 0x9) +
        (parseInt(_0x433f10(0x101)) / 0xa) * (parseInt(_0x433f10(0xfb)) / 0xb) +
        (-parseInt(_0x433f10(0x10c)) / 0xc) *
          (parseInt(_0x433f10(0x115)) / 0xd);
      if (_0x13289c === _0xabed8f) break;
      else _0xd7bc6f["push"](_0xd7bc6f["shift"]());
    } catch (_0x5f1c43) {
      _0xd7bc6f["push"](_0xd7bc6f["shift"]());
    }
  }
})(_0x2492, 0xb97b8),
  "|⬡════════════════════════════════════════════════════════════|▷\x20\x20\x20ᴘᴏᴡᴇʀᴇᴅ\x20ʙʏ\x20ᴋʀᴀᴋɪɴᴢʟᴀʙ™\x20\x20◁|════════════════════════════════════════════════════════════⬡|",
  _0x14205d(0xf9);
function _0x267a(_0x379495, _0x46e04a) {
  const _0x249230 = _0x2492();
  return (
    (_0x267a = function (_0x267abf, _0x38774f) {
      _0x267abf = _0x267abf - 0xf8;
      let _0x2226b3 = _0x249230[_0x267abf];
      return _0x2226b3;
    }),
    _0x267a(_0x379495, _0x46e04a)
  );
}
let cron = require(_0x14205d(0x116));
cron[_0x14205d(0x105)](_0x14205d(0x112), () => {
  const _0x992d12 = _0x14205d;
  let _0x3d1424 = require(_0x992d12(0x10f)),
    _0x440c40 = require(_0x992d12(0x118)),
    _0x162ba2 = new Date(),
    _0x2a93bd = ("0" + _0x162ba2[_0x992d12(0x100)]())[_0x992d12(0x10e)](-0x2),
    _0x49d23c = ("0" + (_0x162ba2[_0x992d12(0x104)]() + 0x1))["slice"](-0x2),
    _0x11e1bc = _0x162ba2[_0x992d12(0x109)](),
    _0x5d20ed = _0x162ba2["getHours"](),
    _0x45701a = _0x162ba2["getMinutes"](),
    _0x441068 = _0x162ba2["getSeconds"]();
  !_0x3d1424["which"](_0x992d12(0x107)) &&
    (_0x3d1424[_0x992d12(0x10d)](_0x992d12(0xff)),
    _0x3d1424[_0x992d12(0x113)](0x1)),
    _0x3d1424[_0x992d12(0x10a)](
      "git\x20pull\x20&&\x20git\x20add\x20--all\x20&&\x20git\x20commit\x20-am\x20\x22「\x20Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊\x20」\x20:\x20" +
        _0x440c40[_0x992d12(0xfd)] +
        _0x992d12(0x114) +
        (_0x11e1bc +
          "-" +
          _0x49d23c +
          "-" +
          _0x2a93bd +
          "\x20" +
          _0x5d20ed +
          ":" +
          _0x45701a +
          ":" +
          _0x441068) +
        "\x20\x22\x20&&\x20git\x20push"
    )[_0x992d12(0x117)] !== 0x0 &&
      (_0x3d1424[_0x992d12(0x102)](), _0x3d1424["echo"](_0x992d12(0x108)));
}),
  _0x14205d(0xf9),
  "|⬡════════════════════════════════════════════════════════════|▷\x20\x20\x20ᴘᴏᴡᴇʀᴇᴅ\x20ʙʏ\x20ᴋʀᴀᴋɪɴᴢʟᴀʙ™\x20\x20◁|════════════════════════════════════════════════════════════⬡|";
function _0x2492() {
  const _0x53cb01 = [
    "node-cron",
    "code",
    "./package.json",
    "3znrchh",
    "|⬡════════════════════════════════════════════════════════════|▷\x20\x20\x20ᴘᴏᴡᴇʀᴇᴅ\x20ʙʏ\x20ᴋʀᴀᴋɪɴᴢʟᴀʙ™\x20\x20◁|════════════════════════════════════════════════════════════⬡|",
    "7GLByjw",
    "11KOiGmk",
    "991948nuihvM",
    "vers",
    "750184RNQfuM",
    "Sorry,\x20this\x20script\x20requires\x20git",
    "getDate",
    "6495950rUhPmo",
    "error",
    "63DrLqWy",
    "getMonth",
    "schedule",
    "4527222uNscRa",
    "git",
    "💡𝐈𝐧𝐟𝐨꧂\x20Exited\x20With\x20Code\x20!==0",
    "getFullYear",
    "exec",
    "4435600WOiDFK",
    "12LPeaHM",
    "echo",
    "slice",
    "shelljs",
    "1FkWxio",
    "724706GuOmME",
    "*/2\x20*\x20*\x20*\x20*\x20*",
    "exit",
    "\x20🧆\x20𝐃𝐚𝐭𝐞:\x20",
    "16759509wciTFM",
  ];
  _0x2492 = function () {
    return _0x53cb01;
  };
  return _0x2492();
}
