`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
`|🍹|      (𝐜)𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭 | 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!       |`;
`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
`|🍹|`;
`|🍹|`;
const fs = require(`fs`);
const ascii = require(`ascii-table`);
function Tǟɮʟɛɨȶ(ꜱɪᴛʀᴀᴘ, commandUsage) {
  const ᴛᴀʙʟᴇ = new ascii().setHeading("✭𝐒𝐚𝐤𝐮𝐫𝐚✭", "✭𝐁𝐨𝐭✭");
  const ᴅᴇʀꜱ = fs.readdirSync(`./Sakura🍹System`);
  for (const ʟᴅᴇʀ of ᴅᴇʀꜱ) {
    const cmdF = fs
      .readdirSync(`./Sakura🍹System/${ʟᴅᴇʀ}`)
      .filter((ɪꜱᴏ) => ɪꜱᴏ.endsWith(`.js`));
    for (const ɪꜱᴏ of cmdF) {
      const command = require(`./Sakura🍹System/${ʟᴅᴇʀ}/${ɪꜱᴏ}`);
      ꜱɪᴛʀᴀᴘ.set(command.name, command);
      commandUsage.set(command.ֆǟӄʊʀǟӄǟɨʐօ, command.description);
      try {
        ᴛᴀʙʟᴇ.addRow("⚡ " + command.name.toUpperCase(), ʟᴅᴇʀ);
      } catch {
        ᴛᴀʙʟᴇ.addRow("⚡ " + command.name, ʟᴅᴇʀ);
      }
      // console.log(ᴛᴀʙʟᴇ);
    }
  }
}
module.exports = { Tǟɮʟɛɨȶ };
`|🍹|`;
`|🍹|`;
`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
`|🍹|      (𝐜)𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭 | 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!       |`;
`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
