`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
`|🍹|      (𝐜)𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭 | 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!       |`;
`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
`|🍹|`;
`|🍹|`;
const fs = require(`fs`);
const Kolor = require(`chalk`);
const ascii = require(`ascii-table`);
const ᴍɪᴢᴜᴋɪᴛᴀʙʟᴇ = new ascii().setHeading(
  `🍹𝐂𝐨𝐦𝐦𝐚𝐧 𝐍𝐚𝐦𝐞🍹`,
  `🍹𝗖𝗼𝗺𝗺𝗮𝗻𝗱 𝗙𝗼𝗹𝗱𝗲𝗿🍹`,
  `🍹𝐇𝐞𝐚𝐥𝐭𝐡🍹`
);
const _𝔏𝔞𝔟_ = require(`./Sakura🛰️Server/_𝔏𝔞𝔟_`);
// ⬡ ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳 ⬡==========================⬡    🍹 (c)ֆǟӄʊʀǟ 🍹    ⬡==========================⬡ 𝐋𝐚𝐛™ ⬡
function ʄǟռƈʏ(ꜱɪᴛʀᴀᴘ, commandUsage) {
  const ᴍɪᴢᴜᴋɪᴅᴇʀꜱ = fs.readdirSync(`./Sakura🍹System`);
  for (const ʜᴏʟᴅᴇʀ of ᴍɪᴢᴜᴋɪᴅᴇʀꜱ) {
    const commandFiles = fs
      .readdirSync(`./Sakura🍹System/${ʜᴏʟᴅᴇʀ}`)
      .filter((ᴍɪꜱᴏ) => ᴍɪꜱᴏ.endsWith(`.js`));
    for (const ᴍɪꜱᴏ of commandFiles) {
      const command = require(`./Sakura🍹System/${ʜᴏʟᴅᴇʀ}/${ᴍɪꜱᴏ}`);
      ꜱɪᴛʀᴀᴘ.set(command.name, command);
      commandUsage.set(command.ֆǟӄʊʀǟӄǟɨʐօ, command.description);
      if (_𝔏𝔞𝔟_.HEROKU === undefined) {
        try {
          ᴍɪᴢᴜᴋɪᴛᴀʙʟᴇ.addRow(
            Kolor.green(command.name.toUpperCase()),
            ʜᴏʟᴅᴇʀ,
            `✔️   𝘚𝘺𝘮-𝘓𝘪𝘯𝘬𝘦𝘥`
          );
        } catch {
          ᴍɪᴢᴜᴋɪᴛᴀʙʟᴇ.addRow(
            Kolor.green(command.name),
            ʜᴏʟᴅᴇʀ,
            `✔️   𝘚𝘺𝘮-𝘓𝘪𝘯𝘬𝘦𝘥`
          );
        }
        console.log(ᴍɪᴢᴜᴋɪᴛᴀʙʟᴇ.toString());
      }
    }
  }
}
module.exports = { ʄǟռƈʏ };
`|🍹|`;
`|🍹|`;
`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
`|🍹|      (𝐜)𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭 | 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!       |`;
`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
