import platform
import psutil
import os
from cprint import *
my_system = platform.uname()
cprint('⬡==========================⬡    🍁 爪𝖎𝖟𝖚ӄ𝖎™ 🍁    ⬡==========================⬡')
cprint(f'🍁System: {my_system.system}')
cprint(f'🍁Node Name: {my_system.node}')
cprint(f'🍁Release: {my_system.release}')
cprint(f'🍁Version: {my_system.version}')
cprint(f'🍁Machine: {my_system.machine}')
cprint(f'🍁Memory: {psutil.virtual_memory()}')
cprint(f'🍁Processor: {my_system.processor}')
cprint('''
⬡==========================⬡    🍁 爪𝖎𝖟𝖚ӄ𝖎™ 🍁    ⬡==========================⬡
                ███╗   ███╗██╗███████╗██╗   ██╗██╗  ██╗██╗
                ████╗ ████║██║╚══███╔╝██║   ██║██║ ██╔╝██║
                ██╔████╔██║██║  ███╔╝ ██║   ██║█████╔╝ ██║
                ██║╚██╔╝██║██║ ███╔╝  ██║   ██║██╔═██╗ ██║
                ██║ ╚═╝ ██║██║███████╗╚██████╔╝██║  ██╗██║
                ╚═╝     ╚═╝╚═╝╚══════╝ ╚═════╝ ╚═╝  ╚═╝╚═╝
⬡==========================⬡    🍁 爪𝖎𝖟𝖚ӄ𝖎™ 🍁    ⬡==========================⬡
''')
os.system('node 🍁爪𝖎𝖟𝖚ӄ𝖎™.js')
