("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
* * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
*/
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let ᴅᴇꜱɢ = require("chalk");
let ʀɪᴍʀᴀꜰ = require("rimraf");
let ɢɪᴛ = require("simple-git")();
let vers = require("./package.json");
async function 𝕮𝖑𝖊𝖆𝖓𝕮𝖔𝖓𝖙𝖆𝖎𝖓𝖊𝖗() {
let ꜰᴏʟᴅᴇʀꜱ = [".",...Object.keys(require("./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🎒𝕭𝖆𝖌/ꜱᴘᴀᴄᴇ.json").ꜱᴘᴀᴄᴇ)];
for (let ꜰᴏʟᴅᴇʀ of ꜰᴏʟᴅᴇʀꜱ) {
ʀɪᴍʀᴀꜰ(ꜰᴏʟᴅᴇʀ, function (ERROR) {
if (ERROR) return console.log(ᴅᴇꜱɢ.bgRed("-rm"), ERROR);
console.log(ᴅᴇꜱɢ.bgGreen("-rm"), ꜰᴏʟᴅᴇʀ);
});
}
}
`|⬡═════════════════════════════════════════════════════════════════════|▷ 𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 ◁|═════════════════════════════════════════════════════════════════════⬡|`;
async function 𝕲𝖊𝖙𝕮𝖔𝖓𝖙𝖆𝖎𝖓𝖊𝖗() {
let 𝐕 = require("child_process").exec("git pull");
𝐕.stderr.pipe(process.stderr);
𝐕.on("exit", function (ᴇᴄᴏᴅᴇ, ᴇꜱɪɢɴᴀʟ) {
if (ᴇᴄᴏᴅᴇ) console.log(ᴅᴇꜱɢ.red(ᴇᴄᴏᴅᴇ));
if (ᴇꜱɪɢɴᴀʟ) console.log(ᴅᴇꜱɢ.blue(ᴇꜱɪɢɴᴀʟ));
process.exitCode = 1;
});
}
`|⬡═════════════════════════════════════════════════════════════════════|▷ 𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 ◁|═════════════════════════════════════════════════════════════════════⬡|`;
async function 𝕻𝖚𝖘𝖍𝕮𝖔𝖓𝖙𝖆𝖎𝖓𝖊𝖗() {
let ᴅᴀᴛᴇ_ᴏʙ = new Date();
let ᴅᴀᴛᴇ = ("0" + ᴅᴀᴛᴇ_ᴏʙ.getDate()).slice(-2);
let ᴍᴏɴᴛʜ = ("0" + (ᴅᴀᴛᴇ_ᴏʙ.getMonth() + 1)).slice(-2);
let ʏᴇᴀʀ = ᴅᴀᴛᴇ_ᴏʙ.getFullYear();
let hours = ᴅᴀᴛᴇ_ᴏʙ.getHours();
let ᴍɪɴᴜᴛᴇꜱ = ᴅᴀᴛᴇ_ᴏʙ.getMinutes();
let ꜱᴇᴄᴏɴᴅꜱ = ᴅᴀᴛᴇ_ᴏʙ.getSeconds();
let 𝐕 = require("child_process").exec(
`git pull && git add --all && git commit -am "「 Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊™ 」: ${vers.vers} 📅𝐃𝐚𝐭𝐞: ${ʏᴇᴀʀ +"-" +ᴍᴏɴᴛʜ +"-" +ᴅᴀᴛᴇ +" " +hours +":" +ᴍɪɴᴜᴛᴇꜱ +":" +ꜱᴇᴄᴏɴᴅꜱ} " && git push`);
𝐕.stderr.pipe(process.stderr);
𝐕.on("exit", function (ᴇᴄᴏᴅᴇ, ᴇꜱɪɢɴᴀʟ) {
if (ᴇᴄᴏᴅᴇ) console.log(ᴅᴇꜱɢ.red(ᴇᴄᴏᴅᴇ));
if (ᴇꜱɪɢɴᴀʟ) console.log(ᴅᴇꜱɢ.blue(ᴇꜱɪɢɴᴀʟ));
process.exitCode = 1;
});
}
`|⬡═════════════════════════════════════════════════════════════════════|▷ 𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 ◁|═════════════════════════════════════════════════════════════════════⬡|`;
async function ᴄᴏᴍᴍɪᴛ() {
await ɢɪᴛ.fetch();
let ɴᴇᴡᴄᴏᴍᴍɪᴛꜱ = await ɢɪᴛ.log(["🐍Ş𝖎𝖕𝖍𝖔𝖓®..origin/🐍Ş𝖎𝖕𝖍𝖔𝖓®"]);
if (ɴᴇᴡᴄᴏᴍᴍɪᴛꜱ.total != 0) {
await 𝕮𝖑𝖊𝖆𝖓𝕮𝖔𝖓𝖙𝖆𝖎𝖓𝖊𝖗();
await 𝕲𝖊𝖙𝕮𝖔𝖓𝖙𝖆𝖎𝖓𝖊𝖗();
} 
// console.log(ᴅᴇꜱɢ.bgYellow(new Date()));
// await 𝕻𝖚𝖘𝖍𝕮𝖔𝖓𝖙𝖆𝖎𝖓𝖊𝖗();
}
ᴄᴏᴍᴍɪᴛ().catch((ERROR) => console.error(ERROR));
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
* * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
*/
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
