import platform
import psutil
import os
my_system = platform.uname()
print('⬡==========================⬡    🍁 爪𝖎𝖟𝖚ӄ𝖎™ 🍁    ⬡==========================⬡')
print(f'🍁𝐒𝐲𝐬𝐭𝐞𝐦: {my_system.system}')
print(f'🍁𝐍𝐨𝐝𝐞 𝐍𝐚𝐦𝐞: {my_system.node}')
print(f'🍁𝐑𝐞𝐥𝐞𝐚𝐬𝐞: {my_system.release}')
print(f'🍁𝐕𝐞𝐫𝐬𝐢𝐨𝐧: {my_system.version}')
print(f'🍁𝐌𝐚𝐜𝐡𝐢𝐧𝐞: {my_system.machine}')
print(f'🍁𝐌𝐞𝐦𝐨𝐫𝐲: {psutil.virtual_memory()}')
print(f'🍁𝐏𝐫𝐨𝐜𝐞𝐬𝐬𝐨𝐫: {my_system.processor}')
print('''
⬡==========================⬡    🍁 爪𝖎𝖟𝖚ӄ𝖎™ 🍁    ⬡==========================⬡
                ███╗   ███╗██╗███████╗██╗   ██╗██╗  ██╗██╗
                ████╗ ████║██║╚══███╔╝██║   ██║██║ ██╔╝██║
                ██╔████╔██║██║  ███╔╝ ██║   ██║█████╔╝ ██║
                ██║╚██╔╝██║██║ ███╔╝  ██║   ██║██╔═██╗ ██║
                ██║ ╚═╝ ██║██║███████╗╚██████╔╝██║  ██╗██║
                ╚═╝     ╚═╝╚═╝╚══════╝ ╚═════╝ ╚═╝  ╚═╝╚═╝
⬡==========================⬡    🍁 爪𝖎𝖟𝖚ӄ𝖎™ 🍁    ⬡==========================⬡
''')
os.system('node ʍɨʐʊӄɨ🛰️ֆɛʀʋɛʀ/🍁爪𝖎𝖟𝖚ӄ𝖎™.js')
