`🐙============================================================================================================================<⚡>`;
const { MessageType, Mimetype } = require(`@adiwajshing/baileys`);
const _𝔏𝔞𝔟_ = require(`../../🧀𝓜𝖎𝖟𝖚ӄ𝖎🧀/_𝔏𝔞𝔟_`);
const ℓιєηт = require(`../../🧀𝓜𝖎𝖟𝖚ӄ𝖎🧀/catch`);
var ᴋᴇɪᴇx = new RegExp(_𝔏𝔞𝔟_.FOXTROT, `g`);
var ᴋᴇɪ = /\/\^\[(.*)+\]\/\g/g.exec(ᴋᴇɪᴇx)[1];
const vers = require(`../../package.json`);
`🐙`;
`🐙`;
`🐙============================================================================================================================<⚡>`;
`   𝐌𝐢𝐳𝐮𝐤𝐢™   💡𝘈𝘥𝘷𝘢𝘯𝘤𝘦 𝘞𝘩𝘢𝘵𝘴𝘢𝘱𝘱 𝘜𝘴𝘦𝘳𝘣𝘰𝘵 𝘞𝘪𝘵𝘩 80+ 𝘊𝘰𝘮𝘮𝘢𝘯𝘥𝘴 𝘧𝘰𝘳 𝘣𝘰𝘵𝘩 𝘗𝘳𝘪𝘷𝘢𝘵𝘦 𝘢𝘯𝘥 𝘗𝘶𝘣𝘭𝘪𝘤.. `;
`🐙============================================================================================================================<⚡>`;
`🐙`;
`🐙`;
module.exports = {
  name: `take`,
  async handle(ӄʀǟӄɨռʐ, chat, 𝓜𝖎𝖟𝖚ӄ𝖎, arg, 𝓜𝓲𝔃𝓾𝓴𝓲𝓢𝓲𝓽𝓻𝓮𝓹) {
    try {
      `🐙============================================================================================================================<⚡>`;
      var ꜱᴇɴᴅᴇʀɪᴅ = 𝓜𝖎𝖟𝖚ӄ𝖎.sender;
      var ꜱᴇɴᴅᴇʀeceived = ꜱᴇɴᴅᴇʀɪᴅ.substring(0, ꜱᴇɴᴅᴇʀɪᴅ.length - 15);
      const defaultnm = 𝓜𝖎𝖟𝖚ӄ𝖎.commandName;
      const FinalName = defaultnm.charAt(0).toUpperCase() + defaultnm.slice(1);
      console.log("𝐓𝐨𝐩𝐢𝐜: " + FinalName);
      `🐙============================================================================================================================<⚡>`;
      require("../../🧀𝓜𝖎𝖟𝖚ӄ𝖎🧀/fetcher.js").createExif(satu, dua);
      require("../../🧀𝓜𝖎𝖟𝖚ӄ𝖎🧀/fetcher.js").modStick(
        media,
        ӄʀǟӄɨռʐ,
        chat,
        ꜱᴇɴᴅᴇʀɪᴅ
      );
      encmedia = JSON.parse(JSON.stringify(chat).replace("quotedM", "m"))
        .message.extendedTextMessage.contextInfo;
      media = await ӄʀǟӄɨռʐ.downloadAndSaveMediaMessage(encmedia);
      anu = arg.join(" ").split("|");
      satu = anu[0] !== "" ? anu[0] : `SELF`;
      dua = typeof anu[1] !== "undefined" ? anu[1] : `BOT`;
      require("../../🧀𝓜𝖎𝖟𝖚ӄ𝖎🧀/fetcher.js").createExif(satu, dua);
      require("../../🧀𝓜𝖎𝖟𝖚ӄ𝖎🧀/fetcher.js").modStick(
        media,
        ӄʀǟӄɨռʐ,
        chat,
        ꜱᴇɴᴅᴇʀɪᴅ
      );
    } catch (ℓαвєяяσя) {
      ℓιєηт.catch(ℓαвєяяσя, ӄʀǟӄɨռʐ, 𝓜𝖎𝖟𝖚ӄ𝖎);
      console.log(ℓαвєяяσя);
    }
  },
};
`🐙============================================================================================================================<⚡>`;
