`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
`|                                                                                                                        |`;
`|        (𝐜)𝐂𝐨𝐫𝐥𝐞𝐱𝐚𝐀𝐈 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!            |`;
`|                                                                                                                        |`;
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
const ᴄᴏʀʟᴇxᴀ_Buttons = require(`../../ᴄᴏʀʟᴇxᴀ🛰️Server/ᴄᴏʀʟᴇxᴀ_Buttons`);
const _𝔏𝔞𝔟_ = require(`../../ᴄᴏʀʟᴇxᴀ🛰️Server/_𝔏𝔞𝔟_`);
const ꜰᴜᴄᴋ = require(`../../ᴄᴏʀʟᴇxᴀ🛰️Server/oShit`);
const fs = require(`fs`);
var ᴋᴇɪᴇx = new RegExp(_𝔏𝔞𝔟_.FOXTROT, `g`);
const vers = require(`../../package.json`);
var ᴋᴇɪ = /\/\^\[(.*)+\]\/\g/g.exec(ᴋᴇɪᴇx)[1];
var path = require(`path`);
var scriptName = path.basename(__filename);
var newScpt = scriptName.slice(0, -3).toLowerCase();
`|⬡════════════════════════════════════════════|   (𝐜)𝐂𝐨𝐫𝐥𝐞𝐱𝐚𝐀𝐈  🛸  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛   |═══════════════════════════════════════════⬡|`;
module.exports = {
name: newScpt,
async handle(ӄʀǟӄɨռʐ, chat, 𝖈𝖔𝖗𝖑𝖊𝖝𝖆, Needs, ꜱɪᴛʀᴀᴘ, Clock, Ping) {
try {
var աɦօֆɛռȶɦǟȶ = 𝖈𝖔𝖗𝖑𝖊𝖝𝖆.sender;
const defaultnm = 𝖈𝖔𝖗𝖑𝖊𝖝𝖆.commandName;
var աɦօֆɛռȶɦǟȶռʊʍ = աɦօֆɛռȶɦǟȶ
.substring(0, աɦօֆɛռȶɦǟȶ.length - 15)
.replace(/[+ ]/g, "");
const FinalName = defaultnm.charAt(0).toUpperCase() + defaultnm.slice(1);
`|⬡════════════════════════════════════════════|   (𝐜)𝐂𝐨𝐫𝐥𝐞𝐱𝐚𝐀𝐈  🛸  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛   |═══════════════════════════════════════════⬡|`;
if (!𝖈𝖔𝖗𝖑𝖊𝖝𝖆.isSenderDev) {
return ᴄᴏʀʟᴇxᴀ_Buttons.MTB(
ӄʀǟӄɨռʐ,
chat,
𝖈𝖔𝖗𝖑𝖊𝖝𝖆,
`❌𝐃𝐞𝐧𝐢𝐞𝐝: _Owner/Dev Only.You Are Not Allowed!_`
);
} else if (𝖈𝖔𝖗𝖑𝖊𝖝𝖆.isGroup) {
return ᴄᴏʀʟᴇxᴀ_Buttons.MTB(
ӄʀǟӄɨռʐ,
chat,
𝖈𝖔𝖗𝖑𝖊𝖝𝖆,
`🪶 𝐇𝐞𝐲: @${աɦօֆɛռȶɦǟȶռʊʍ}, 

╔════◇🔒𝐏𝐞𝐫𝐦𝐢𝐬𝐬𝐢𝐨𝐧 
║💡 _This Command is Only For Private!_
╚════════════╝`
);
} else if (𝖈𝖔𝖗𝖑𝖊𝖝𝖆.isSenderDev && !𝖈𝖔𝖗𝖑𝖊𝖝𝖆.isGroup) {
ᴄᴏʀʟᴇxᴀ_Buttons.MTB(
ӄʀǟӄɨռʐ,
chat,
𝖈𝖔𝖗𝖑𝖊𝖝𝖆,
`
╔════| 𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™ by _Krakinz🐙kon_ 
║
║- @${աɦօֆɛռȶɦǟȶռʊʍ}, _(Verified-Admin)_
║- 𝐂𝐨𝐧𝐠𝐫𝐚𝐭𝐬 𝐎𝐧 𝐁𝐞𝐢𝐧𝐠 𝐀 𝐕𝐞𝐫𝐢𝐟𝐢𝐞𝐝 𝐀𝐝𝐦𝐢𝐧 𝐨𝐟 (𝐜)𝐂𝐨𝐫𝐥𝐞𝐱𝐚 𝐆𝐫𝐨𝐮𝐩 𝐂𝐡𝐚𝐭.
║- 𝗥𝗲𝗺𝗲𝗺𝗯𝗲𝗿 𝗗𝗼 𝗡𝗼𝘁 𝗩𝗶𝗼𝗹𝗮𝘁𝗲 𝗮𝗻𝗱/𝗼𝗿 𝗔𝗯𝘂𝘀𝗲 𝗮𝗻𝘆𝘁𝗵𝗶𝗻𝗴/𝗼𝗻𝗲.
║- 𝗬𝗼𝘂 𝗪𝗶𝗹𝗹 𝗕𝗲 𝗠𝗼𝗻𝗶𝘁𝗼𝗿𝗲𝗱.
╚════════════╝



╔════| 🛸(𝐜)𝐂𝐨𝐫𝐥𝐞𝐱𝐚: 𝙷𝚎𝚛𝚎 𝚊𝚛𝚎 𝚝𝚑𝚎 𝚙𝚎𝚛𝚔𝚜 𝚞𝚗𝚍𝚎𝚛 𝙼𝚢 𝙳𝚊𝚝𝚊𝙱𝚊𝚜𝚎
║
║- 𝗥𝘂𝗻𝗻𝗶𝗻𝗴 𝘂𝗻𝗱𝗲𝗿 𝗽𝗼𝗿𝘁𝗮𝗹: _kzenKraby ${vers.vers}apb_
║- 𝗪𝗮𝗶𝘁 𝗧𝗶𝗺𝗲 𝗶𝘀 𝗻𝗼𝘄: _5seconds_
║- 𝗚𝗿𝗼𝘂𝗽𝘀 + 𝗣𝗿𝗶𝘃𝗮𝘁𝗲 𝗨𝘀𝗮𝗴𝗲: _On_
║- 𝗔𝘂𝘁𝗼-𝗚𝗲𝘁 𝗕𝘂𝗴𝗿𝗲𝗽𝗼𝗿𝘁𝘀: _Make Sure to inform to Devs_
║- _Allowed to be a contributer in sakura Krakinz branch_
║- 𝗦𝗽𝗲𝗰𝗶𝗮𝗹 𝗰𝗼𝗺𝗺𝗮𝗻𝗱: _reboot/broadcast/tagall/setwelcome/dyno/spam/ban/unban/scan/cooldown_
║- 𝗔𝗱𝘂𝗹𝘁 𝗰𝗼𝗺𝗺𝗮𝗻𝗱: _unlocked in all groups_
╚════════════╝


╔════| 𝙳𝚘𝚗'𝚝 𝙵𝚘𝚛𝚐𝚎𝚝 𝚃𝚘 𝙱𝚎 𝚊 𝙿𝚊𝚛𝚝 𝙾𝚏 𝙰𝚕𝚕 𝚂𝚊𝚔𝚞𝚛𝚊 𝙶𝚛𝚘𝚞𝚙𝚜 𝚄𝚗𝚍𝚎𝚛 𝙼𝚎.
║
║- 𝐂𝐨𝐫𝐥𝐞𝐱𝐚 #𝟏: ${_𝔏𝔞𝔟_.HASHS}
║- 𝐂𝐨𝐫𝐥𝐞𝐱𝐚 #2: ${_𝔏𝔞𝔟_.HASH}
╚════════════╝`
);
return;
} else {
return ᴄᴏʀʟᴇxᴀ_Buttons.MTB(
ӄʀǟӄɨռʐ,
chat,
𝖈𝖔𝖗𝖑𝖊𝖝𝖆,
`❌𝐃𝐞𝐧𝐢𝐞𝐝: _Owner/Dev Only.You Are Not Allowed!_`
);
}
`|⬡════════════════════════════════════════════|   (𝐜)𝐂𝐨𝐫𝐥𝐞𝐱𝐚𝐀𝐈  🛸  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛   |═══════════════════════════════════════════⬡|`;
} catch (Error) {
ꜰᴜᴄᴋ.catch(Error, ӄʀǟӄɨռʐ, 𝖈𝖔𝖗𝖑𝖊𝖝𝖆, chat);
return;
}
},
};
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
`|                                                                                                                        |`;
`|        (𝐜)𝐂𝐨𝐫𝐥𝐞𝐱𝐚𝐀𝐈 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!            |`;
`|                                                                                                                        |`;
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
