("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
* * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
*/
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let axios = require(`axios`);
let ᴀɴɪᴍᴇ = require(`anime-actions`);
let ᴀɴɪᴍᴇ2 = require(`anime-actions`);
let {
fetchJson,
GIFBufferToVideoBuffer,
} = require(`../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/myfunc`);
let { DownloaderHelper } = require("node-downloader-helper");
(async () => {
let ꜰɪɴᴀʟʟɪɴᴋ;
var ᴀɴɪᴍᴇʟɪɴᴋ = await ᴀɴɪᴍᴇ.bite();
if (!ᴀɴɪᴍᴇʟɪɴᴋ.endsWith(".gif") && !ᴀɴɪᴍᴇʟɪɴᴋ.endsWith(".mp4")) {
ꜰɪɴᴀʟʟɪɴᴋ = await ᴀɴɪᴍᴇ2.bite();
} else {
ꜰɪɴᴀʟʟɪɴᴋ = ᴀɴɪᴍᴇʟɪɴᴋ;
}
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
let ʀᴇꜱᴘᴏɴꜱᴇ = await axios.get(ꜰɪɴᴀʟʟɪɴᴋ, {
responseType: "arraybuffer",
});
let ʀᴇꜱᴘᴏɴꜱᴇʙᴜꜰꜰᴇʀ = Buffer.from(ʀᴇꜱᴘᴏɴꜱᴇ.data, "utf-8");
let ʀᴇꜱᴘᴏɴꜱᴇɢɪꜰ = await GIFBufferToVideoBuffer(ʀᴇꜱᴘᴏɴꜱᴇʙᴜꜰꜰᴇʀ);
let ꜰᴏᴜɴᴅ = await fetchJson(`https://api.waifu.pics/sfw/cuddle`);
let ʀᴇꜱᴘᴏɴꜱ = await axios.get(ꜰᴏᴜɴᴅ.url, {
responseType: "arraybuffer",
});
let ʀᴇꜱᴘᴏɴꜱᴇʙᴜꜰꜰᴇ = Buffer.from(ʀᴇꜱᴘᴏɴꜱ.data, "utf-8");
let ʀᴇꜱᴘᴏɴꜱᴇɢɪ = await GIFBufferToVideoBuffer(ʀᴇꜱᴘᴏɴꜱᴇʙᴜꜰꜰᴇ);
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
console.log(ʀᴇꜱᴘᴏɴꜱᴇɢɪ);
console.log(ʀᴇꜱᴘᴏɴꜱᴇɢɪꜰ);
console.log(ꜰɪɴᴀʟʟɪɴᴋ);
console.log(ꜰᴏᴜɴᴅ.url);
let dl𝐀𝐩𝐢 = new DownloaderHelper(ꜰɪɴᴀʟʟɪɴᴋ, __dirname);
dl𝐀𝐩𝐢.on("end", () => console.log("Download Completed"));
dl𝐀𝐩𝐢.on("error", (err) => console.log("Download Failed\n", err));
dl𝐀𝐩𝐢.start().catch((err) => console.error(err));
})();
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
* * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
*/
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
