// ⬡ ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳 ⬡==========================⬡    🍁 (c)爪𝖎𝖟𝖚ӄ𝖎 🍁    ⬡==========================⬡ 𝐋𝐚𝐛™ ⬡
const Mizuki_Buttons = require(`../../ʍɨʐʊӄɨ🛰️ֆɛʀʋɛʀ/Mizuki_Buttons`);
const Mizuki_Static = require(`../../ʍɨʐʊӄɨ🛰️ֆɛʀʋɛʀ/Mizuki_Static`);
const { MessageType, Mimetype } = require(`@adiwajshing/baileys`);
const ꜰᴜᴄᴋ = require(`../../ʍɨʐʊӄɨ🛰️ֆɛʀʋɛʀ/oShit`);
const _𝔏𝔞𝔟_ = require(`../../ʍɨʐʊӄɨ🛰️ֆɛʀʋɛʀ/_𝔏𝔞𝔟_`);
var ᴋᴇɪᴇx = new RegExp(_𝔏𝔞𝔟_.FOXTROT, `g`);
var ᴋᴇɪ = /\/\^\[(.*)+\]\/\g/g.exec(ᴋᴇɪᴇx)[1];
// ⬡ ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳 ⬡==========================⬡    🍁 (c)爪𝖎𝖟𝖚ӄ𝖎 🍁    ⬡==========================⬡ 𝐋𝐚𝐛™ ⬡
module.exports = {
  name: `faq`,
  async handle(ӄʀǟӄɨռʐ, chat, 𝓜𝖎𝖟𝖚ӄ𝖎, Needs, ꜱɪᴛʀᴀᴘ, Clock, Ping, Timers) {
    try {
      // ⬡ ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳 ⬡==========================⬡    🍁 (c)爪𝖎𝖟𝖚ӄ𝖎 🍁    ⬡==========================⬡ 𝐋𝐚𝐛™ ⬡
      var ꜱᴇɴᴅᴇʀɪᴅ = 𝓜𝖎𝖟𝖚ӄ𝖎.sender;
      var ꜱᴇɴᴅᴇʀeceived = ꜱᴇɴᴅᴇʀɪᴅ.substring(0, ꜱᴇɴᴅᴇʀɪᴅ.length - 15);
      const defaultnm = 𝓜𝖎𝖟𝖚ӄ𝖎.commandName;
      const FinalName = defaultnm.charAt(0).toUpperCase() + defaultnm.slice(1);
      console.log(
        `🍁爪𝖎𝖟𝖚ӄ𝖎™ ᴠᴇʀɪꜰɪᴇᴅ ꜰɪʟᴇ > ` + FinalName.toUpperCase() + `✔️`
      );
      // ⬡ ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳 ⬡==========================⬡    🍁 (c)爪𝖎𝖟𝖚ӄ𝖎 🍁    ⬡==========================⬡ 𝐋𝐚𝐛™ ⬡
      var MediaUrl = `./ʍɨʐʊӄɨ☣️ƈօʀɛ/𝓜𝖎𝖟𝖚ӄ𝖎™.mp4`;
      var MainText = `👋🏽𝐌𝐨𝐬𝐡𝐢-𝐌𝐨𝐬𝐡𝐢, ${Timers} @${ꜱᴇɴᴅᴇʀeceived},

┌──────────────◆➤
│🔑 𝐏𝐫𝐞𝐟𝐢𝐱: *${ᴋᴇɪ}*
│👑 𝐎𝐰𝐧𝐞𝐫: _🐙KrakinzKon_
│🍁 𝐀𝐝𝐝 𝐌𝐢𝐳𝐮𝐤𝐢: _${ᴋᴇɪ}request_
│☣️ 𝐋𝐢𝐜𝐞𝐧𝐬𝐞𝐝: Apache License Version 2.0
│🍕 𝘾𝙤𝙢𝙞𝙣𝙜 𝙎𝙤𝙤𝙣! _many many more_
└───────〇

🌾 𝐅.𝐀.𝐐
• ɪ ᴀᴍ ʜᴜᴍᴀɴ? ʏᴇꜱ, & ᴍʏ ᴀᴄᴄᴏᴜɴᴛ ʜᴀꜱ ʙᴇᴇɴ ʀᴇ-ᴄᴏᴅᴇᴅ ᴛᴏ ʙᴇ ᴀʙʟᴇ ᴛᴏ ᴜꜱᴇ ᴍɪᴢᴜᴋɪ ʙᴏᴛ
• ᴀᴍ ɪ ᴛʏᴘɪɴɢ ᴀʟʟ ᴛʜᴇꜱᴇ ᴍᴀɴᴜᴀʟʟʏ? ʜᴇʟʟ ɴᴏ. ɪᴛ ɪꜱ ᴀʟʟ ᴄᴏᴅᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ
• ᴡʜᴀᴛ ɪꜱ ᴍɪᴢᴜᴋɪ? ɪᴛ ɪꜱ ᴀ ᴡʜᴀᴛꜱᴀᴘᴘ ʙᴏᴛ ᴍᴀᴅᴇ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ.
• ᴜɴ-ʟɪᴋᴇ ᴛᴇʟᴇɢʀᴀᴍ ᴀɴᴅ ᴅɪꜱᴄᴏʀᴅ ʜᴀᴠᴇ ᴛʜᴇɪʀ ᴏᴡɴ ʙᴏᴛꜱ, ᴍɪᴢᴜᴋɪ ᴜꜱᴇꜱ ɪᴛ'ꜱ ᴜꜱᴇʀ
• ᴡʜʏ ᴀᴍ ɪ ꜱᴇɴᴅɪɴɢ ᴀʟʟ ᴛʜᴏꜱᴇ ᴛᴇxᴛꜱ ɪɴ ʏᴏᴜʀ ɢʀᴏᴜᴘ? ʙᴀᴋᴀ ᴛʜᴏꜱᴇ ᴡᴇʀᴇ ꜱᴇɴᴛ ᴀꜰᴛᴇʀ ʏᴏᴜʀ ʀᴏᴛᴛᴇɴ ᴀꜱꜱ ᴜꜱᴇᴅ ᴍɪᴢᴜᴋɪ ᴄᴏᴍᴍᴀɴᴅꜱ.
• ʏᴏᴜ ᴀʀᴇ ᴅᴜᴍʙ ꜰᴜᴄᴋ ɪꜰ ʏᴏᴜ ᴅᴏɴ'ᴛ ᴜɴᴅᴇʀꜱᴛᴀɴᴅ ᴡʜᴀᴛ ɪꜱ ᴡʀɪᴛᴛᴇɴ ᴀʙᴏᴠᴇ


⚠️ 𝐈𝐌𝐏𝐎𝐑𝐓𝐀𝐍𝐓
• ᴅᴏ ɴᴏᴛ ꜱᴘᴀᴍ ᴍʏ ᴏʀ ᴅᴇᴠ'ꜱ ᴘʀɪᴠᴀᴛᴇ.
• ᴊᴏɪɴ ꜱᴜᴘᴘᴏʀᴛ ɢʀᴏᴜᴘ ꜰᴏʀ ᴀɴʏ Qᴜᴇꜱᴛɪᴏɴꜱ.
• ᴛʏᴘᴇ ᴍᴏʀᴇ ᴛʜᴇɴ 20ᴍɪɴ ɪɴ ᴍʏ ᴘʀɪᴠᴀᴛᴇ ᴀɴᴅ ɢᴇᴛ ʙᴀɴɴᴇᴅ.
• ʙᴇ ᴘᴀᴛɪᴇɴᴛ ᴏʀ ɢᴇᴛ ʙᴀɴɴᴇᴅ.


❓ 𝐇𝐨𝐰 𝐓𝐨 𝐆𝐞𝐭 𝐌𝐢𝐳𝐮𝐤𝐢?
• ᴊᴏɪɴ ꜱᴜᴘᴘᴏʀᴛ ɢʀᴏᴜᴘ
• ᴄᴏᴍᴇ ʙᴀᴄᴋ ɪɴ ᴍʏ ᴘʀɪᴠᴀᴛᴇ
• ᴛʏᴘᴇ /request ꜰᴏʟʟᴏᴡᴇᴅ ʙʏ ʏᴏᴜʀ ɢʀᴏᴜᴘ ʟɪɴᴋ
💡 𝙚𝙭𝙖𝙢𝙥𝙡𝙚: /request https://chat.whatsapp.com/KC32fr1BLmzHYgToZjMuHn


🐙𝐆𝐑𝐎𝐔𝐏: https://chat.whatsapp.com/KC32fr1BLmzHYgToZjMuHn
🦞𝐆𝐢𝐭𝐡𝐮𝐛: https://github.com/krakinz`;
      return Mizuki_Static.MGS(ӄʀǟӄɨռʐ, chat, 𝓜𝖎𝖟𝖚ӄ𝖎, MainText, MediaUrl).catch(
        (ℓαвєяяσя) => ꜰᴜᴄᴋ.catch(ℓαвєяяσя, ӄʀǟӄɨռʐ, 𝓜𝖎𝖟𝖚ӄ𝖎, chat)
      );
      // ⬡ ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳 ⬡==========================⬡    🍁 (c)爪𝖎𝖟𝖚ӄ𝖎 🍁    ⬡==========================⬡ 𝐋𝐚𝐛™ ⬡
    } catch (ℓαвєяяσя) {
      ꜰᴜᴄᴋ.catch(ℓαвєяяσя, ӄʀǟӄɨռʐ, 𝓜𝖎𝖟𝖚ӄ𝖎, chat);
      console.log(ℓαвєяяσя);
    }
  },
};
// ⬡ ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳 ⬡==========================⬡    🍁 (c)爪𝖎𝖟𝖚ӄ𝖎 🍁    ⬡==========================⬡ 𝐋𝐚𝐛™ ⬡
