`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
`|                                                                                                                        |`;
`|        (𝐜)𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!            |`;
`|                                                                                                                        |`;
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
const Sakura_Buttons = require(`../../Sakura🛰️Server/Sakura_Buttons`);
const _𝔏𝔞𝔟_ = require(`../../Sakura🛰️Server/_𝔏𝔞𝔟_`);
const ꜰᴜᴄᴋ = require(`../../Sakura🛰️Server/oShit`);
var ᴋᴇɪᴇx = new RegExp(_𝔏𝔞𝔟_.FOXTROT, `g`);
var ᴋᴇɪ = /\/\^\[(.*)+\]\/\g/g.exec(ᴋᴇɪᴇx)[1];
const fs = require(`fs`);
var path = require(`path`);
var scriptName = path.basename(__filename);
var newScpt = scriptName.slice(0, -3).toLowerCase();
`|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
module.exports = {
name: newScpt,
async handle(ӄʀǟӄɨռʐ, chat, ֆǟӄʊʀǟ, Needs, ꜱɪᴛʀᴀᴘ, Clock, Ping, Timers) {
try {
var աɦօֆɛռȶɦǟȶ = ֆǟӄʊʀǟ.sender;
var defaultnm = ֆǟӄʊʀǟ.commandName;
var աɦօֆɛռȶɦǟȶռʊʍ = աɦօֆɛռȶɦǟȶ.substring(0, աɦօֆɛռȶɦǟȶ.length - 15);
var FinalName = defaultnm.charAt(0).toUpperCase() + defaultnm.slice(1);
if (Needs[0].startsWith("@")) {
var TagPerson = ֆǟӄʊʀǟ.body.replace(
ֆǟӄʊʀǟ.body[0] + ֆǟӄʊʀǟ.commandName + " ",
""
);
var TagMention = TagPerson + "@s.whatsapp.net";
}
`|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
const hold = require("../../Sakura🛰️Server/Hold");
await hold.Hold(ֆǟӄʊʀǟ);
`|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
var MediaUrl = `./Sakura☣️Reactor/ֆǟӄʊʀǟ.png`;
var MainText = `🦋𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 @${աɦօֆɛռȶɦǟȶռʊʍ}, 

╔════◇📥 𝐃𝐨𝐰𝐧𝐥𝐨𝐚𝐝𝐞𝐫𝐬 
║
║• ${ᴋᴇɪ}play
║• ${ᴋᴇɪ}song
║• ${ᴋᴇɪ}stream
║• ${ᴋᴇɪ}watch
║• ${ᴋᴇɪ}ytmlink
║• ${ᴋᴇɪ}ytvlink
║• ${ᴋᴇɪ}instagram
║
╚◇║
╔◇║🔎 𝐒𝐞𝐚𝐫𝐜𝐡 
║
║• ${ᴋᴇɪ}ytsearc
║• ${ᴋᴇɪ}lyrics
║• ${ᴋᴇɪ}github
║• ${ᴋᴇɪ}pinterest
║• ${ᴋᴇɪ}weather
║• ${ᴋᴇɪ}google 
║• ${ᴋᴇɪ}wikipedia
║• ${ᴋᴇɪ}ud
║• ${ᴋᴇɪ}tenor
║• ${ᴋᴇɪ}gif
║• ${ᴋᴇɪ}wallpaper
║
╚◇║
╔◇║💰 𝗚𝗮𝗺𝗲𝘀
║
║• ${ᴋᴇɪ}shop
║• ${ᴋᴇɪ}zoo
║• ${ᴋᴇɪ}inv
║• ${ᴋᴇɪ}buy
║• ${ᴋᴇɪ}pay
║• ${ᴋᴇɪ}hunt
║• ${ᴋᴇɪ}gamble
║• ${ᴋᴇɪ}fish
║• ${ᴋᴇɪ}daily
║• ${ᴋᴇɪ}work
║• ${ᴋᴇɪ}balance
║• ${ᴋᴇɪ}rob _(beta)_
║• ${ᴋᴇɪ}truthdare
║
╚◇║
╔◇║🗂️ 𝐅𝐅𝐦𝐩𝐞𝐠 
║• ${ᴋᴇɪ}tomp3
║• ${ᴋᴇɪ}img2url
║• ${ᴋᴇɪ}ocr
║• ${ᴋᴇɪ}sticker
║• ${ᴋᴇɪ}carbon
║
╚◇║
╔◇║🏝️ 𝐅𝐢𝐥𝐭𝐞𝐫𝐬/𝐀𝐮𝐝𝐢𝐨 
║• ${ᴋᴇɪ}bass
║• ${ᴋᴇɪ}blown
║• ${ᴋᴇɪ}deep
║• ${ᴋᴇɪ}earrape
║• ${ᴋᴇɪ}fast
║• ${ᴋᴇɪ}fat
║• ${ᴋᴇɪ}nightcore
║• ${ᴋᴇɪ}reverse
║• ${ᴋᴇɪ}robot
║• ${ᴋᴇɪ}slow
║• ${ᴋᴇɪ}smooth
║
╚◇║
╔◇║🐙 𝐊𝐢𝐧𝐠/𝐎𝐰𝐧𝐞𝐫 
║
║• ${ᴋᴇɪ}join
║• ${ᴋᴇɪ}dyno
║• ${ᴋᴇɪ}ban
║• ${ᴋᴇɪ}unban
║• ${ᴋᴇɪ}broadcast
║• ${ᴋᴇɪ}bugreport
║• ${ᴋᴇɪ}help
║• ${ᴋᴇɪ}sakura
║• ${ᴋᴇɪ}reboot
║• ${ᴋᴇɪ}broadcast
║• ${ᴋᴇɪ}leave
║• ${ᴋᴇɪ}spam
║
╚◇║
╔◇║🍣 𝐀𝐧𝐢𝐦𝐞 
║
║• ${ᴋᴇɪ}anime
║• ${ᴋᴇɪ}ranimewall
║• ${ᴋᴇɪ}smile
║• ${ᴋᴇɪ}yes
║• ${ᴋᴇɪ}bite
║• ${ᴋᴇɪ}blush
║• ${ᴋᴇɪ}bored
║• ${ᴋᴇɪ}confused
║• ${ᴋᴇɪ}cry
║• ${ᴋᴇɪ}goodnight
║• ${ᴋᴇɪ}happy
║• ${ᴋᴇɪ}hi5
║• ${ᴋᴇɪ}poke
║• ${ᴋᴇɪ}sad
║• ${ᴋᴇɪ}thinking
║• ${ᴋᴇɪ}cuddle
║• ${ᴋᴇɪ}hug
║• ${ᴋᴇɪ}pat
║• ${ᴋᴇɪ}slap
║• ${ᴋᴇɪ}wink
║• ${ᴋᴇɪ}angry
║• ${ᴋᴇɪ}baka
║• ${ᴋᴇɪ}bonk
║• ${ᴋᴇɪ}bully
║• ${ᴋᴇɪ}bye
║• ${ᴋᴇɪ}chase
║• ${ᴋᴇɪ}cheer
║• ${ᴋᴇɪ}cringe
║• ${ᴋᴇɪ}dab
║• ${ᴋᴇɪ}dance
║• ${ᴋᴇɪ}die
║• ${ᴋᴇɪ}facepalm
║• ${ᴋᴇɪ}feed
║• ${ᴋᴇɪ}glomp
║• ${ᴋᴇɪ}hold
║• ${ᴋᴇɪ}hate
║• ${ᴋᴇɪ}hi
║• ${ᴋᴇɪ}kill
║• ${ᴋᴇɪ}laugh
║• ${ᴋᴇɪ}lick
║• ${ᴋᴇɪ}love
║• ${ᴋᴇɪ}lurk
║• ${ᴋᴇɪ}nervous
║• ${ᴋᴇɪ}nope
║• ${ᴋᴇɪ}nom
║• ${ᴋᴇɪ}nuzzle
║• ${ᴋᴇɪ}panic
║• ${ᴋᴇɪ}peck
║• ${ᴋᴇɪ}pout
║• ${ᴋᴇɪ}run
║• ${ᴋᴇɪ}sip
║• ${ᴋᴇɪ}shoot
║• ${ᴋᴇɪ}shrug
║• ${ᴋᴇɪ}sleep
║• ${ᴋᴇɪ}smug
║• ${ᴋᴇɪ}stab
║• ${ᴋᴇɪ}stare
║• ${ᴋᴇɪ}tease
║• ${ᴋᴇɪ}tickle
║• ${ᴋᴇɪ}thumbsup
║• ${ᴋᴇɪ}wag
║
╚◇║
╔◇║🔰 𝐆𝐫𝐨𝐮𝐩𝐬/𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧 
║
║• ${ᴋᴇɪ}antilink
║• ${ᴋᴇɪ}autorank
║• ${ᴋᴇɪ}setwelcome
║• ${ᴋᴇɪ}promote
║• ${ᴋᴇɪ}demote
║• ${ᴋᴇɪ}warn
║• ${ᴋᴇɪ}unwarn
║• ${ᴋᴇɪ}invite
║• ${ᴋᴇɪ}lock
║• ${ᴋᴇɪ}unlock
║• ${ᴋᴇɪ}admins
║• ${ᴋᴇɪ}groupdp
║• ${ᴋᴇɪ}kick
║• ${ᴋᴇɪ}getdesc
║• ${ᴋᴇɪ}getdp
║• ${ᴋᴇɪ}tagall
║
╚◇║
╔◇║🦄 𝐑𝐚𝐧𝐝𝐨𝐦𝐬 
║
║• ${ᴋᴇɪ}rank (taken down)
║• ${ᴋᴇɪ}joke
║• ${ᴋᴇɪ}meme
║• ${ᴋᴇɪ}tr
║• ${ᴋᴇɪ}tts
║• ${ᴋᴇɪ}pokedex
║• ${ᴋᴇɪ}triggered
║
╚◇║
╔◇║🎨 𝐂𝐡𝐞𝐜𝐤 
║
║• ${ᴋᴇɪ}gaycheck
║• ${ᴋᴇɪ}lesbocheck
║• ${ᴋᴇɪ}beautycheck
║• ${ᴋᴇɪ}dumbcheck
║
╚◇║
╔◇║🥃 𝐇𝐮𝐦𝐚𝐧/𝐍𝐒𝐅𝐖 
║
║• ${ᴋᴇɪ}4k
║• ${ᴋᴇɪ}blowjob
║• ${ᴋᴇɪ}milf
║• ${ᴋᴇɪ}milk
║• ${ᴋᴇɪ}pussy
║• ${ᴋᴇɪ}slut
║• ${ᴋᴇɪ}tikporn
║
╚◇║
╔◇║🍄𝐇𝐞𝐧𝐭𝐚𝐢/𝐍𝐒𝐅𝐖 
║
║• ${ᴋᴇɪ}porn
║• ${ᴋᴇɪ}ass
║• ${ᴋᴇɪ}bdsm
║• ${ᴋᴇɪ}cum  
║• ${ᴋᴇɪ}doujin
║• ${ᴋᴇɪ}feet  
║• ${ᴋᴇɪ}femdom  
║• ${ᴋᴇɪ}foxgirl  
║• ${ᴋᴇɪ}glasses  
║• ${ᴋᴇɪ}hentai
║• ${ᴋᴇɪ}maid 
║• ${ᴋᴇɪ}masturbation
║• ${ᴋᴇɪ}netorare  
║• ${ᴋᴇɪ}orgy
║• ${ᴋᴇɪ}panties
║• ${ᴋᴇɪ}pussy
║• ${ᴋᴇɪ}school
║• ${ᴋᴇɪ}tentacles
║• ${ᴋᴇɪ}thighs
║• ${ᴋᴇɪ}uniform
║• ${ᴋᴇɪ}yuri
╚════════════╝

╔════◇❓ 𝐇𝐨𝐰 𝐓𝐨 𝐆𝐞𝐭 𝐒𝐚𝐤𝐮𝐫𝐚?
║• *Visit:* github.com/Krakinz/Sakura
╚◇║
╔◇║👇🏽𝐎𝐟𝐟𝐢𝐜𝐢𝐚𝐥 𝐆𝐫𝐨𝐮𝐩‍ 
║💼 𝐆𝐫𝐨𝐮𝐩: _${_𝔏𝔞𝔟_.HASH}_
║💼 𝐆𝐫𝐨𝐮𝐩: _${_𝔏𝔞𝔟_.HASHS}_
╚════════════╝`;
Sakura_Buttons.MIB(ӄʀǟӄɨռʐ, chat, ֆǟӄʊʀǟ, MainText, MediaUrl);
return;
`|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
} catch (Error) {
ꜰᴜᴄᴋ.catch(Error, ӄʀǟӄɨռʐ, ֆǟӄʊʀǟ, chat);
return;
}
},
};
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
`|                                                                                                                        |`;
`|        (𝐜)𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!            |`;
`|                                                                                                                        |`;
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;