`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
var _0x5dd68f = _0x25cb;
function _0x25cb(_0x472bd7, _0x397d50) {
var _0x19603b = _0x1960();
return (
(_0x25cb = function (_0x25cbf9, _0xd6af9c) {
_0x25cbf9 = _0x25cbf9 - 0x1b0;
var _0x471424 = _0x19603b[_0x25cbf9];
return _0x471424;
}),
_0x25cb(_0x472bd7, _0x397d50)
);
}
(function (_0x1beeb1, _0x296efe) {
var _0x1ea699 = _0x25cb,
_0x5797dd = _0x1beeb1();
while (!![]) {
try {
var _0x1ee56c =
parseInt(_0x1ea699(0x1bd)) / 0x1 +
parseInt(_0x1ea699(0x1b5)) / 0x2 +
-parseInt(_0x1ea699(0x1b0)) / 0x3 +
(-parseInt(_0x1ea699(0x1be)) / 0x4) *
(parseInt(_0x1ea699(0x1b9)) / 0x5) +
(-parseInt(_0x1ea699(0x1c5)) / 0x6) *
(-parseInt(_0x1ea699(0x1b7)) / 0x7) +
(parseInt(_0x1ea699(0x1bf)) / 0x8) *
(parseInt(_0x1ea699(0x1ba)) / 0x9) +
(-parseInt(_0x1ea699(0x1c2)) / 0xa) *
(parseInt(_0x1ea699(0x1c6)) / 0xb);
if (_0x1ee56c === _0x296efe) break;
else _0x5797dd["push"](_0x5797dd["shift"]());
} catch (_0x3ecae2) {
_0x5797dd["push"](_0x5797dd["shift"]());
}
}
})(_0x1960, 0x9ab90),
require(_0x5dd68f(0x1bc)),
(exports[_0x5dd68f(0x1b4)] = async (_0x4ff6b6, _0x2313c2) => {
var _0x3c2473 = _0x5dd68f;
await _0x4ff6b6[_0x3c2473(0x1bb)](
_0x2313c2[_0x3c2473(0x1b6)],
{
contextInfo: { mentionedJid: [_0x2313c2["sender"]] },
image: { url: _0x3c2473(0x1b3) },
caption:
"╔══『\x20𝐏𝐫𝐨𝐟𝐢𝐥𝐞𝐫®\x20』\x0a║\x20*❣️\x20ɴᴀᴍᴇ:*\x20" +
(_0x2313c2[_0x3c2473(0x1b2)] || _0x3c2473(0x1c0)) +
_0x3c2473(0x1c1) +
_0x2313c2[_0x3c2473(0x1b6)][_0x3c2473(0x1b1)]("@")[0x0] +
_0x3c2473(0x1b8),
footer: "*⦓\x20ⒸѶ𝖆𝖑𝐤𝐲𝖗𝖎𝖊\x20⦔*",
buttons: [
{
buttonId: prefix + "help",
buttonText: { displayText: prefix + _0x3c2473(0x1c3) },
type: 0x1,
},
{
buttonId: prefix + _0x3c2473(0x1c4),
buttonText: { displayText: prefix + "support" },
type: 0x1,
},
],
headerType: 0x4,
},
{ quoted: _0x2313c2 }
);
});
function _0x1960() {
var _0x454792 = [
"support",
"73614QrpmDv",
"3344tTBBEb",
"1164060zXimbV",
"split",
"pushName",
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Matte.png",
"Sender_Not_Admin",
"348400JxrLRG",
"chatID",
"7OmdIYf",
"\x0a╚═══════╝\x0a\x0a\x0a*❌ERROR:*\x20This\x20Command\x20is\x20restricted\x20to\x20groups\x20only!",
"5kRytqX",
"3130371sdNjii",
"sendMessage",
"../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/𝕷𝖆ყO𝖚𝖙",
"904882lbaMVJ",
"212856nwLOEK",
"8jWUdiO",
"No_Name",
"\x0a║\x20*⚡\x20ɪᴅ:*\x20",
"11980aKeBwA",
"help",
];
_0x1960 = function () {
return _0x454792;
};
return _0x1960();
}
`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
