`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
var _0x533d5c = _0x4eae;
function _0x4eae(_0x4ae57a, _0x455c1b) {
var _0x2de122 = _0x2de1();
return (
(_0x4eae = function (_0x4eae9c, _0x24656b) {
_0x4eae9c = _0x4eae9c - 0x1af;
var _0x4991de = _0x2de122[_0x4eae9c];
return _0x4991de;
}),
_0x4eae(_0x4ae57a, _0x455c1b)
);
}
(function (_0x25d834, _0x2ad5ba) {
var _0x565656 = _0x4eae,
_0x2ca7af = _0x25d834();
while (!![]) {
try {
var _0x2cd369 =
(-parseInt(_0x565656(0x1e7)) / 0x1) *
(parseInt(_0x565656(0x1de)) / 0x2) +
(-parseInt(_0x565656(0x1ba)) / 0x3) *
(parseInt(_0x565656(0x1c2)) / 0x4) +
(parseInt(_0x565656(0x1cb)) / 0x5) *
(-parseInt(_0x565656(0x1c3)) / 0x6) +
(parseInt(_0x565656(0x1d4)) / 0x7) *
(-parseInt(_0x565656(0x201)) / 0x8) +
(parseInt(_0x565656(0x1f7)) / 0x9) *
(parseInt(_0x565656(0x1d3)) / 0xa) +
(parseInt(_0x565656(0x1e4)) / 0xb) *
(-parseInt(_0x565656(0x1ff)) / 0xc) +
parseInt(_0x565656(0x208)) / 0xd;
if (_0x2cd369 === _0x2ad5ba) break;
else _0x2ca7af["push"](_0x2ca7af["shift"]());
} catch (_0x4d5071) {
_0x2ca7af["push"](_0x2ca7af["shift"]());
}
}
})(_0x2de1, 0x40119),
require(_0x533d5c(0x1f9));
let fs = require("fs"),
fetch = require("node-fetch"),
Levels = require(_0x533d5c(0x1bb)),
canvacord = require(_0x533d5c(0x1d7)),
randomMC = require(_0x533d5c(0x1cd)),
color = randomMC[_0x533d5c(0x1c1)]();
function _0x2de1() {
var _0x204a92 = [
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🎒𝕭𝖆𝖌/",
"getColor",
"82564qdueLb",
"371862wqzNfR",
"setStatus",
"json",
"profilePictureUrl",
"ARanks",
"\x0a║\x20*⚡\x20ɪᴅ:*\x20",
"setLevel",
"wallpapers",
"5CxLloC",
"pushName",
"random-material-color",
"setAvatar",
"Grandmaster\x20I",
"catch",
"createUser",
"setRank",
"70uFhazC",
"396473MhQipY",
"setUsername",
"now",
"canvacord",
"rank",
"appendXp",
"setCurrentXP",
"Elite\x20II",
"Legend\x20IV",
"chatID",
"4714MDIOrI",
"position",
".png",
"|⬡════════════════════════════════════════════════════════════|▷\x20\x20\x20ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ\x20ʙʏ\x20ᴋʀᴀᴋɪɴᴢʟᴀʙ™\x20\x20◁|════════════════════════════════════════════════════════════⬡|",
"Legend\x20II",
"split",
"157806nrtitn",
"Master\x20II",
"COLOR",
"79piuaHt",
"image",
"Legend\x20III",
"floor",
"sender",
"IMAGE",
"Warrior",
"Grandmaster\x20IV",
"search",
"Master\x20IV",
"random",
"Rank",
"log",
"Elite\x20I",
"https://i.postimg.cc/Kc65RLnX/Full.png",
"\x20/\x20",
"366309GOIhkP",
"https://wall.alphacoders.com/api2.0",
"../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/𝕷𝖆ყO𝖚𝖙",
"Master\x20III",
"setBackground",
"setXp",
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.png",
"\x0a*🎐Level*:\x20",
"12bFUhvz",
"API",
"8Qyhcvi",
"setProgressBar",
"\x0a*🔮️Role*:\x20*",
"Legend\x20V",
"Grandmaster\x20II",
"/get.php",
"Grandmaster\x20V",
"4125212VXtSGb",
"Ranker!",
"Epic\x20III",
"Mythic\x20Glory",
"setDiscriminator",
"xpFor",
"Epic\x20V",
"fetch",
"Legend\x20I",
"\x0a╚═══════╝\x0a\x0a\x0a*LEVEL\x20UP!*\x0aCongrats!!\x20🎉🎉\x0a\x0a*🍀Exp*:\x20",
"writeFile",
"setRequiredXP",
"sendMessage",
"3dbsXVP",
"discord-xp",
"Master\x20I",
"key",
"then",
"level",
];
_0x2de1 = function () {
return _0x204a92;
};
return _0x2de1();
}
Levels["setURL"](MONGOOSE),
(exports[_0x533d5c(0x1c7)] = async (_0x469174, _0x2228e5, _0x5c55b1) => {
var _0x25035e = _0x533d5c;
let _0x3ff0f0 =
Math[_0x25035e(0x1ea)](Math[_0x25035e(0x1f1)]() * 0x3) + 0x1,
_0x4a66f7 = await Levels[_0x25035e(0x1b4)](
_0x469174["sender"],
_0x469174[_0x25035e(0x1dd)],
!![]
);
!_0x4a66f7 &&
(await Levels[_0x25035e(0x1d1)](
_0x469174[_0x25035e(0x1eb)],
_0x469174[_0x25035e(0x1dd)]
),
await Levels[_0x25035e(0x1c9)](
_0x469174[_0x25035e(0x1eb)],
_0x469174[_0x25035e(0x1dd)],
0x1
),
await Levels[_0x25035e(0x1fc)](
_0x469174[_0x25035e(0x1eb)],
_0x469174[_0x25035e(0x1dd)],
0x1
));
_0x25035e(0x1e1), console[_0x25035e(0x1f3)](_0x4a66f7);
let _0x5297fb = await Levels[_0x25035e(0x1d9)](
_0x469174["sender"],
_0x469174["chatID"],
_0x3ff0f0
);
if (_0x5297fb) {
await Levels[_0x25035e(0x1c9)](
_0x469174[_0x25035e(0x1eb)],
_0x469174[_0x25035e(0x1dd)],
_0x4a66f7[_0x25035e(0x1bf)] + 0x1
);
let _0x4d3a17 = _0x4a66f7[_0x25035e(0x1bf)];
var _0x244ac6 = _0x25035e(0x1ed);
if (_0x4d3a17 <= 0x2) var _0x244ac6 = "Elite\x20III";
else {
if (_0x4d3a17 <= 0x4) var _0x244ac6 = _0x25035e(0x1db);
else {
if (_0x4d3a17 <= 0x6) var _0x244ac6 = _0x25035e(0x1f4);
else {
if (_0x4d3a17 <= 0x8) var _0x244ac6 = _0x25035e(0x1f0);
else {
if (_0x4d3a17 <= 0xa) var _0x244ac6 = _0x25035e(0x1fa);
else {
if (_0x4d3a17 <= 0xc) var _0x244ac6 = _0x25035e(0x1e5);
else {
if (_0x4d3a17 <= 0xe) var _0x244ac6 = _0x25035e(0x1bc);
else {
if (_0x4d3a17 <= 0x10) var _0x244ac6 = _0x25035e(0x207);
else {
if (_0x4d3a17 <= 0x12) var _0x244ac6 = _0x25035e(0x1ee);
else {
if (_0x4d3a17 <= 0x14)
var _0x244ac6 = "Grandmaster\x20III";
else {
if (_0x4d3a17 <= 0x16)
var _0x244ac6 = _0x25035e(0x205);
else {
if (_0x4d3a17 <= 0x18)
var _0x244ac6 = _0x25035e(0x1cf);
else {
if (_0x4d3a17 <= 0x1a)
var _0x244ac6 = _0x25035e(0x1b3);
else {
if (_0x4d3a17 <= 0x1c)
var _0x244ac6 = "Epic\x20IV";
else {
if (_0x4d3a17 <= 0x1e)
var _0x244ac6 = _0x25035e(0x1af);
else {
if (_0x4d3a17 <= 0x20)
var _0x244ac6 = "Epic\x20II";
else {
if (_0x4d3a17 <= 0x22)
var _0x244ac6 = "Epic\x20I";
else {
if (_0x4d3a17 <= 0x24)
var _0x244ac6 = _0x25035e(0x204);
else {
if (_0x4d3a17 <= 0x26)
var _0x244ac6 = _0x25035e(0x1dc);
else {
if (_0x4d3a17 <= 0x28)
    var _0x244ac6 = _0x25035e(0x1e9);
else {
    if (_0x4d3a17 <= 0x2a)
    var _0x244ac6 =
        _0x25035e(0x1e2);
    else {
    if (_0x4d3a17 <= 0x2c)
        var _0x244ac6 =
        _0x25035e(0x1b5);
    else {
        if (_0x4d3a17 <= 0x2e)
        var _0x244ac6 = "Mythic";
        else {
        if (_0x4d3a17 <= 0x32)
            var _0x244ac6 =
            _0x25035e(0x1b0);
        }
    }
    }
}
}
}
}
}
}
}
}
}
}
}
}
}
}
}
}
}
}
}
}
("|⬡════════════════════════════════════════════════════════════|▷\x20\x20\x20ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ\x20ʙʏ\x20ᴋʀᴀᴋɪɴᴢʟᴀʙ™\x20\x20◁|════════════════════════════════════════════════════════════⬡|");
let _0x19bfc0 =
_0x25035e(0x1c0) +
Date[_0x25035e(0x1d6)]() +
"r" +
_0x469174[_0x25035e(0x1bd)]["id"] +
_0x25035e(0x1e0),
_0xd1c1a5 = Math[_0x25035e(0x1ea)](
0x3e8 + Math[_0x25035e(0x1f1)]() * 0x2328
),
_0x11cf06;
try {
_0x11cf06 = await _0x2228e5[_0x25035e(0x1c6)](
_0x469174[_0x25035e(0x1dd)],
_0x25035e(0x1e8)
);
} catch {
_0x11cf06 = _0x25035e(0x1fd);
}
("|⬡════════════════════════════════════════════════════════════|▷\x20\x20\x20ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ\x20ʙʏ\x20ᴋʀᴀᴋɪɴᴢʟᴀʙ™\x20\x20◁|════════════════════════════════════════════════════════════⬡|");
try {
let _0x3781e5 = await fetch(
global[_0x25035e(0x200)](_0x25035e(0x1f8), _0x25035e(0x206), {
auth: "3e7756c85df54b78f934a284c11abe4e",
method: _0x25035e(0x1ef),
term: "anime\x20landscape",
})
),
_0x27021d = await _0x3781e5[_0x25035e(0x1c5)](),
_0x3ec314 =
_0x27021d[_0x25035e(0x1ca)][
Math[_0x25035e(0x1ea)](
Math[_0x25035e(0x1f1)]() * _0x27021d[_0x25035e(0x1ca)]["length"]
)
];
Img = _0x3ec314["url_image"];
} catch {
Img = _0x25035e(0x1f5);
}
_0x25035e(0x1e1);
let _0x3189bd = new canvacord[_0x25035e(0x1f2)]()
[_0x25035e(0x1ce)](_0x11cf06)
[_0x25035e(0x1da)](_0x4a66f7["xp"])
[_0x25035e(0x1b8)](
Levels[_0x25035e(0x1b2)](_0x4a66f7[_0x25035e(0x1bf)] + 0x1)
)
[_0x25035e(0x1d2)](_0x4a66f7[_0x25035e(0x1df)])
[_0x25035e(0x1c9)](_0x4a66f7[_0x25035e(0x1bf)])
[_0x25035e(0x1c4)]("online")
[_0x25035e(0x1fb)](_0x25035e(0x1ec), Img)
[_0x25035e(0x202)](color, _0x25035e(0x1e6))
[_0x25035e(0x1d5)](_0x25035e(0x209))
[_0x25035e(0x1b1)](_0xd1c1a5);
return await _0x3189bd["build"]()[_0x25035e(0x1be)](async (_0x26d692) => {
var _0x41ec91 = _0x25035e;
fs[_0x41ec91(0x1b7)](_0x19bfc0, _0x26d692, async (_0x1ca5f4) => {
var _0x2a6ad8 = _0x41ec91;
if (_0x1ca5f4) return _0x5c55b1(_0x2228e5, _0x469174, _0x1ca5f4);
return (
await _0x2228e5[_0x2a6ad8(0x1b9)](
_0x469174[_0x2a6ad8(0x1dd)],
{
contextInfo: { mentionedJid: [_0x469174[_0x2a6ad8(0x1eb)]] },
image: { url: _0x19bfc0 },
caption:
"╔══『\x20𝐏𝐫𝐨𝐟𝐢𝐥𝐞𝐫®\x20』\x0a║\x20*❣️\x20ɴᴀᴍᴇ:*\x20" +
(_0x469174[_0x2a6ad8(0x1cc)] || "No_Name") +
_0x2a6ad8(0x1c8) +
_0x469174["chatID"][_0x2a6ad8(0x1e3)]("@")[0x0] +
_0x2a6ad8(0x1b6) +
_0x4a66f7["xp"] +
_0x2a6ad8(0x1f6) +
Levels[_0x2a6ad8(0x1b2)](_0x4a66f7["level"] + 0x1) +
_0x2a6ad8(0x1fe) +
_0x4a66f7[_0x2a6ad8(0x1bf)] +
_0x2a6ad8(0x203) +
_0x244ac6 +
"*",
footer: "*⦓\x20ⒸѶ𝖆𝖑𝐤𝐲𝖗𝖎𝖊\x20⦔*\x0a_ʍǟɖɛ\x20ɮʏ\x20ӄʀǟӄɨռʐʟǟɮ™_",
buttons: [
{
buttonId: prefix + _0x2a6ad8(0x1d8),
buttonText: { displayText: prefix + _0x2a6ad8(0x1d8) },
type: 0x1,
},
],
headerType: 0x4,
},
{ quoted: _0x469174 }
)[_0x2a6ad8(0x1d0)]((_0x17933a) =>
_0x5c55b1(_0x2228e5, _0x469174, _0x17933a)
),
fs["unlinkSync"](_0x19bfc0)
);
});
});
}
});
`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
