`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
var _0x3bbd38 = _0x50e8;
function _0x330a() {
var _0x46b1b8 = [
"sendMessage",
"\x0a║\x20*⚡\x20ɪᴅ:*\x20",
"\x0a╚═══════╝\x0a\x0a\x0a*❌ERROR:*\x20This\x20Command\x20is\x20restricted\x20to\x20admin\x20only!",
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Red.png",
"sender",
"pushName",
"support",
"264660HSgpDL",
"2952LaGyva",
"13557RjmrkV",
"1909170YUPmAa",
"20CJcpiQ",
"911871gneTws",
"chatID",
"╔══『\x20𝐏𝐫𝐨𝐟𝐢𝐥𝐞𝐫®\x20』\x0a║\x20*❣️\x20ɴᴀᴍᴇ:*\x20",
"split",
"../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/𝕷𝖆ყO𝖚𝖙",
"16009ChCAbI",
"1848860bDdCWu",
"Sender_Not_Admin",
"34LGNZXH",
"3521TiPHDy",
];
_0x330a = function () {
return _0x46b1b8;
};
return _0x330a();
}
function _0x50e8(_0x10a492, _0x3158e8) {
var _0x330a74 = _0x330a();
return (
(_0x50e8 = function (_0x50e8ec, _0x151189) {
_0x50e8ec = _0x50e8ec - 0x14d;
var _0xd81e8 = _0x330a74[_0x50e8ec];
return _0xd81e8;
}),
_0x50e8(_0x10a492, _0x3158e8)
);
}
(function (_0x339ff1, _0x5b0630) {
var _0x47b61b = _0x50e8,
_0x3c5d63 = _0x339ff1();
while (!![]) {
try {
var _0x1cf862 =
parseInt(_0x47b61b(0x150)) / 0x1 +
(-parseInt(_0x47b61b(0x153)) / 0x2) *
(parseInt(_0x47b61b(0x15e)) / 0x3) +
-parseInt(_0x47b61b(0x15c)) / 0x4 +
parseInt(_0x47b61b(0x151)) / 0x5 +
-parseInt(_0x47b61b(0x15f)) / 0x6 +
(parseInt(_0x47b61b(0x154)) / 0x7) *
(parseInt(_0x47b61b(0x15d)) / 0x8) +
(parseInt(_0x47b61b(0x161)) / 0x9) * (parseInt(_0x47b61b(0x160)) / 0xa);
if (_0x1cf862 === _0x5b0630) break;
else _0x3c5d63["push"](_0x3c5d63["shift"]());
} catch (_0x3d6c91) {
_0x3c5d63["push"](_0x3c5d63["shift"]());
}
}
})(_0x330a, 0x4c60b),
require(_0x3bbd38(0x14f)),
(exports[_0x3bbd38(0x152)] = async (_0x5e5a0a, _0x283ee8) => {
var _0x2545d5 = _0x3bbd38;
await _0x5e5a0a[_0x2545d5(0x155)](
_0x283ee8[_0x2545d5(0x162)],
{
contextInfo: { mentionedJid: [_0x283ee8[_0x2545d5(0x159)]] },
image: { url: _0x2545d5(0x158) },
caption:
_0x2545d5(0x14d) +
(_0x283ee8[_0x2545d5(0x15a)] || "No_Name") +
_0x2545d5(0x156) +
_0x283ee8[_0x2545d5(0x162)][_0x2545d5(0x14e)]("@")[0x0] +
_0x2545d5(0x157),
footer: "*⦓\x20ⒸѶ𝖆𝖑𝐤𝐲𝖗𝖎𝖊\x20⦔*",
buttons: [
{
buttonId: prefix + "help",
buttonText: { displayText: prefix + "help" },
type: 0x1,
},
{
buttonId: prefix + "support",
buttonText: { displayText: prefix + _0x2545d5(0x15b) },
type: 0x1,
},
],
headerType: 0x4,
},
{ quoted: _0x283ee8 }
);
});
`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
