`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
`|🍹|      (𝐜)𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭 | 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!       |`;
`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
`|🍹|`;
`|🍹|`;
const Sakura_Buttons = require(`../../Sakura🛰️Server/Sakura_Buttons`);
const Sakura_Static = require(`../../Sakura🛰️Server/Sakura_Static`);
const { MessageType, Mimetype } = require(`@adiwajshing/baileys`);
const cleanRF = require(`../../Sakura🛰️Server/cleanRF`);
const ꜰᴜᴄᴋ = require(`../../Sakura🛰️Server/oShit`);
const speed = require(`performance-now`);
const _𝔏𝔞𝔟_ = require(`../../Sakura🛰️Server/_𝔏𝔞𝔟_`);
var ᴋᴇɪᴇx = new RegExp(_𝔏𝔞𝔟_.FOXTROT, `g`);
var ᴋᴇɪ = /\/\^\[(.*)+\]\/\g/g.exec(ᴋᴇɪᴇx)[1];
const fs = require(`fs`);
var path = require(`path`);
var scriptName = path.basename(__filename);
var newScpt = scriptName.slice(0, -3).toLowerCase();
//|🍹  ⬡===========================================|  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™  |===========================================⬡  🍹|
module.exports = {
name: newScpt,
async handle(ӄʀǟӄɨռʐ, chat, ֆǟӄʊʀǟ, Needs, ꜱɪᴛʀᴀᴘ, Clock, Ping, Timers) {
try {
var ꜱᴇɴᴅᴇʀɪᴅ = ֆǟӄʊʀǟ.sender;
var ꜱᴇɴᴅᴇʀeceived = ꜱᴇɴᴅᴇʀɪᴅ.substring(0, ꜱᴇɴᴅᴇʀɪᴅ.length - 15);
const defaultnm = ֆǟӄʊʀǟ.commandName;
const FinalName = defaultnm.charAt(0).toUpperCase() + defaultnm.slice(1);
//|🍹  ⬡===========================================|  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™  |===========================================⬡  🍹|
const hold = require("../../Sakura🛰️Server/Hold");
hold.Hold(ֆǟӄʊʀǟ);
//|🍹  ⬡===========================================|  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™  |===========================================⬡  🍹|
var MediaUrl = `./Sakura☣️Reactor/ֆǟӄʊʀǟ.png`;
var MainText = `✋🏽‍𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 •@${ꜱᴇɴᴅᴇʀeceived}, ${Timers}

╔═════════════🍣 𝐀𝐧𝐢𝐦𝐞
║• ${ᴋᴇɪ}anime _search any anime_
║• ${ᴋᴇɪ}ranimewall _get random anime wallpaper_
║• ${ᴋᴇɪ}smile _(ɢɪꜰ)_ 
║• ${ᴋᴇɪ}yes _(ɢɪꜰ)_
║• ${ᴋᴇɪ}bite _(ɢɪꜰ)_
║• ${ᴋᴇɪ}blush _(ɢɪꜰ)_
║• ${ᴋᴇɪ}bored _(ɢɪꜰ)_
║• ${ᴋᴇɪ}confused _(ɢɪꜰ)_
║• ${ᴋᴇɪ}cry _(ɢɪꜰ)_
║• ${ᴋᴇɪ}goodnight _(ɢɪꜰ)_
║• ${ᴋᴇɪ}happy _(ɢɪꜰ)_
║• ${ᴋᴇɪ}hi5 _(ɢɪꜰ)_
║• ${ᴋᴇɪ}poke _(ɢɪꜰ)_
║• ${ᴋᴇɪ}sad _(ɢɪꜰ)_
║• ${ᴋᴇɪ}thinking _(ɢɪꜰ)_
║• ${ᴋᴇɪ}cuddle _(ɢɪꜰ)_
║• ${ᴋᴇɪ}hug _(ɢɪꜰ)_
║• ${ᴋᴇɪ}pat _(ɢɪꜰ)_
║• ${ᴋᴇɪ}slap _(ɢɪꜰ)_ 
║• ${ᴋᴇɪ}wink _(ɢɪꜰ)_
║• ${ᴋᴇɪ}angry _(ɢɪꜰ)_
║• ${ᴋᴇɪ}baka _(ɢɪꜰ)_
║• ${ᴋᴇɪ}bonk _(ɢɪꜰ)_
║• ${ᴋᴇɪ}bully _(ɢɪꜰ)_
║• ${ᴋᴇɪ}bye _(ɢɪꜰ)_
║• ${ᴋᴇɪ}chase _(ɢɪꜰ)_
║• ${ᴋᴇɪ}cheer _(ɢɪꜰ)_
║• ${ᴋᴇɪ}cringe _(ɢɪꜰ)_
║• ${ᴋᴇɪ}dab _(ɢɪꜰ)_
║• ${ᴋᴇɪ}dance _(ɢɪꜰ)_
║• ${ᴋᴇɪ}die _(ɢɪꜰ)_
║• ${ᴋᴇɪ}facepalm _(ɢɪꜰ)_
║• ${ᴋᴇɪ}feed _(ɢɪꜰ)_
║• ${ᴋᴇɪ}glomp _(ɢɪꜰ)_
║• ${ᴋᴇɪ}hold _(ɢɪꜰ)_
║• ${ᴋᴇɪ}hate _(ɢɪꜰ)_
║• ${ᴋᴇɪ}hi _(ɢɪꜰ)_
║• ${ᴋᴇɪ}kill _(ɢɪꜰ)_
║• ${ᴋᴇɪ}laugh _(ɢɪꜰ)_
║• ${ᴋᴇɪ}lick _(ɢɪꜰ)_
║• ${ᴋᴇɪ}love _(ɢɪꜰ)_
║• ${ᴋᴇɪ}lurk _(ɢɪꜰ)_
║• ${ᴋᴇɪ}nervous _(ɢɪꜰ)_
║• ${ᴋᴇɪ}nope _(ɢɪꜰ)_
║• ${ᴋᴇɪ}nom _(ɢɪꜰ)_
║• ${ᴋᴇɪ}nuzzle _(ɢɪꜰ)_
║• ${ᴋᴇɪ}panic _(ɢɪꜰ)_
║• ${ᴋᴇɪ}peck _(ɢɪꜰ)_
║• ${ᴋᴇɪ}poke _(ɢɪꜰ)_
║• ${ᴋᴇɪ}pout _(ɢɪꜰ)_
║• ${ᴋᴇɪ}run _(ɢɪꜰ)_
║• ${ᴋᴇɪ}sip _(ɢɪꜰ)_
║• ${ᴋᴇɪ}shoot _(ɢɪꜰ)_
║• ${ᴋᴇɪ}shrug _(ɢɪꜰ)_
║• ${ᴋᴇɪ}sleep _(ɢɪꜰ)_
║• ${ᴋᴇɪ}smug _(ɢɪꜰ)_
║• ${ᴋᴇɪ}stab _(ɢɪꜰ)_
║• ${ᴋᴇɪ}stare _(ɢɪꜰ)_
║• ${ᴋᴇɪ}tease _(ɢɪꜰ)_
║• ${ᴋᴇɪ}tickle _(ɢɪꜰ)_
║• ${ᴋᴇɪ}thumbsup _(ɢɪꜰ)_
║• ${ᴋᴇɪ}triggered _(ɢɪꜰ)_
║• ${ᴋᴇɪ}wag _(ɢɪꜰ)_
╚════════════╝`;
return Sakura_Buttons.MIB(
ӄʀǟӄɨռʐ,
chat,
ֆǟӄʊʀǟ,
MainText,
MediaUrl
).catch((ℓαвєяяσя) => ꜰᴜᴄᴋ.catch(ℓαвєяяσя, ӄʀǟӄɨռʐ, ֆǟӄʊʀǟ, chat));
//|🍹  ⬡===========================================|  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™  |===========================================⬡  🍹|
} catch (ℓαвєяяσя) {
ꜰᴜᴄᴋ.catch(ℓαвєяяσя, ӄʀǟӄɨռʐ, ֆǟӄʊʀǟ, chat);
return;
}
},
};
`|🍹|`;
`|🍹|`;
`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
`|🍹|      (𝐜)𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭 | 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!       |`;
`|🍹|======================================================================================================⬡  𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛™`;
