// "🐙============================================================================================================================<⚡>";
// "⚡𝐗𝐞𝐓𝐫𝐨𝐧⚡ 𝐢𝐬 𝐚 𝐃𝐢𝐬𝐜𝐨𝐫𝐝 𝐒𝐞𝐫𝐯𝐞𝐫 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞𝐁𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!";
// "🐙============================================================================================================================<⚡>";
// "🐙";
// "🐙";
// module.exports = {
//   getMember: function (message, ӄʀǟӄɨռʐ, ֆǟӄʊʀǟ, toFind = "") {
//     toFind = toFind.toLowerCase();
//     let target = ֆǟӄʊʀǟ.sender;
//     if (!target) target = ֆǟӄʊʀǟ.sender;
//     if (!target && toFind) {
//       target = ֆǟӄʊʀǟ.sender;
//     }
//     if (!target) target = ֆǟӄʊʀǟ.sender;
//     return target;
//   },
//   formatDate: function (date) {
//     return new Intl.DateTimeFormat("en-US").format(date);
//   },
// };
// ("🐙");
// ("🐙");
// ("🐙============================================================================================================================<⚡>");
// ("⚡𝐗𝐞𝐓𝐫𝐨𝐧⚡ 𝐢𝐬 𝐚 𝐃𝐢𝐬𝐜𝐨𝐫𝐝 𝐒𝐞𝐫𝐯𝐞𝐫 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞𝐁𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!");
// ("🐙============================================================================================================================<⚡>");
