`|⬡===========================================|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |===========================================⬡|`;
const Need = "silver";
var Item;
if (Need === "basic" || Need === "Basic") {
  Item = "🧵ʙᴀꜱɪᴄ-10ᴄᴏᴍᴍᴀɴᴅꜱ";
} else if (Need === "bronze" || Need === "Bronze") {
  Item = "🥉ʙʀᴏɴᴢᴇ-20ᴄᴏᴍᴍᴀɴᴅꜱ";
} else if (Need === "silver" || Need === "Silver") {
  Item = "🥈ꜱɪʟᴠᴇʀ-40ᴄᴏᴍᴍᴀɴᴅꜱ";
} else if (Need === "gold" || Need === "Gold") {
  Item = "🥇ɢᴏʟᴅ-60ᴄᴏᴍᴍᴀɴᴅꜱ";
} else if (Need === "platinum" || Need === "Platinum") {
  Item = "💍ᴘʟᴀᴛɪɴᴜᴍ-80ᴄᴏᴍᴍᴀɴᴅꜱ";
} else if (Need === "diamond" || Need === "Diamond") {
  Item = "💎ᴅɪᴀᴍᴏɴᴅ-100ᴄᴏᴍᴍᴀɴᴅꜱ";
} else {
  Item = "🧵ʙᴀꜱɪᴄ-10ᴄᴏᴍᴍᴀɴᴅꜱ";
}
console.log(Item);
return;
`|⬡===========================================|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |===========================================⬡|`;
