`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
var _0x2e738c = _0x54f0;
(function (_0x554bc9, _0x2df25f) {
var _0x1d58c6 = _0x54f0,
_0x2a2a41 = _0x554bc9();
while (!![]) {
try {
var _0x403106 =
(-parseInt(_0x1d58c6(0xa3)) / 0x1) * (parseInt(_0x1d58c6(0xaa)) / 0x2) +
parseInt(_0x1d58c6(0xa0)) / 0x3 +
(parseInt(_0x1d58c6(0xaf)) / 0x4) * (-parseInt(_0x1d58c6(0xbb)) / 0x5) +
parseInt(_0x1d58c6(0xa5)) / 0x6 +
-parseInt(_0x1d58c6(0xb7)) / 0x7 +
(-parseInt(_0x1d58c6(0xb5)) / 0x8) * (parseInt(_0x1d58c6(0xad)) / 0x9) +
(parseInt(_0x1d58c6(0xb8)) / 0xa) * (parseInt(_0x1d58c6(0xb1)) / 0xb);
if (_0x403106 === _0x2df25f) break;
else _0x2a2a41["push"](_0x2a2a41["shift"]());
} catch (_0x3e3a98) {
_0x2a2a41["push"](_0x2a2a41["shift"]());
}
}
})(_0x1028, 0x82f92),
require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/𝕷𝖆ყO𝖚𝖙");
function _0x54f0(_0x488712, _0x491033) {
var _0x1028da = _0x1028();
return (
(_0x54f0 = function (_0x54f098, _0x1d3e4e) {
_0x54f098 = _0x54f098 - 0x9f;
var _0x4384ff = _0x1028da[_0x54f098];
return _0x4384ff;
}),
_0x54f0(_0x488712, _0x491033)
);
}
let fs = require("fs"),
chalk = require(_0x2e738c(0xb2));
(exports[_0x2e738c(0xb3)] = async (
_0xa12056,
_0x33633e,
_0x33b7db,
_0x46f5be
) => {
var _0x4ec456 = _0x2e738c;
return await _0xa12056["sendMessage"](
_0x33633e[_0x4ec456(0xa6)],
{
contextInfo: { mentionedJid: [_0x33633e[_0x4ec456(0xab)]] },
image: { url: "./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.png" },
caption:
"╔══『\x20𝐏𝐫𝐨𝐟𝐢𝐥𝐞𝐫®\x20』\x0a║\x20*❣️\x20ɴᴀᴍᴇ:*\x20" +
(_0x33633e[_0x4ec456(0xa2)] || _0x4ec456(0xbc)) +
_0x4ec456(0xb6) +
_0x33633e[_0x4ec456(0xa6)]["split"]("@")[0x0] +
_0x4ec456(0xa7),
footer: _0x4ec456(0xa1),
buttons: [
{
buttonId: prefix + _0x4ec456(0xba),
buttonText: { displayText: prefix + "help" },
type: 0x1,
},
{
buttonId: prefix + "support",
buttonText: { displayText: prefix + "support" },
type: 0x1,
},
],
headerType: 0x4,
},
{ quoted: _0x33633e }
);
}),
_0x2e738c(0xac);
function _0x1028() {
var _0xa6a9ee = [
"unwatchFile",
"help",
"5HqvIpw",
"No_Name",
"yellowBright",
"2721585tRESHI",
"*⦓\x20ⒸѶ𝖆𝖑𝐤𝐲𝖗𝖎𝖊\x20⦔*\x0aᴘᴏᴡᴇʀᴇᴅ\x20ʙʏ\x20ᴋʀᴀᴋɪɴᴢʟᴀʙ",
"pushName",
"13uXGhGZ",
"resolve",
"5168490PooDCE",
"chatID",
"\x0a╚═══════╝\x0a\x0a\x0a╔◇══════════════◇╗\x0a┊\x20🦊𝐕𝐞𝐫𝐢𝐟𝐢𝐜𝐚𝐭𝐢𝐨𝐧🦊\x0a╚◇══════════════◇╝\x0a\x0a𝐉𝐨𝐢𝐧\x20𝐓𝐨\x20𝐁𝐞\x20𝐕𝐞𝐫𝐢𝐟𝐢𝐞𝐝:\x0a*𝗚roup⛩️1:*\x20chat.whatsapp.com/Gn50KMVAJKZHYJeaGhs3UV\x0a*𝗚roup⛩️2:*\x20chat.whatsapp.com/BF6J4MiaduL7ZRgt2Tqzk8\x0a*𝗚roup⛩️3:*\x20chat.whatsapp.com/Hx5VAZMfthg5okQwerohXM\x0a*𝗚roup⛩️4:*\x20chat.whatsapp.com/EwPq86c1N5L4iZKxpHL6WP\x0a*𝗚roup⛩️5:*\x20chat.whatsapp.com/CcRTdjc2SHS0XlMP0Bvi2q",
"path",
"watchFile",
"95318rpxGfQ",
"sender",
"|⬡════════════════════════════════════════════════════════════|▷\x20\x20\x20ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ\x20ʙʏ\x20ᴋʀᴀᴋɪɴᴢʟᴀʙ™\x20\x20◁|════════════════════════════════════════════════════════════⬡|",
"9fUvQDG",
"File\x20Auto\x20Updated:\x20",
"1096052GnTDPQ",
"log",
"11ZBrBRy",
"chalk",
"port_A",
"💡𝐈𝐧𝐟𝐨꧂\x20",
"1665392SxTdUa",
"\x0a║\x20*⚡\x20ɪᴅ:*\x20",
"3048311aUpVoh",
"3050830EKIuXG",
];
_0x1028 = function () {
return _0xa6a9ee;
};
return _0x1028();
}
var Present_Path = require(_0x2e738c(0xa8)),
Present_File = require[_0x2e738c(0xa4)](__filename),
Present_Name = Present_Path["basename"](__filename);
fs[_0x2e738c(0xa9)](Present_File, () => {
var _0x5db3a2 = _0x2e738c;
fs[_0x5db3a2(0xb9)](Present_File),
console[_0x5db3a2(0xb0)](
chalk[_0x5db3a2(0x9f)](_0x5db3a2(0xb4)),
chalk["greenBright"](_0x5db3a2(0xae) + Present_Name)
),
delete require["cache"][Present_File],
require(Present_File);
});
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
* * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
*/
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
