("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
* * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
*/
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
function _0x3355(_0x50c1b4, _0x24b372) {
const _0xb14f55 = _0xb14f();
return (
(_0x3355 = function (_0x335545, _0x382294) {
_0x335545 = _0x335545 - 0xd5;
let _0x546011 = _0xb14f55[_0x335545];
return _0x546011;
}),
_0x3355(_0x50c1b4, _0x24b372)
);
}
function _0xb14f() {
const _0xeabfb1 = [
"8sIJGke",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/𝕷𝖆ყO𝖚𝖙",
"path",
"271010NQpvil",
"moment-timezone",
"chalk",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Image_Button",
"663176pltJTL",
"2724915cKdQrc",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/N𝖊𝖊𝖉__A𝖗𝖌𝖘",
"|⬡════════════════════════════════════════════════════════════════════「\x20\x20𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞\x20𝐀𝐩𝐢®\x20\x20」═══════════════════════════════════════════════════════════════════⬡|",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Group_Only",
"711AnPgzM",
"canvacord",
"2150165AhxjdS",
"hxz-api",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧥H𝖔𝖑𝖘𝖙𝖊𝖗/letiableServers",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/y2mate",
"4858254cFyWxA",
"wa-sticker-formatter",
"util",
"196dsNDoY",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Video_Button",
"mailist",
"yt-search",
"222224bwjasu",
"545587XmbOQc",
"quick.db",
"tinyurl-api",
"toLowerCase",
];
_0xb14f = function () {
return _0xeabfb1;
};
return _0xb14f();
}
const _0xe4e797 = _0x3355;
(function (_0x54683e, _0x555914) {
const _0x5a41c7 = _0x3355,
_0x5f1cfe = _0x54683e();
while (!![]) {
try {
const _0x38944c =
parseInt(_0x5a41c7(0xe6)) / 0x1 +
-parseInt(_0x5a41c7(0xf1)) / 0x2 +
-parseInt(_0x5a41c7(0xf2)) / 0x3 +
(-parseInt(_0x5a41c7(0xea)) / 0x4) * (parseInt(_0x5a41c7(0xda)) / 0x5) +
-parseInt(_0x5a41c7(0xde)) / 0x6 +
(parseInt(_0x5a41c7(0xe1)) / 0x7) * (parseInt(_0x5a41c7(0xe5)) / 0x8) +
(parseInt(_0x5a41c7(0xd8)) / 0x9) * (parseInt(_0x5a41c7(0xed)) / 0xa);
if (_0x38944c === _0x555914) break;
else _0x5f1cfe["push"](_0x5f1cfe["shift"]());
} catch (_0x27180e) {
_0x5f1cfe["push"](_0x5f1cfe["shift"]());
}
}
})(_0xb14f, 0x876ba),
require(_0xe4e797(0xeb));
let {
isUrl,
fetchJson,
getBuffer,
jsonformat,
GIFBufferToVideoBuffer,
getRandom,
} = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/ɴᴇᴄᴛᴏʀ"),
fs = require("fs"),
yts = require(_0xe4e797(0xe4)),
util = require(_0xe4e797(0xe0)),
hxz = require(_0xe4e797(0xdb)),
chalk = require(_0xe4e797(0xef)),
db = require(_0xe4e797(0xe7)),
axios = require("axios"),
Tinyurl = require(_0xe4e797(0xe8)),
canvacord = require(_0xe4e797(0xd9)),
{ Character } = require(_0xe4e797(0xe3)),
moment = require(_0xe4e797(0xee)),
Carbon = require("unofficial-carbon-now"),
{ exec, execSync } = require("child_process"),
{ yta } = require(_0xe4e797(0xdd)),
{ N𝖊𝖊𝖉__A𝖗𝖌𝖘 } = require(_0xe4e797(0xd5)),
{ yta_var } = require(_0xe4e797(0xdc)),
{ ytv_var } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧥H𝖔𝖑𝖘𝖙𝖊𝖗/letiableServers"),
{ Sticker, StickerTypes } = require(_0xe4e797(0xdf)),
{ Group_Only } = require(_0xe4e797(0xd7)),
{ Image_Button } = require(_0xe4e797(0xf0)),
{ Video_Button } = require(_0xe4e797(0xe2)),
{ Bot_Not_Admin } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Bot_Not_Admin"),
{ Sender_Not_Admin } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Sender_Not_Admin"),
YouTube_Regex =
/(?:http(?:s|):\/\/|)(?:(?:www\.|)youtube(?:\-nocookie|)\.com\/(?:watch\?.*(?:|\&)v=|embed\/|v\/)|youtu\.be\/)([-_0-9A-Za-z]{11})/,
Present_Path = require(_0xe4e797(0xec)),
Script_Name = Present_Path["basename"](__filename),
Final_Name = Script_Name["slice"](0x0, -0x3)[_0xe4e797(0xe9)](),
{ Caught } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Caught");
_0xe4e797(0xd6);
exports.radio = async (
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
pushName,
fromMe,
F𝖚𝖑𝖑_A𝖗𝖌𝖘,
quoted,
isMedia,
isGroup,
groupAdmins,
isBotAdmin,
isSenderAdmin,
isSenderTUF,
commandName,
body,
isReply,
mentionByTag,
mentionByReply
) => {
let 𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆 = Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata;
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
let { ᴋʀᴀᴋɪɴᴢʟᴀʙʀᴀᴅɪᴏ } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊📮W𝖆𝖗𝖉𝖗𝖔𝖇𝖊/ᴋʀᴀᴋɪɴᴢʟᴀʙ⭕ʀᴀᴅɪᴏ");
return await ᴋʀᴀᴋɪɴᴢʟᴀʙʀᴀᴅɪᴏ(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊);
};
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
* * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
*/
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
