("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
* * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
*/
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
const _0x72bcb2 = _0x356c;
function _0x89f4() {
const _0x15acd4 = [
"10jOUVJL",
"|⬡════════════════════════════════════════════════════════════════════「\x20\x20𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞\x20𝐀𝐩𝐢®\x20\x20」═══════════════════════════════════════════════════════════════════⬡|",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/ɴᴇᴄᴛᴏʀ",
"yt-search",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧥H𝖔𝖑𝖘𝖙𝖊𝖗/letiableServers",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Image_Button",
"axios",
"1564774CrzsaH",
"canvacord",
"quick.db",
"8qioLDB",
"moment-timezone",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Video_Button",
"toLowerCase",
"3tuvgLp",
"1862ergUMa",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/y2mate",
"wa-sticker-formatter",
"515245PKWlqw",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Sender_Not_Admin",
"3766851pCnhOC",
"mailist",
"unofficial-carbon-now",
"tinyurl-api",
"6967600GdXpTT",
"child_process",
"basename",
"path",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Group_Only",
"930UwhoFs",
"util",
"978487hfQucs",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/N𝖊𝖊𝖉__A𝖗𝖌𝖘",
"28890455rKKmBj",
];
_0x89f4 = function () {
return _0x15acd4;
};
return _0x89f4();
}
(function (_0x31bac5, _0xd402be) {
const _0xcbef0 = _0x356c,
_0x5cb9fc = _0x31bac5();
while (!![]) {
try {
const _0x273894 =
parseInt(_0xcbef0(0x1cd)) / 0x1 +
(-parseInt(_0xcbef0(0x1d7)) / 0x2) *
(-parseInt(_0xcbef0(0x1de)) / 0x3) +
(-parseInt(_0xcbef0(0x1da)) / 0x4) *
(-parseInt(_0xcbef0(0x1e2)) / 0x5) +
(parseInt(_0xcbef0(0x1cb)) / 0x6) * (-parseInt(_0xcbef0(0x1df)) / 0x7) +
parseInt(_0xcbef0(0x1e8)) / 0x8 +
(-parseInt(_0xcbef0(0x1e4)) / 0x9) *
(-parseInt(_0xcbef0(0x1d0)) / 0xa) +
-parseInt(_0xcbef0(0x1cf)) / 0xb;
if (_0x273894 === _0xd402be) break;
else _0x5cb9fc["push"](_0x5cb9fc["shift"]());
} catch (_0x3f060c) {
_0x5cb9fc["push"](_0x5cb9fc["shift"]());
}
}
})(_0x89f4, 0x8fc1a),
require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/𝕷𝖆ყO𝖚𝖙");
let {
isUrl,
fetchJson,
getBuffer,
jsonformat,
GIFBufferToVideoBuffer,
getRandom,
} = require(_0x72bcb2(0x1d2)),
fs = require("fs"),
yts = require(_0x72bcb2(0x1d3)),
util = require(_0x72bcb2(0x1cc)),
hxz = require("hxz-api"),
chalk = require("chalk"),
db = require(_0x72bcb2(0x1d9)),
axios = require(_0x72bcb2(0x1d6)),
Tinyurl = require(_0x72bcb2(0x1e7)),
canvacord = require(_0x72bcb2(0x1d8)),
{ Character } = require(_0x72bcb2(0x1e5)),
moment = require(_0x72bcb2(0x1db)),
Carbon = require(_0x72bcb2(0x1e6)),
{ exec, execSync } = require(_0x72bcb2(0x1e9)),
{ ytv } = require(_0x72bcb2(0x1e0)),
{ N𝖊𝖊𝖉__A𝖗𝖌𝖘 } = require(_0x72bcb2(0x1ce)),
{ yta_var } = require(_0x72bcb2(0x1d4)),
{ ytv_var } = require(_0x72bcb2(0x1d4)),
{ Sticker, StickerTypes } = require(_0x72bcb2(0x1e1)),
{ Group_Only } = require(_0x72bcb2(0x1ca)),
{ Image_Button } = require(_0x72bcb2(0x1d5)),
{ Video_Button } = require(_0x72bcb2(0x1dc)),
{ Bot_Not_Admin } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Bot_Not_Admin"),
{ Sender_Not_Admin } = require(_0x72bcb2(0x1e3)),
YouTube_Regex =
/(?:http(?:s|):\/\/|)(?:(?:www\.|)youtube(?:\-nocookie|)\.com\/(?:watch\?.*(?:|\&)v=|embed\/|v\/)|youtu\.be\/)([-_0-9A-Za-z]{11})/,
Present_Path = require(_0x72bcb2(0x1eb)),
Script_Name = Present_Path[_0x72bcb2(0x1ea)](__filename),
Final_Name = Script_Name["slice"](0x0, -0x3)[_0x72bcb2(0x1dd)](),
{ Caught } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Caught");
function _0x356c(_0x59d17d, _0x326049) {
const _0x89f468 = _0x89f4();
return (
(_0x356c = function (_0x356c20, _0x4528fa) {
_0x356c20 = _0x356c20 - 0x1ca;
let _0x25700b = _0x89f468[_0x356c20];
return _0x25700b;
}),
_0x356c(_0x59d17d, _0x326049)
);
}
_0x72bcb2(0x1d1);
exports.ytv = async (
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
pushName,
fromMe,
F𝖚𝖑𝖑_A𝖗𝖌𝖘,
quoted,
isMedia,
isGroup,
groupMetadata,
groupName,
participants,
groupAdmins,
isBotAdmin,
isSenderAdmin,
isSenderTUF,
commandName,
body,
isReply,
mentionByTag,
mentionByReply
) => {
  let 𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆 = Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata;
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
if (A𝖗𝖌𝖘.length === 0) {
return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
`*❌ERROR:* No query provided!

*⚡USAGE:* ${prefix}${Final_Name} <song name or youtube link>`
);
}
if (A𝖗𝖌𝖘.includes("yout")) {
if (!YouTube_Regex.test(A𝖗𝖌𝖘[0])) {
return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
`*❌ERROR:* No query provided!

*⚡USAGE:* ${prefix}${Final_Name} <song name or youtube link>`
);
}
}
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
let FinalGot;
if (YouTube_Regex.test(A𝖗𝖌𝖘[0])) {
FinalGot = A𝖗𝖌𝖘[0];
} else {
FinalGot = F𝖚𝖑𝖑_A𝖗𝖌𝖘;
}
let LinkFound = await yts(FinalGot);
if (!LinkFound) {
return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
`*❌ERROR:* No Music Found!

*⚡USAGE:* ${prefix}${Final_Name} <song name or youtube link>`
);
}
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
let TubeFile = LinkFound.videos.slice(0, 1);
TubeFile.forEach(async function (Found) {
if (Found.seconds > 1800) {
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
Found.thumbnail,
`❌𝗘𝗿𝗿𝗼𝗿: _Choose Smaller Audio less then 30mins!_

⭕️𝐘𝐨𝐮𝐓𝐮𝐛𝐞 𝐀𝐈: ${Found.title}
🍻𝐓𝐢𝐭𝐥𝐞: ${Found.title}
⏰𝐃𝐮𝐫𝐚𝐭𝐢𝐨𝐧: ${Found.timestamp}`
);
}
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
let { dl_link, thumb, title, filesize, filesizeF } = await ytv_var(
Found.url,
"id4"
);
let DirectFile;
try {
DirectFile = await Tinyurl(dl_link);
} catch (error) {
DirectFile = "Null";
}
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
return await Video_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
dl_link,
`𝐘𝐨𝐮𝐓𝐮𝐛𝐞📹𝐕𝐢𝐝𝐞𝐨
🍻𝐓𝐢𝐭𝐥𝐞: ${Found.title}
🙈𝐕𝐢𝐞𝐰𝐬: ${Found.views}
⏰𝐃𝐮𝐫𝐚𝐭𝐢𝐨𝐧: ${Found.timestamp}
✒️𝐀𝐮𝐭𝐡𝐨𝐫: ${Found.author.name}
🫖𝗙𝗶𝗹𝗲𝘀𝗶𝘇𝗲: ${filesizeF || "undefined"}
🌐𝗪𝗲𝗯 𝗗𝗟: ${DirectFile}
🔗𝐋𝐢𝐧𝐤: ${Found.url}
📜𝐃𝐞𝐬𝐜𝐫𝐢𝐩𝐭𝐢𝐨𝐧: ${Found.description}`
);
});
};
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
* * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
*/
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
