// ===============================================================================
// 🎮ᴍᴇᴇ6™ ᴀᴅᴠᴀɴᴄᴇᴅ ᴡʜᴀᴛꜱᴀᴘᴘ ᴜꜱᴇʀʙᴏᴛ ᴡɪᴛʜ 80+ ᴄᴏᴍᴍᴀɴᴅꜱ ꜰᴏʀ ʙᴏᴛʜ ᴘʀɪᴠᴀᴛᴇ ᴀɴᴅ ɢʀᴏᴜᴘ-ᴜꜱᴀɢᴇ
// ===============================================================================
const { MessageType, Mimetype } = require(`@adiwajshing/baileys`);
require("python-format-js");
exports.catch = async (error, υℓтяσηℓιєηт, ᴍᴇᴇ6) => {
  var str = ᴍᴇᴇ6.sender;
  var newString = str.substring(0, str.length - 15);
  //   await υℓтяσηℓιєηт.sendMessage(
  //     ᴍᴇᴇ6.logGroup,
  //     {
  //       url: "https://i.postimg.cc/mkdqGhr5/Mee6-Error.png",
  //     },
  //     MessageType.image,
  //     {
  //       mimetype: Mimetype.png,
  //       contextInfo: { mentionedJid: [ᴍᴇᴇ6.sender] },
  //       caption: `*⬡••••••••⬡    𝐌𝐞𝐞𝟔™    ⬡••••••••⬡*
  // 𝐈 𝐚𝐦 𝐌𝐫𝐌𝐞𝐞𝟔🛸𝐋𝐨𝐨𝐤 𝐀𝐭 𝐌𝐞! 𝗠𝗼𝘀𝘁 𝗔𝗱𝘃𝗮𝗻𝗰𝗲 𝗪𝗵𝗮𝘁𝘀𝗮𝗽𝗽 𝗕𝗼𝘁 ⧪

  // ⚠️𝗘𝗿𝗿𝗼𝗿: ➛ ${error}

  // *⬡••••••••⬡    𝐌𝐞𝐞𝟔™    ⬡••••••••⬡*
  // ⧪➛ 𝗝𝗼𝗶𝗻 𝗦𝘂𝗽𝗽𝗼𝗿𝘁 𝗚𝗿𝗼𝘂𝗽(🐞RΣPӨЯƬ)
  // 🔸ᴡʜᴀᴛꜱᴀᴘᴘ https://chat.whatsapp.com/FmMcEeSqZQw85qAkgUs3f5
  // 🔸ᴅɪꜱᴄᴏʀᴅ https://discord.gg/xcFN6NDHEV`,
  //     }
  //   );
  await υℓтяσηℓιєηт.sendMessage(
    ᴍᴇᴇ6.chatId,
    {
      url: "https://i.postimg.cc/mkdqGhr5/Mee6-Error.png",
    },
    MessageType.image,
    {
      mimetype: Mimetype.png,
      contextInfo: { mentionedJid: [ᴍᴇᴇ6.sender] },
      caption: `*⬡••••••••⬡    𝐌𝐞𝐞𝟔™    ⬡••••••••⬡*
𝐈 𝐚𝐦 𝐌𝐫𝐌𝐞𝐞𝟔🛸𝐋𝐨𝐨𝐤 𝐀𝐭 𝐌𝐞! 𝗠𝗼𝘀𝘁 𝗔𝗱𝘃𝗮𝗻𝗰𝗲 𝗪𝗵𝗮𝘁𝘀𝗮𝗽𝗽 𝗕𝗼𝘁 ⧪

*❗Dҽαɾ @${newString},*
⚠️𝗘𝗿𝗿𝗼𝗿: ➛ ${error}

*⬡••••••••⬡    𝐌𝐞𝐞𝟔™    ⬡••••••••⬡*
⧪➛ 𝗝𝗼𝗶𝗻 𝗦𝘂𝗽𝗽𝗼𝗿𝘁 𝗚𝗿𝗼𝘂𝗽(🐞RΣPӨЯƬ)
🔸ɢɪᴛʜᴜʙ: https://github.com/Krakinz/Mee6
🔸ᴅɪꜱᴄᴏʀᴅ: https://discord.gg/xcFN6NDHEV
🔸ᴡʜᴀᴛꜱᴀᴘᴘ: https://chat.whatsapp.com/FmMcEeSqZQw85qAkgUs3f5`,
    }
  );
};
// ===============================================================================
// 🎮ᴍᴇᴇ6™ ᴀᴅᴠᴀɴᴄᴇᴅ ᴡʜᴀᴛꜱᴀᴘᴘ ᴜꜱᴇʀʙᴏᴛ ᴡɪᴛʜ 80+ ᴄᴏᴍᴍᴀɴᴅꜱ ꜰᴏʀ ʙᴏᴛʜ ᴘʀɪᴠᴀᴛᴇ ᴀɴᴅ ɢʀᴏᴜᴘ-ᴜꜱᴀɢᴇ
// ===============================================================================
