` 
••» 𝐖𝐞𝐥𝐜𝐨𝐦𝐞 𝐓𝐨 *⚡𝐌𝐞𝐞𝟔™* 𝐓𝐞𝐚𝐦 «••
*𝘜𝘴𝘦 !help*


*📍𝗥𝘂𝗹𝗲𝘀*
ᴊᴜꜱᴛ ʙᴇ ᴘᴏʟɪᴛᴇ
ʙᴇ ᴘᴀᴛɪᴇɴᴛ

*🖥️𝗩𝗲𝗿𝘀𝗶𝗼𝗻*
ʙᴇᴛᴀ-7.ꜰʜᴛ (ᴠᴇʀꜱɪᴏɴ-4.7)


*❣️𝗜𝗺𝗽-𝗟𝗶𝗻𝗸𝘀*
𝘎𝘪𝘵𝘩𝘶𝘣 = https://github.com/Krakinz
𝘋𝘪𝘴𝘤𝘰𝘳𝘥 = https://discord.gg/xcFN6NDHEV


*🐙𝗟𝗶𝗰𝗲𝗻𝘀𝗲*
ʜᴀꜱ ʙᴇᴇɴ ʟɪᴄᴇɴꜱᴇᴅ ᴜɴᴅᴇʀ ᴀᴘᴀᴄʜᴇ ʟɪᴄᴇɴꜱᴇ
𝐂𝐨𝐩𝐲𝐫𝐢𝐠𝐡𝐭 (𝐂) 𝟐𝟎𝟐𝟏 𝗞𝗿𝗮𝗸𝗶𝗻𝘇𝗟𝗮𝗯`;

`
••» 𝐖𝐞𝐥𝐜𝐨𝐦𝐞 𝐓𝐨 *⚡𝐌𝐞𝐞𝟔™* 𝐓𝐞𝐚𝐦 «••

ʜᴇʏ ᴛʜᴇʀᴇ ꜱɪʀ
ɪꜰ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ɢᴇᴛ ʏᴏᴜʀ ᴏᴡɴ ᴍᴇᴇ6 ᴀᴅᴠᴀɴᴄᴇᴅ ᴡʜᴀᴛꜱᴀᴘᴘ ᴜꜱᴇʀʙᴏᴛ ᴡɪᴛʜ 80+ ᴄᴏᴍᴍᴀɴᴅꜱ ꜰᴏʀ ʙᴏᴛʜ ᴘʀɪᴠᴀᴛᴇ ᴀɴᴅ ɢʀᴏᴜᴘ-ᴜꜱᴀɢᴇ

ᴘʟᴇᴀꜱᴇ ᴍᴀᴋᴇ ꜱᴜʀᴇ ʏᴏᴜ ᴀʀᴇ ᴀ ᴘᴀʀᴛ ᴏꜰ ᴏᴜʀ ʙᴇᴛᴀ-ɢʀᴏᴜᴘ!
`;
