[
  "eat 2 tablespoons of rice without any side dishes, if it's dragging you can drink",
  "spill people who make you pause",
  "call crush/pickle now and send ss",
  "drop only emote every time you type on gc/pc for 1 day.",
  "say Welcome to Who Wants To Be a Millionaire! to all the groups you have",
  "call ex saying miss",
  "sing the chorus of the last song you played",
  "vn your ex/crush/girlfriend, says hi (name), wants to call, just a moment. I miss🥺👉🏼👈🏼",
  "Bang on the table (which is at home) until you get scolded for being noisy",
  "Tell random people _I was just told I was your twin first, we separated, then I had plastic surgery. And this is the most ciyusss_ thing",
  "mention ex's name",
  "make 1 rhyme for the members!",
  "send ur Voxapp chat list",
  "chat random people with gheto language then ss here",
  "tell your own version of embarrassing things",
  "tag the person you hate",
  "Pretending to be possessed, for example: possessed by dog, possessed by grasshoppers, possessed by refrigerator, etc.",
  "change name to *I AM DONKEY* for 24 hours",
  "shout *ma chuda ma chuda ma chuda* in front of your house",
  "snap/post boyfriend photo/crush",
  "tell me your boyfriend type!",
  "say *i hv crush on you, do you want to be my girlfriend?* to the opposite sex, the last time you chatted (submit on wa/tele), wait for him to reply, if you have, drop here",
  "record ur voice that read *titar ke age do titar, titar ke piche do titar*",
  "prank chat ex and say *i love u, please come back.* without saying dare!",
  "chat to contact wa in the order according to your battery %, then tell him *i am lucky to hv you!*",
  "change the name to *I am a child of randi* for 5 hours",
  "type in bengali 24 hours",
  "Use selmon bhoi photo for 3 days",
  "drop a song quote then tag a suitable member for that quote",
  "send voice note saying can i call u baby?",
  "ss recent call Voxapp",
  "Say *YOU ARE SO BEAUTIFUL DON'T LIE* to guys!",
  "pop to a group member, and say fuck you",
  "Act like a chicken in front of ur parents",
  "Pick up a random book and read one page out loud in vn n send it here",
  "Bloom your front door and howl like a wolf for 10 seconds",
  "Take an embarrassing selfie and paste it on your profile picture",
  "Let the group choose a word and a well known song. You have to sing that song and send it in voice note",
  "Walk on your elbows and knees for as long as you can",
  "sing national anthem in voice note",
  "Breakdance for 30 seconds in the sitting room😂",
  "Tell the saddest story you know",
  "make a twerk dance video and put it on status for 5mins",
  "Eat a raw piece of garlic",
  "Show the last five people you texted and what the messages said",
  "put your full name on status for 5hrs",
  "make a short dance video without any filter just with a music and put it on ur status for 5hrs",
  "call ur bestie, bitch",
  "put your photo without filter on ur status for 10mins",
  "say i love oli london in voice note🤣🤣",
  "Send a message to your ex and say I still like you",
  "call Crush/girlfriend/bestie now and screenshot here",
  "pop to one of the group member personal chat and Say you ugly bustard",
  "say YOU ARE BEAUTIFUL/HANDSOME to one of person who is in top of ur pinlist or the first person on ur chatlist",
  "send voice notes and say, can i call u baby, if u r boy tag girl/if girl tag boy",
  "write i love you (random grup member name, who is online) in personal chat, (if u r boy write girl name/if girl write boy name) take a snap of the pic and send it here",
  "use any bollywood actor photo as ur pfp for 3 days",
  "put your crush photo on status with caption, this is my crush",
  "change name to I AM GAY for 5 hours",
  "chat to any contact in Voxapp and say i will be ur bf/gf for 5hours",
  "send voice note says i hv crush on you, want to be my girlfriend/boyfriend or not? to any random person from the grup(if u girl choose boy, if boy choose girl",
  "slap ur butt hardly send the sound of slap through voice note😂",
  "state ur gf/bf type and send the photo here with caption, ugliest girl/boy in the world",
  "shout bravooooooooo and send here through voice note",
  "snap your face then send it here",
  "Send your photo with a caption, i am lesbian",
  "shout using harsh words and send it here through vn",
  "shout you bastard in front of your mom/papa",
  "change the name to i am idiot for 24 hours",
  "slap urself firmly and send the sound of slap through voice note😂",
  "say i love the bot owner xeon through voice note",
  "send your gf/bf pic here",
  "make any tiktok dance challenge video and put it on status, u can delete it after 5hrs",
  "breakup with your best friend for 5hrs without telling him/her that its a dare",
  "tell one of your frnd that u love him/her and wanna marry him/her, without telling him/her that its a dare",
  "say i love depak kalal through voice note",
  "write i am feeling horny and put it on status, u can delete it only after 5hrs",
  "write i am lesbian and put it on status, u can delete only after 5hrs",
  "kiss your mommy or papa and say i love you😌",
  "put your father name on status for 5hrs",
  "send abusive words in any grup, excepting this grup, and send screenshot proof here"
]
