// ===============================================================================
// 🎮ᴜʟᴛʀᴏɴ™ 𝘈𝘥𝘷𝘢𝘯𝘤𝘦 𝘞𝘩𝘢𝘵𝘴𝘢𝘱𝘱 𝘜𝘴𝘦𝘳𝘣𝘰𝘵 𝘞𝘪𝘵𝘩 80+ 𝘊𝘰𝘮𝘮𝘢𝘯𝘥𝘴 𝘧𝘰𝘳 𝘣𝘰𝘵𝘩 𝘗𝘳𝘪𝘷𝘢𝘵𝘦 𝘢𝘯𝘥 𝘗𝘶𝘣𝘭𝘪𝘤..
// ===============================================================================
const { MessageType, Mimetype } = require(`@adiwajshing/baileys`);
require("python-format-js");
exports.catch = async (error, υℓтяσηℓιєηт, ᴜʟᴛʀᴏɴ) => {
  await υℓтяσηℓιєηт.sendMessage(
    ᴜʟᴛʀᴏɴ.logGroup,
    {
      url: `./ᴜʟᴛʀᴏɴ/ᴜʟᴛʀᴏɴ-error.png`,
    },
    MessageType.image,
    {
      mimetype: Mimetype.png,
      caption: `⚡𝐔𝐥𝐭𝐫𝐨𝐧™⚡ ᴅɪᴅ ɴᴏᴛ ᴡᴏʀᴋ ᴀꜱ ᴇxᴘᴇᴄᴛᴇᴅ❗

⚠️𝗘𝗿𝗿𝗼𝗿: 
➛ ${error}

      
*↱   🐞RΣPӨЯƬ   ↰*
_🔸ᴡʜᴀᴛꜱᴀᴘᴘ_
⇀ https://chat.whatsapp.com/FmMcEeSqZQw85qAkgUs3f5

_🔸ᴅɪꜱᴄᴏʀᴅ_
⇀ https://discord.gg/xcFN6NDHEV`,
    }
  );
  await υℓтяσηℓιєηт.sendMessage(
    ᴜʟᴛʀᴏɴ.chatId,
    {
      url: `./ᴜʟᴛʀᴏɴ/ᴜʟᴛʀᴏɴ-error.png`,
    },
    MessageType.image,
    {
      mimetype: Mimetype.png,
      caption: `⚡𝐔𝐥𝐭𝐫𝐨𝐧™⚡ ᴅɪᴅ ɴᴏᴛ ᴡᴏʀᴋ ᴀꜱ ᴇxᴘᴇᴄᴛᴇᴅ❗

⚠️𝗘𝗿𝗿𝗼𝗿: 
➛ ${error}

      
*↱   🐞RΣPӨЯƬ   ↰*
_🔸ᴡʜᴀᴛꜱᴀᴘᴘ_
⇀ https://chat.whatsapp.com/FmMcEeSqZQw85qAkgUs3f5

_🔸ᴅɪꜱᴄᴏʀᴅ_
⇀ https://discord.gg/xcFN6NDHEV`,
    }
  );
};
// ===============================================================================
// 🎮ᴜʟᴛʀᴏɴ™ 𝘈𝘥𝘷𝘢𝘯𝘤𝘦 𝘞𝘩𝘢𝘵𝘴𝘢𝘱𝘱 𝘜𝘴𝘦𝘳𝘣𝘰𝘵 𝘞𝘪𝘵𝘩 80+ 𝘊𝘰𝘮𝘮𝘢𝘯𝘥𝘴 𝘧𝘰𝘳 𝘣𝘰𝘵𝘩 𝘗𝘳𝘪𝘷𝘢𝘵𝘦 𝘢𝘯𝘥 𝘗𝘶𝘣𝘭𝘪𝘤..
// ===============================================================================
