// ===============================================================================
// 🎮ᴜʟᴛʀᴏɴ™ 𝘈𝘥𝘷𝘢𝘯𝘤𝘦 𝘞𝘩𝘢𝘵𝘴𝘢𝘱𝘱 𝘜𝘴𝘦𝘳𝘣𝘰𝘵 𝘞𝘪𝘵𝘩 80+ 𝘊𝘰𝘮𝘮𝘢𝘯𝘥𝘴 𝘧𝘰𝘳 𝘣𝘰𝘵𝘩 𝘗𝘳𝘪𝘷𝘢𝘵𝘦 𝘢𝘯𝘥 𝘗𝘶𝘣𝘭𝘪𝘤..
// ===============================================================================
const { MessageType, Mimetype } = require(`@adiwajshing/baileys`);
require("python-format-js");
exports.catch = async (error, υℓтяσηℓιєηт, ᴜʟᴛʀᴏɴ) => {
  await υℓтяσηℓιєηт.sendMessage(
    ᴜʟᴛʀᴏɴ.logGroup,
    {
      url: `./ᴜʟᴛʀᴏɴ/ᴜʟᴛʀᴏɴ-error.png`,
    },
    MessageType.image,
    {
      mimetype: Mimetype.png,
      caption: `⚡𝐔𝐥𝐭𝐫𝐨𝐧™⚡ 𝐝𝐢𝐝𝐧'𝐭 𝐰𝐨𝐫𝐤 𝐚𝐬 𝐞𝐱𝐩𝐞𝐜𝐭𝐞𝐝❗\n\n⚠️𝗘𝗿𝗿𝗼𝗿\n${error}`,
    }
  );
  await υℓтяσηℓιєηт.sendMessage(
    ᴜʟᴛʀᴏɴ.chatId,
    {
      url: `./ᴜʟᴛʀᴏɴ/ᴜʟᴛʀᴏɴ-error.png`,
    },
    MessageType.image,
    {
      mimetype: Mimetype.png,
      caption: `⚡𝐔𝐥𝐭𝐫𝐨𝐧™⚡ 𝐝𝐢𝐝𝐧'𝐭 𝐰𝐨𝐫𝐤 𝐚𝐬 𝐞𝐱𝐩𝐞𝐜𝐭𝐞𝐝❗\n\n⚠️𝗘𝗿𝗿𝗼𝗿\n${error}`,
    }
  );
};
// ===============================================================================
// 🎮ᴜʟᴛʀᴏɴ™ 𝘈𝘥𝘷𝘢𝘯𝘤𝘦 𝘞𝘩𝘢𝘵𝘴𝘢𝘱𝘱 𝘜𝘴𝘦𝘳𝘣𝘰𝘵 𝘞𝘪𝘵𝘩 80+ 𝘊𝘰𝘮𝘮𝘢𝘯𝘥𝘴 𝘧𝘰𝘳 𝘣𝘰𝘵𝘩 𝘗𝘳𝘪𝘷𝘢𝘵𝘦 𝘢𝘯𝘥 𝘗𝘶𝘣𝘭𝘪𝘤..
// ===============================================================================
