("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");

//▷                                              (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!                                           ◁

("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
require("../𝐕𝐥𝐤𝐲𝐫𝐞🖋️L𝖎𝖇𝖗𝖆𝖗ყ/𝕷𝖆ყO𝖚𝖙");
let { Bot_Not_Admin } = require("../Vlkyre🧭Compass/Bot_Not_Admin");
let { Sender_Not_Admin } = require("../Vlkyre🧭Compass/Sender_Not_Admin");
let { help } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📜ᴍᴇɴᴜ/help");
let { menu } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📜ᴍᴇɴᴜ/menu");
let { yta } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📥ᴅᴏᴡɴʟᴏᴀᴅᴇʀꜱ/yta");
let { ytv } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📥ᴅᴏᴡɴʟᴏᴀᴅᴇʀꜱ/ytv");
let { radio } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📥ᴅᴏᴡɴʟᴏᴀᴅᴇʀꜱ/radio");
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
let { yts } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/yts");
let { gify } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/gify");
let { image } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/image");
let { anime } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/anime");
let { manga } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/manga");
let { lyrics } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/lyrics");
let { google } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/google");
let { iguser } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/iguser");
let { pokemon } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/pokemon");
let { pokedex } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/pokedex");
let { pinterest } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/pinterest");
let { wallpaper } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔎ꜱᴇᴀʀᴄʜ/wallpaper");
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
let { toimg } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/toimg");
let { tourl } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/tourl");
let { steal } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/steal");
let { carbon } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/carbon");
let { sticker } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/sticker");
let { tinyurl } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/📼ᴄᴏɴᴠᴇʀᴛ/tinyurl");
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
let { del } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/del");
let { group } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/group");
let { remove } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/remove");
let { demote } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/demote");
let { tagall } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/tagall");
let { invite } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/invite");
let { admins } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/admins");
let { promote } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/promote");
let { setdesc } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/setdesc");
let { setgpfp } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/setgpfp");
let { antilink } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/antilink");
let { autorank } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/autorank");
let { setwelcome } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🔰ɢʀᴏᴜᴘꜱ/setwelcome");
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
let { ban } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/ban");
let { test } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/Test");
let { join } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/join");
let { leave } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/leave");
let { rules } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/rules");
let { unban } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/unban");
let { support } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/support");
let { bcgroup } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍁ᴏᴡɴᴇʀ/bcgroup");
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
let { zoo } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/zoo");
let { pay } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/pay");
let { bag } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/bag");
let { buy } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/buy");
let { rob } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/rob");
let { fish } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/fish");
let { hunt } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/hunt");
let { store } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/store");
let { daily } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/daily");
let { gamble } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/gamble");
let { balance } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/💰ɢᴀᴍᴇ/balance");
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
let { ass } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/ass");
let { cum } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/cum");
let { bdsm } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/bdsm");
let { feet } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/feet");
let { maid } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/maid");
let { orgy } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/orgy");
let { yuri } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/yuri");
let { doujin } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/doujin");
let { femdom } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/femdom");
let { hentai } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/hentai");
let { thighs } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/thighs");
let { school } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/school");
let { foxgirl } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/foxgirl");
let { glasses } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/glasses");
let { uniform } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/uniform");
let { panties } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/panties");
let { netorare } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/netorare");
let { tentacles } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/tentacles");
let { masturbation } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🍑ʜᴇɴᴛᴀɪ/masturbation");
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
let { echo } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/echo");
let { slow } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/slow");
let { speed } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/speed");
let { phaser } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/phaser");
let { flanger } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/flanger");
let { vibrato } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/vibrato");
let { reverse } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/reverse");
let { subboost } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/subboost");
let { surround } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/surround");
let { bassboost } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/bassboost");
let { nightcore } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/nightcore");
let { vaporwave } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/vaporwave");
let { superspeed } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥐ꜰɪʟᴛᴇʀꜱ/superspeed");
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
let { yt8d } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/yt8d");
let { ytecho } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytecho");
let { ytslow } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytslow");
let { ytspeed } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytspeed");
let { ytphaser } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytphaser");
let { ytflanger } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytflanger");
let { ytvibrato } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytvibrato");
let { ytreverse } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytreverse");
let { ytsurround } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytsurround");
let { ytsubboost } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytsubboost");
let { ytsuperslow } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytsuperslow");
let { ytvaporwave } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytvaporwave");
let { ytnightcore } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytnightcore");
let { ytbassboost } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytbassboost");
let { ytsuperspeed } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⭕ʏᴛꜰɪʟᴛᴇʀ/ytsuperspeed");
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
let { pat } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/pat");
let { hug } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/hug");
let { cry } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/cry");
let { sad } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/sad");
let { yes } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/yes");
let { kiss } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/kiss");
let { kick } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/kick");
let { bite } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/bite");
let { poke } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/poke");
let { yeet } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/yeet");
let { slap } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/slap");
let { wave } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/wave");
let { wink } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/wink");
let { baka } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/baka");
let { bonk } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/bonk");
let { kill } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/kill");
let { blush } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/blush");
let { bored } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/bored");
let { happy } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/happy");
let { smile } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/smile");
let { dance } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/dance");
let { punch } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/punch");
let { stare } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/stare");
let { cuddle } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/cuddle");
let { scream } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/scream");
let { nervous } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/nervous");
let { confused } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/confused");
let { highfive } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/highfive");
let { goodnight } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/🥞ᴀɴɪᴍᴇ/goodnight");
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
let { tts } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/tts");
let { rank } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/rank");
let { joke } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/joke");
let { meme } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/meme");
let { ship } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/ship");
let { fact } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/fact");
let { neko } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/neko");
let { quote } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/quote");
let { waifu } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/waifu");
let { advice } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/advice");
let { reddit } = require("../𝐕𝐥𝐤𝐲𝐫𝐞🗂️S𝖙𝖔𝖗𝖆𝖌𝖊/⚡ʀᴀɴᴅᴏᴍꜱ/reddit");
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
exports.𝕮𝖆𝖘𝖊𝕮𝖎𝖗𝖈𝖚𝖎𝖙 = async (𝐕𝐥𝐤𝐲𝐫𝐞, 𝖍𝖆𝖜ӄ, 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗, Ѷ𝖎𝖔𝖓) => {
switch (𝐕𝐥𝐤𝐲𝐫𝐞.commandName) {
case "":
break;
case "pokemon":
await pokemon(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "pokedex":
await pokedex(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "carbon":
await carbon(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "getgif":
case "gify":
case "gif":
await gify(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "s":
case "sgif":
case "sticker":
case "stickergif":
await sticker(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "toimg":
await toimg(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "pin":
case "pinterest":
await pinterest(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "tourl":
await tourl(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "remove":
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin) return await Bot_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin) return await Sender_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
await remove(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "promote":
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin) return await Bot_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin) return await Sender_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
await promote(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "admin":
case "admins":
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin && !𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF)
return await Sender_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin && !𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF)
return await Bot_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
await admins(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "demote":
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin) return await Bot_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin) return await Sender_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
await demote(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "setdesc":
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin) return await Bot_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin) return await Sender_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
await setdesc(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "seticon":
case "setgpfp":
case "setppgrup":
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin) return await Bot_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin) return await Sender_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
await setgpfp(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "tagall":
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin && !𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF)
return await Sender_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin && !𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF)
return await Bot_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
await tagall(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "group":
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin) return await Bot_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin) return await Sender_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
await group(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "invite":
case "grouplink":
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin) return await Bot_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin) return await Sender_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
await invite(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "del":
case "delete":
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin && !𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF)
return await Bot_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin && !𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF)
return await Sender_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
await del(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "antilink":
case "stoplink":
case "nolink":
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin) return await Bot_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin) return await Sender_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
await antilink(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "autorank":
case "autorole":
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin && !𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF)
return await Bot_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin && !𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF)
return await Sender_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
await autorank(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "welcome":
case "welcomer":
case "setwelcome":
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin && !𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF)
return await Bot_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
if (!𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin && !𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF)
return await Sender_Not_Admin(ӄ𝖗𝖞ӄ𝖓𝖟, 𝐕𝐥𝐤𝐲𝐫𝐞);
await setwelcome(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "test":
await test(
Ѷ𝖎𝖔𝖓,
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ban":
await ban(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "unban":
await unban(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "radio":
case "randmusic":
case "randaudio":
case "randomaudio":
case "randommusic":
case "suggestaudio":
case "suggestmusic":
await radio(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "yta":
case "play":
case "song":
case "sing":
case "ytmp3":
case "ytplay":
case "ytaudio":
case "ytmusic":
case "youtubemusic":
await yta(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ytv":
case "watch":
case "stream":
case "ytmp4":
case "ytvideo":
case "youtubevideo":
await ytv(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "yts":
case "ytsearch":
case "ytscrape":
case "youtubescrape":
case "youtubesearch":
await yts(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "sr":
case "reddit":
case "subreddit":
await reddit(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "rank":
await rank(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "tts":
case "gtts":
case "text2speech":
await tts(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "fun":
case "joke":
case "funny":
case "laugh":
case "dadjoke":
await joke(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "meme":
await meme(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "tinyurl":
await tinyurl(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "join":
await join(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "leave":
await leave(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "lyrics":
await lyrics(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "gimage":
case "image":
await image(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "web":
case "find":
case "search":
case "google":
await google(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "take":
case "steal":
await steal(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "iguser":
await iguser(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ship":
await ship(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "quote":
await quote(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "fact":
await fact(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "advice":
await advice(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "pat":
await pat(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "hug":
await hug(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "kiss":
await kiss(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "cuddle":
await cuddle(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "kick":
await kick(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "bite":
await bite(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "blush":
await blush(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "bored":
await bored(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "confused":
await confused(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "cry":
await cry(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "goodnight":
await goodnight(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "happy":
await happy(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "poke":
await poke(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "sad":
await sad(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "slap":
await slap(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "smile":
await smile(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "wave":
await wave(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "wink":
await wink(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "dance":
await dance(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "baka":
await baka(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "bonk":
await bonk(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "hi5":
case "highfive":
await highfive(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "kill":
await kill(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "nervous":
await nervous(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "punch":
await punch(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "scream":
await scream(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "stare":
await stare(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "yeet":
await yeet(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "yes":
await yes(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "waifu":
await waifu(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "neko":
await neko(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "anime":
await anime(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "manga":
await manga(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "wallpaper":
await wallpaper(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "bc":
case "bcgroup":
await bcgroup(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "yt8d":
await yt8d(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ytbassboost":
await ytbassboost(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ytecho":
await ytecho(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ytflanger":
await ytflanger(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ytnightcore":
await ytnightcore(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ytphaser":
await ytphaser(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ytreverse":
await ytreverse(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ytslow":
await ytslow(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ytspeed":
await ytspeed(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ytsubboost":
await ytsubboost(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ytsuperslow":
await ytsuperspeed(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ytsuperslow":
await ytsuperslow(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ytsurround":
await ytsurround(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ytvaporwave":
await ytvaporwave(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ytvibrato":
await ytvibrato(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "bassboost":
await bassboost(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "echo":
await echo(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "flanger":
await flanger(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "nightcore":
await nightcore(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "phaser":
await phaser(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "reverse":
await reverse(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "slow":
await slow(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "speed":
await speed(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "subboost":
await subboost(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "superspeed":
await superspeed(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "surround":
await surround(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "vaporwave":
await vaporwave(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "vibrato":
await vibrato(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "ass":
await ass(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "bdsm":
await bdsm(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "cum":
await cum(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "doujin":
await doujin(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "feet":
await feet(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "femdom":
await femdom(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "foxgirl":
await foxgirl(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "glasses":
await glasses(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "hentai":
await hentai(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "maid":
await maid(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "masturbation":
await masturbation(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "netorare":
await netorare(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "orgy":
await orgy(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.fromMe,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.groupMetadata,
𝐕𝐥𝐤𝐲𝐫𝐞.participants,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.groupAdmins,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body,
𝐕𝐥𝐤𝐲𝐫𝐞.mentionByTag,
𝐕𝐥𝐤𝐲𝐫𝐞.mentionByReply
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "panties":
await panties(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "school":
await school(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "tentacles":
await tentacles(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "thighs":
await thighs(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "uniform":
await uniform(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "yuri":
await yuri(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "dly":
case "daily":
await daily(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "fish":
case "pond":
case "fishes":
await fish(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "bet":
case "gamble":
case "betting":
case "roulette":
await gamble(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "hunt":
case "hunting":
case "pokehunt":
await hunt(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "zoo":
case "forest":
case "animals":
await zoo(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "pay":
case "loan":
case "borrow":
case "payment":
await pay(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "bal":
case "gold":
case "money":
case "balance":
await balance(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "buy":
await buy(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "mall":
case "shop":
case "store":
case "shopping":
await store(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "rob":
case "thief":
case "robbery":
await rob(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "bag":
case "inv":
case "loot":
case "inventory":
await bag(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "sp":
case "dev":
case "devs":
case "support":
case "official":
case "SUPPORT🦚":
await support(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "rule":
case "rules":
case "rules":
case "BOT⚡RULES":
await rules(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
break;
case "m":
case "menu":
case "allmenu":
case "command":
case "commands":
case "MENU📜":
await menu(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
case "h":
case "how":
case "help":
case "HELP🦀":
await help(
𝖍𝖆𝖜ӄ,
𝐕𝐥𝐤𝐲𝐫𝐞,
𝐕𝐥𝐤𝐲𝐫𝐞.pushName,
𝐕𝐥𝐤𝐲𝐫𝐞.F𝖚𝖑𝖑_A𝖗𝖌𝖘,
𝐕𝐥𝐤𝐲𝐫𝐞.quoted,
𝐕𝐥𝐤𝐲𝐫𝐞.isMedia,
𝐕𝐥𝐤𝐲𝐫𝐞.isGroup,
𝐕𝐥𝐤𝐲𝐫𝐞.isBotAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderAdmin,
𝐕𝐥𝐤𝐲𝐫𝐞.isSenderTUF,
𝐕𝐥𝐤𝐲𝐫𝐞.commandName,
𝐕𝐥𝐤𝐲𝐫𝐞.Body
);
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
break;
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
default:
await 𝕮𝖔𝖚𝖓𝖙𝖊𝖗𝖀𝖘𝖊𝖗(1);
return await 𝖍𝖆𝖜ӄ.sendMessage(
𝐕𝐥𝐤𝐲𝐫𝐞.chatID,
{
contextInfo: {
mentionedJid: [𝐕𝐥𝐤𝐲𝐫𝐞.sender],
},
image: {
url: "./Vlkyre👗Skins/𝐕𝐥𝐤𝐲𝐫𝐞_404.png",
},
caption: `❣️ *ɴᴀᴍᴇ:* ${𝐕𝐥𝐤𝐲𝐫𝐞.pushName || "No_Name"}

*❌𝕰𝖗𝖗𝖔𝖗:* No Such Command.`,
footer: "*⦓ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ⦔*\nᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ",
buttons: [
{
buttonId: prefix + "HELP🦀",
buttonText: {
displayText: prefix + "HELP🦀",
},
type: 1,
},
],
headerType: 4,
},
{
quoted: 𝐕𝐥𝐤𝐲𝐫𝐞,
}
);
}
};
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");

//▷                                              (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!                                           ◁

("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
