// ⦿•=•=•=•=•=•=•=•=•=•=•=•=•=•──────[]  𝐌𝐢𝐳𝐮𝐤𝐢™   []──────•=•=•=•=•=•=•=•=•=•=•=•=•=•⦿
const { MessageType, Mimetype } = require(`@adiwajshing/baileys`);
const ℓιєηт = require(`../../𝓜𝖎𝖟𝖚ӄ𝖎🧀𝓒𝓻𝓪𝓽𝓮/catch`);
const _𝔏𝔞𝔟_ = require(`../../𝓜𝖎𝖟𝖚ӄ𝖎🧀𝓒𝓻𝓪𝓽𝓮/_𝔏𝔞𝔟_`);
var ᴋᴇɪᴇx = new RegExp(_𝔏𝔞𝔟_.FOXTROT, `g`);
var ᴋᴇɪ = /\/\^\[(.*)+\]\/\g/g.exec(ᴋᴇɪᴇx)[1];
const vers = require(`../../package.json`);
// ⦿•=•=•=•=•=•=•=•=•=•=•=•=•=•──────[]  𝐌𝐢𝐳𝐮𝐤𝐢™   []──────•=•=•=•=•=•=•=•=•=•=•=•=•=•⦿
module.exports = {
  name: `menu`,
  description: `ɢᴇᴛ ᴛʜᴇ entire ᴄᴏᴍᴍᴀɴᴅ ʟɪꜱᴛ ᴀɴᴅ ɪɴꜰᴏ ᴏɴ ᴍᴏᴅᴜʟᴇꜱ`,
  𝓜𝓮𝓮6ʍօʀɛ: `${ᴋᴇɪ}`,
  async handle(ӄʀǟӄɨռʐ, chat, 𝓜𝖎𝖟𝖚ӄ𝖎, arg, 𝓜𝓲𝔃𝓾𝓴𝓲𝓢𝓲𝓽𝓻𝓮𝓹) {
    try {
      // ⦿•=•=•=•=•=•=•=•=•=•=•=•=•=•──────[]  𝐌𝐢𝐳𝐮𝐤𝐢™   []──────•=•=•=•=•=•=•=•=•=•=•=•=•=•⦿
      var ꜱᴇɴᴅᴇʀɪᴅ = 𝓜𝖎𝖟𝖚ӄ𝖎.sender;
      var ꜱᴇɴᴅᴇʀᴄᴏɴꜰ = ꜱᴇɴᴅᴇʀɪᴅ.substring(0, ꜱᴇɴᴅᴇʀɪᴅ.length - 15);
      // ⦿•=•=•=•=•=•=•=•=•=•=•=•=•=•──────[]  𝐌𝐢𝐳𝐮𝐤𝐢™   []──────•=•=•=•=•=•=•=•=•=•=•=•=•=•⦿
      var ꜱᴇɴᴅᴇʀɪᴅ = 𝓜𝖎𝖟𝖚ӄ𝖎.sender;
      var ꜱᴇɴᴅᴇʀᴄᴏɴꜰ = ꜱᴇɴᴅᴇʀɪᴅ.substring(0, ꜱᴇɴᴅᴇʀɪᴅ.length - 15);
      const MeeHelper = `*𝘽𝙊𝙏 𝙄𝙉 𝘽𝙀𝙏𝘼*
シ︎🛸𝐆𝐫𝐨𝐮𝐩: ${_𝔏𝔞𝔟_.HASH}

┌────⭓ *🤩𝘼𝙣𝙞𝙢𝙚 > (${ᴋᴇɪ}animeside)*
│🎋• ${ᴋᴇɪ}anime (ꜱᴇᴀʀᴄʜ)
│🎋• ${ᴋᴇɪ}animewallpaper (ꜱᴇᴀʀᴄʜ)
│🎋• ${ᴋᴇɪ}smile (ɢɪꜰ) 
│🎋• ${ᴋᴇɪ}yes (ɢɪꜰ)
│🎋• ${ᴋᴇɪ}bite (ɢɪꜰ)
│🎋• ${ᴋᴇɪ}blush (ɢɪꜰ)
│🎋• ${ᴋᴇɪ}bored (ɢɪꜰ)
│🎋• ${ᴋᴇɪ}confused (ɢɪꜰ)
│🎋• ${ᴋᴇɪ}cry (ɢɪꜰ)
│🎋• ${ᴋᴇɪ}goodnight (ɢɪꜰ)
│🎋• ${ᴋᴇɪ}happy (ɢɪꜰ)
│🎋• ${ᴋᴇɪ}hi5 (ɢɪꜰ)
│🎋• ${ᴋᴇɪ}poke (ɢɪꜰ)
│🎋• ${ᴋᴇɪ}sad (ɢɪꜰ)
│🎋• ${ᴋᴇɪ}thinking (ɢɪꜰ)
│🎋• ${ᴋᴇɪ}cuddle (ɢɪꜰ)
│🎋• ${ᴋᴇɪ}hug (ɢɪꜰ)
│🎋• ${ᴋᴇɪ}pat (ɢɪꜰ)
│🎋• ${ᴋᴇɪ}slap (ɢɪꜰ) 
│🎋• ${ᴋᴇɪ}wink (ɢɪꜰ)
└───────────⭓

┌────⭓ *🍫𝙈𝙪𝙨𝙞𝙘 > (${ᴋᴇɪ}musicside)*
│🍫• ${ᴋᴇɪ}lyrics (ꜱᴇᴀʀᴄʜ)
│🍫• ${ᴋᴇɪ}ytsearch (ꜱᴇᴀʀᴄʜ)
│🍫• ${ᴋᴇɪ}ytaudio (ᴍᴜꜱɪᴄ-ᴅʟ)
│🍫• ${ᴋᴇɪ}ytvideo (ᴠɪᴅᴇᴏ-ᴅʟ)
└───────────⭓

┌────⭓ *𝙊𝙬𝙣𝙚𝙧-𝙊𝙣𝙡𝙮 > (${ᴋᴇɪ}ownerside)*
│🐙• ${ᴋᴇɪ}update
│🐙• ${ᴋᴇɪ}broadcast
└───────────⭓

┌────⭓ *💻𝙎𝙮𝙨𝙩𝙚𝙢 > (${ᴋᴇɪ}systemside)*
│⚙️• ${ᴋᴇɪ}help 
│⚙️• ${ᴋᴇɪ}mizuki
│⚙️• ${ᴋᴇɪ}nekobin (ʙᴇᴛᴀ)
│⚙️• ${ᴋᴇɪ}update
│⚙️• ${ᴋᴇɪ}broadcast (ʙᴇᴛᴀ)
└───────────⭓

┌────⭓ *👑𝙂𝙧𝙤𝙪𝙥𝙨 > (groupside)*
│🍭• ${ᴋᴇɪ}promote (ʙᴇᴛᴀ)
│🍭• ${ᴋᴇɪ}demote (ʙᴇᴛᴀ)
│🍭• ${ᴋᴇɪ}spam (ʙᴇᴛᴀ)
│🍭• ${ᴋᴇɪ}invite (ʙᴇᴛᴀ)
│🍭• ${ᴋᴇɪ}admins
│🍭• ${ᴋᴇɪ}disappear
│🍭• ${ᴋᴇɪ}groupdp
│🍭• ${ᴋᴇɪ}unmute (ʙᴇᴛᴀ)
│🍭• ${ᴋᴇɪ}mute (ʙᴇᴛᴀ)
│🍭• ${ᴋᴇɪ}kick
│🍭• ${ᴋᴇɪ}tagall
│🍭• ${ᴋᴇɪ}setwelcome
│🍭• ${ᴋᴇɪ}setgoodbye
│🍭• ${ᴋᴇɪ}setantilink (ʙᴇᴛᴀ)
└───────────⭓

┌────⭓ *🧀𝙁𝙪𝙣𝙨 > (${ᴋᴇɪ}funside)*
│🦄• ${ᴋᴇɪ}google (ꜱᴇᴀʀᴄʜ)
│🦄• ${ᴋᴇɪ}pinterest (ꜱᴇᴀʀᴄʜ)
│🦄• ${ᴋᴇɪ}carbon 
│🦄• ${ᴋᴇɪ}pfgroupdp
│🦄• ${ᴋᴇɪ}github
│🦄• ${ᴋᴇɪ}beautycheck
│🦄• ${ᴋᴇɪ}joke (ʙᴇᴛᴀ)
│🦄• ${ᴋᴇɪ}meme
│🦄• ${ᴋᴇɪ}ocr
│🦄• ${ᴋᴇɪ}sticker
│🦄• ${ᴋᴇɪ}translate
│🦄• ${ᴋᴇɪ}tts (ʙᴇᴛᴀ) 
│🦄• ${ᴋᴇɪ}weather (ʙᴇᴛᴀ)  
│🦄• ${ᴋᴇɪ}ud
└───────────⭓

┌────⭓ *🔞𝙉𝙎𝙁𝙒 18+ > (${ᴋᴇɪ}nsfwside)*
│🍄• ${ᴋᴇɪ}ass  
│🍄• ${ᴋᴇɪ}bdsm  
│🍄• ${ᴋᴇɪ}blowjob  
│🍄• ${ᴋᴇɪ}cum  
│🍄• ${ᴋᴇɪ}doujin 
│🍄• ${ᴋᴇɪ}feet  
│🍄• ${ᴋᴇɪ}femdom  
│🍄• ${ᴋᴇɪ}foxgirl  
│🍄• ${ᴋᴇɪ}glasses  
│🍄• ${ᴋᴇɪ}hentai  
│🍄• ${ᴋᴇɪ}maid  
│🍄• ${ᴋᴇɪ}masturbation 
│🍄• ${ᴋᴇɪ}netorare  
│🍄• ${ᴋᴇɪ}orgy 
│🍄• ${ᴋᴇɪ}panties  
│🍄• ${ᴋᴇɪ}pussy 
│🍄• ${ᴋᴇɪ}school  
│🍄• ${ᴋᴇɪ}tentacles 
│🍄• ${ᴋᴇɪ}thighs
│🍄• ${ᴋᴇɪ}uniform
│🍄• ${ᴋᴇɪ}yuri
└───────────⭓

*⧪➛𝘾𝙤𝙢𝙞𝙣𝙜 𝙎𝙤𝙤𝙣!*
many many more!
`;
      // ⦿•=•=•=•=•=•=•=•=•=•=•=•=•=•──────[]  𝐌𝐢𝐳𝐮𝐤𝐢™   []──────•=•=•=•=•=•=•=•=•=•=•=•=•=•⦿
      //•⬡• 😈𝗠𝗶𝘇𝘂𝗸𝗶 𝗪𝗵𝗮𝘁𝘀𝗮𝗽𝗽 𝗨𝘀𝗲𝗿𝗯𝗼𝘁😈
      //•⬡• 🐙ᴀᴅᴠᴀɴᴄᴇᴅ ᴡʜᴀᴛꜱᴀᴘᴘ ᴜꜱᴇʀʙᴏᴛ ᴡɪᴛʜ 80+ ᴄᴏᴍᴍᴀɴᴅꜱ ꜰᴏʀ ʙᴏᴛʜ ᴘʀɪᴠᴀᴛᴇ ᴀɴᴅ ɢʀᴏᴜᴘ-ᴜꜱᴀɢᴇ🐙
      //•⬡• ɢɴᴜ ɢᴇɴᴇʀᴀʟ ᴘᴜʙʟɪᴄ ʟɪᴄᴇɴꜱᴇ ᴠᴇʀꜱɪᴏɴ 3, 29 ᴊᴜɴᴇ 2007 ᴄᴏᴘʏʀɪɢʜᴛ (ᴄ) 2007 ꜰʀᴇᴇ ꜱᴏꜰᴛᴡᴀʀᴇ ꜰᴏᴜɴᴅᴀᴛɪᴏɴ
      //•⬡• ᴇᴠᴇʀʏᴏɴᴇ ɪꜱ ᴘᴇʀᴍɪᴛᴛᴇᴅ ᴛᴏ 𝗰𝗼𝗽𝘆 𝗮𝗻𝗱 𝗱𝗶𝘀𝘁𝗿𝗶𝗯𝘂𝘁𝗲 ᴠᴇʀʙᴀᴛɪᴍ ᴄᴏᴘɪᴇꜱ ᴏꜰ ᴛʜɪꜱ ʟɪᴄᴇɴꜱᴇ ᴅᴏᴄᴜᴍᴇɴᴛ, 𝗯𝘂𝘁 𝗰𝗵𝗮𝗻𝗴𝗶𝗻𝗴 𝗶𝘁 𝗶𝘀 𝗻𝗼𝘁 𝗮𝗹𝗹𝗼𝘄𝗲𝗱.
      //•⬡• —••÷[ 𝓜𝖎𝖟𝖚ӄ𝖎™ ]÷••—  ᴡʜᴀᴛꜱᴀᴘᴘ ᴜꜱᴇʀʙᴏᴛ has been licensed under Apache License
      //•⬡• 𝐂𝐨𝐩𝐲𝐫𝐢𝐠𝐡𝐭 (𝐂) 𝟐𝟎𝟐𝟏 𝗞𝗿𝗮𝗸𝗶𝗻𝘇 │ 𝗞𝗿𝗮𝗸𝗶𝗻𝘇𝗟𝗮𝗯 │ 𝗞𝗿𝗮𝗸𝗶𝗻𝘇𝗕𝗼𝘁
      //•⬡• 💡𝗠𝗮𝗱𝗲 𝗕𝘆 𝗔 𝗡𝗼𝗼𝗯 𝗳𝗼𝗿 𝗣𝗿𝗼𝘀💡
      // ⦿•=•=•=•=•=•=•=•=•=•=•=•=•=•──────[]  𝐌𝐢𝐳𝐮𝐤𝐢™   []──────•=•=•=•=•=•=•=•=•=•=•=•=•=•⦿
      if (!arg[0]) {
        await ӄʀǟӄɨռʐ
          .sendMessage(
            𝓜𝖎𝖟𝖚ӄ𝖎.chatId,
            {
              url: _𝔏𝔞𝔟_.MEE,
            },
            MessageType.image,
            {
              mimetype: Mimetype.png || Mimetype.jpeg,
              contextInfo: {
                mentionedJid: [𝓜𝖎𝖟𝖚ӄ𝖎.sender],
              },
              caption: `_𝐌𝐢𝐳𝐮𝐤𝐢™_

•@${ꜱᴇɴᴅᴇʀᴄᴏɴꜰ},

${MeeHelper}‍`,
            }
          )
          .catch((ℓαвєяяσя) => ℓιєηт.catch(ℓαвєяяσя, ӄʀǟӄɨռʐ, 𝓜𝖎𝖟𝖚ӄ𝖎));
      }
      var 𝓜𝖎𝖟𝖚ӄ𝖎ʍօ = `⤥ 💡𝐂𝐨𝐦𝐦𝐚𝐧𝐝\n`;
      var command = 𝓜𝓲𝔃𝓾𝓴𝓲𝓢𝓲𝓽𝓻𝓮𝓹.get(arg[0]);
      if (command) {
        𝓜𝖎𝖟𝖚ӄ𝖎ʍօ += `⤤ ${
          (ᴋᴇɪ, command.name === undefined ? `Null` : command.name)
        }

⤥ 🖊️𝐃𝐞𝐬𝐜𝐫𝐢𝐩𝐭𝐢𝐨𝐧
⤤ ${
          (command.description,
          command.description === undefined ? `Null` : command.description)
        }`;
        return ӄʀǟӄɨռʐ
          .sendMessage(
            𝓜𝖎𝖟𝖚ӄ𝖎.chatId,
            {
              url: _𝔏𝔞𝔟_.MEE,
            },
            MessageType.image,
            {
              mimetype: Mimetype.png || Mimetype.jpeg,
              caption: 𝓜𝖎𝖟𝖚ӄ𝖎ʍօ,
            }
          )
          .catch((ℓαвєяяσя) => ℓιєηт.catch(ℓαвєяяσя, ӄʀǟӄɨռʐ, 𝓜𝖎𝖟𝖚ӄ𝖎));
      }
    } catch (ℓαвєяяσя) {
      ℓιєηт.catch(ℓαвєяяσя, ӄʀǟӄɨռʐ, 𝓜𝖎𝖟𝖚ӄ𝖎);
      console.log(ℓαвєяяσя);
    }
  },
};
// ⦿•=•=•=•=•=•=•=•=•=•=•=•=•=•──────[]  𝐌𝐢𝐳𝐮𝐤𝐢™   []──────•=•=•=•=•=•=•=•=•=•=•=•=•=•⦿
