("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");

//▷                                              (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!                                           ◁

("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
const _0xa1dda1 = _0x24a7;
(function (_0x112f6e, _0x24e776) {
const _0x456052 = _0x24a7,
_0x4fc073 = _0x112f6e();
while (!![]) {
try {
const _0x5522ee =
(parseInt(_0x456052(0x1dc)) / 0x1) *
(parseInt(_0x456052(0x1e2)) / 0x2) +
-parseInt(_0x456052(0x1e3)) / 0x3 +
(-parseInt(_0x456052(0x1e1)) / 0x4) *
(parseInt(_0x456052(0x1dd)) / 0x5) +
parseInt(_0x456052(0x1e6)) / 0x6 +
parseInt(_0x456052(0x1e5)) / 0x7 +
-parseInt(_0x456052(0x1e4)) / 0x8 +
(-parseInt(_0x456052(0x1de)) / 0x9) *
(-parseInt(_0x456052(0x1df)) / 0xa);
if (_0x5522ee === _0x24e776) break;
else _0x4fc073["push"](_0x4fc073["shift"]());
} catch (_0x58cd97) {
_0x4fc073["push"](_0x4fc073["shift"]());
}
}
})(_0x153d, 0x6fe87);
let mongoose = require("mongoose"),
BadgeSchema = new mongoose[_0xa1dda1(0x1da)]({
ID: String,
Badge: String,
value: String,
Limits: Number,
CurrentLimitTime: Number,
PermanentLimitTime: Number,
});
function _0x153d() {
const _0x11c4d2 = [
"Schema",
"Badge",
"7YIkdnu",
"20120lyWBth",
"63ltwnkF",
"81330gsTcra",
"exports",
"156dhAZkQ",
"225052KmGTle",
"2522217IXLDMJ",
"1860536oMfIvu",
"4209751yeGFBo",
"1455666sdBvXg",
];
_0x153d = function () {
return _0x11c4d2;
};
return _0x153d();
}
function _0x24a7(_0x1f9b4b, _0x34edf7) {
const _0x153d79 = _0x153d();
return (
(_0x24a7 = function (_0x24a70, _0x4905eb) {
_0x24a70 = _0x24a70 - 0x1da;
let _0x160044 = _0x153d79[_0x24a70];
return _0x160044;
}),
_0x24a7(_0x1f9b4b, _0x34edf7)
);
}
module[_0xa1dda1(0x1e0)] = mongoose["model"](_0xa1dda1(0x1db), BadgeSchema);
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");

//▷                                              (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!                                           ◁

("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
