import platform
import psutil
import os
my_system = platform.uname()
print('⬡==========================⬡    🍁 爪𝖎𝖟𝖚ӄ𝖎™ 🍁    ⬡==========================⬡')
print(f'🍁System: {my_system.system}')
print(f'🍁Node Name: {my_system.node}')
print(f'🍁Release: {my_system.release}')
print(f'🍁Version: {my_system.version}')
print(f'🍁Machine: {my_system.machine}')
print(f'🍁Memory: {psutil.virtual_memory()}')
print(f'🍁Processor: {my_system.processor}')
print('''
⬡==========================⬡    🍁 爪𝖎𝖟𝖚ӄ𝖎™ 🍁    ⬡==========================⬡
                ███╗   ███╗██╗███████╗██╗   ██╗██╗  ██╗██╗
                ████╗ ████║██║╚══███╔╝██║   ██║██║ ██╔╝██║
                ██╔████╔██║██║  ███╔╝ ██║   ██║█████╔╝ ██║
                ██║╚██╔╝██║██║ ███╔╝  ██║   ██║██╔═██╗ ██║
                ██║ ╚═╝ ██║██║███████╗╚██████╔╝██║  ██╗██║
                ╚═╝     ╚═╝╚═╝╚══════╝ ╚═════╝ ╚═╝  ╚═╝╚═╝
⬡==========================⬡    🍁 爪𝖎𝖟𝖚ӄ𝖎™ 🍁    ⬡==========================⬡
''')
os.system('node ʍɨʐʊӄɨ🛰️ֆɛʀʋɛʀ/🍁爪𝖎𝖟𝖚ӄ𝖎™.js')
