`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/*        
(𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
import { MessageType } from "../../𝐀𝐫𝐜𝐭𝐢𝐱⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/message-type";
import { proto } from "@adiwajshing/baileys";
import Client from "../../𝐀𝐫𝐜𝐭𝐢𝐱⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/client";
import νℓкуяιє from "../../𝐀𝐫𝐜𝐭𝐢𝐱⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/msb";
import ʟᴀʏᴏᴜᴛ from "../../𝐀𝐫𝐜𝐭𝐢𝐱🀄𝐕𝐞𝐧𝐭/ʟᴀʏᴏᴜᴛ";
("|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|");
import * as fs from 'fs';
import path from 'path';
var scriptName = path.basename(__filename);
var dotScrpt = scriptName.slice(0, -3).toLowerCase();
("|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|");
export = {
name: dotScrpt,
async handle(
client: Client,
chat: proto.IWebMessageInfo,
νℓкуяιє: νℓкуяιє,
args: string[],
ӄ𝖗𝖆ӄ𝖎𝖓𝖟𝕷𝖆𝖇
): Promise<void> {
await client.sendMessage(
νℓкуяιє.chatId,
{
quoted: chat.message,
contextInfo: {
mentionedJid: [νℓкуяιє.sender],
},
timestamp: Date(),
image: { url: "./𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞👜𝐁𝐚𝐠/νℓкуяιє.png" },
caption: `╔◇✥𝐔𝐬𝐞𝐫: ${chat.pushName}
║🦋 𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞: _Is an Advance Whatsapp User-Bot!_
║🛰️ 𝐖𝐞𝐛𝐬𝐢𝐭𝐞: _VlkyreAI.krakinzkon.repl.co_
╚◇════════════◇꧂

╔════⧉🍙 𝐀𝐧𝐢𝐦𝐞
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}anime:*  _search any anime_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}ranimewall:*  _get random anime wallpaper_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}smile:*  _@tag or reply_ 
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}yes:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}bite:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}blush:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}bored:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}confused:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}cry:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}goodnight:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}happy:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}hi5:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}poke:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}sad:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}thinking:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}cuddle:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}hug:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}pat:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}slap:*  _@tag or reply_ 
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}wink:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}angry:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}baka:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}bonk:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}bully:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}bye:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}chase:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}cheer:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}cringe:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}dab:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}dance:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}die:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}facepalm:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}feed:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}glomp:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}hold:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}hate:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}hi:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}kill:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}lick:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}love:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}lurk:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}nervous:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}nope:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}nom:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}nuzzle:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}panic:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}peck:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}poke:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}pout:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}run:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}sip:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}shoot:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}shrug:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}sleep:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}smug:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}stab:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}stare:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}tease:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}tickle:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}thumbsup:*  _@tag or reply_
║• *${ʟᴀʏᴏᴜᴛ.MuveOn}wag:*  _@tag or reply_
╚════════════╝`,
footer: "`⦓ 𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 ⦔",
buttons: [
{
buttonId: `${ʟᴀʏᴏᴜᴛ.MuveOn}help`,
buttonText: { displayText: `${ʟᴀʏᴏᴜᴛ.MuveOn}help` },
type: 1,
},
{
buttonId: `${ʟᴀʏᴏᴜᴛ.MuveOn}menu`,
buttonText: { displayText: `${ʟᴀʏᴏᴜᴛ.MuveOn}menu` },
type: 1,
},
],
headerType: 4,
},
MessageType.buttonsMessage
);
},
};
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/*        
(𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
