"⬡==================⬡-----------------⦿   𝐌𝐢𝐳𝐮𝐤𝐢™   ⦿-----------------⬡==================⬡";
//•⬡• 😈𝗠𝗶𝘇𝘂𝗸𝗶 𝗪𝗵𝗮𝘁𝘀𝗮𝗽𝗽 𝗨𝘀𝗲𝗿𝗯𝗼𝘁😈
//•⬡• 🐙ᴀᴅᴠᴀɴᴄᴇᴅ ᴡʜᴀᴛꜱᴀᴘᴘ ᴜꜱᴇʀʙᴏᴛ ᴡɪᴛʜ 80+ ᴄᴏᴍᴍᴀɴᴅꜱ ꜰᴏʀ ʙᴏᴛʜ ᴘʀɪᴠᴀᴛᴇ ᴀɴᴅ ɢʀᴏᴜᴘ-ᴜꜱᴀɢᴇ🐙
//•⬡• ɢɴᴜ ɢᴇɴᴇʀᴀʟ ᴘᴜʙʟɪᴄ ʟɪᴄᴇɴꜱᴇ ᴠᴇʀꜱɪᴏɴ 3, 29 ᴊᴜɴᴇ 2007 ᴄᴏᴘʏʀɪɢʜᴛ (ᴄ) 2007 ꜰʀᴇᴇ ꜱᴏꜰᴛᴡᴀʀᴇ ꜰᴏᴜɴᴅᴀᴛɪᴏɴ
//•⬡• ᴇᴠᴇʀʏᴏɴᴇ ɪꜱ ᴘᴇʀᴍɪᴛᴛᴇᴅ ᴛᴏ 𝗰𝗼𝗽𝘆 𝗮𝗻𝗱 𝗱𝗶𝘀𝘁𝗿𝗶𝗯𝘂𝘁𝗲 ᴠᴇʀʙᴀᴛɪᴍ ᴄᴏᴘɪᴇꜱ ᴏꜰ ᴛʜɪꜱ ʟɪᴄᴇɴꜱᴇ ᴅᴏᴄᴜᴍᴇɴᴛ, 𝗯𝘂𝘁 𝗰𝗵𝗮𝗻𝗴𝗶𝗻𝗴 𝗶𝘁 𝗶𝘀 𝗻𝗼𝘁 𝗮𝗹𝗹𝗼𝘄𝗲𝗱.
//•⬡• —••÷[ 𝓜𝖎𝖟𝖚ӄ𝖎™ ]÷••—  ᴡʜᴀᴛꜱᴀᴘᴘ ᴜꜱᴇʀʙᴏᴛ has been licensed under GNU General Public License
//•⬡• 𝐂𝐨𝐩𝐲𝐫𝐢𝐠𝐡𝐭 (𝐂) 𝟐𝟎𝟐𝟏 𝗞𝗿𝗮𝗸𝗶𝗻𝘇 | 𝗞𝗿𝗮𝗸𝗶𝗻𝘇𝗟𝗮𝗯 | 𝗞𝗿𝗮𝗸𝗶𝗻𝘇𝗕𝗼𝘁
//•⬡• 💡𝗠𝗮𝗱𝗲 𝗕𝘆 𝗔 𝗡𝗼𝗼𝗯 𝗳𝗼𝗿 𝗣𝗿𝗼𝘀💡
"⬡==================⬡-----------------⦿   𝐌𝐢𝐳𝐮𝐤𝐢™   ⦿-----------------⬡==================⬡";
const { MessageType, Mimetype } = require(`@adiwajshing/baileys`);
const _𝔏𝔞𝔟_ = require("./_𝔏𝔞𝔟_");
const fs = require(`fs`);
require("python-format-js");
var ᴋᴇɪᴇx = new RegExp(_𝔏𝔞𝔟_.FOXTROT, "g");
var ᴋᴇɪ = /\/\^\[(.*)+\]\/\g/g.exec(ᴋᴇɪᴇx)[1];
const { registerFont, createCanvas, loadImage } = require(`canvas`);
registerFont(`./𝓜𝖎𝖟𝖚ӄ𝖎🧀𝓒𝓻𝓪𝓽𝓮/Honeycomb-Round.otf`, {
  family: `Honeycomb`,
});
registerFont(`./𝓜𝖎𝖟𝖚ӄ𝖎🧀𝓒𝓻𝓪𝓽𝓮/LobsterTwo-Bold.ttf`, {
  family: `Lobster`,
});
registerFont(`./𝓜𝖎𝖟𝖚ӄ𝖎🧀𝓒𝓻𝓪𝓽𝓮/HousttelySignature-GOonZ.ttf`, {
  family: `Housttely`,
});
registerFont(`./𝓜𝖎𝖟𝖚ӄ𝖎🧀𝓒𝓻𝓪𝓽𝓮/AngelesPersonalUseItalic-2Odz8.ttf`, {
  family: `AngelesPersonalUseItalic`,
});
registerFont(`./𝓜𝖎𝖟𝖚ӄ𝖎🧀𝓒𝓻𝓪𝓽𝓮/KashmirrosyPersonaluse-X3qLd.otf`, {
  family: `KashmirrosyPersonaluse`,
});
var randomMC = require(`random-material-color`);
var dpl = {
    50: [
      "#FFEBEE",
      "#FCE4EC",
      "#F3E5F5",
      "#EDE7F6",
      "#E8EAF6",
      "#E3F2FD",
      "#E1F5FE",
      "#E0F7FA",
      "#E0F2F1",
      "#E8F5E9",
      "#F1F8E9",
      "#F9FBE7",
      "#FFFDE7",
      "#FFF8E1",
      "#FFF3E0",
      "#FBE9E7",
      "#EFEBE9",
      "#FAFAFA",
      "#ECEFF1",
    ],
    100: [
      "#FFCDD2",
      "#F8BBD0",
      "#E1BEE7",
      "#D1C4E9",
      "#C5CAE9",
      "#BBDEFB",
      "#B3E5FC",
      "#B2EBF2",
      "#B2DFDB",
      "#C8E6C9",
      "#DCEDC8",
      "#F0F4C3",
      "#FFF9C4",
      "#FFECB3",
      "#FFE0B2",
      "#FFCCBC",
      "#D7CCC8",
      "#F5F5F5",
      "#CFD8DC",
    ],
    200: [
      "#EF9A9A",
      "#F48FB1",
      "#CE93D8",
      "#B39DDB",
      "#9FA8DA",
      "#90CAF9",
      "#81D4FA",
      "#80DEEA",
      "#80CBC4",
      "#A5D6A7",
      "#C5E1A5",
      "#E6EE9C",
      "#FFF59D",
      "#FFE082",
      "#FFCC80",
      "#FFAB91",
      "#BCAAA4",
      "#EEEEEE",
      "#B0BEC5",
    ],
    300: [
      "#E57373",
      "#F06292",
      "#BA68C8",
      "#9575CD",
      "#7986CB",
      "#64B5F6",
      "#4FC3F7",
      "#4DD0E1",
      "#4DB6AC",
      "#81C784",
      "#AED581",
      "#DCE775",
      "#FFF176",
      "#FFD54F",
      "#FFB74D",
      "#FF8A65",
      "#A1887F",
      "#E0E0E0",
      "#90A4AE",
    ],
    400: [
      "#EF5350",
      "#EC407A",
      "#AB47BC",
      "#7E57C2",
      "#5C6BC0",
      "#42A5F5",
      "#29B6F6",
      "#26C6DA",
      "#26A69A",
      "#66BB6A",
      "#9CCC65",
      "#D4E157",
      "#FFEE58",
      "#FFCA28",
      "#FFA726",
      "#FF7043",
      "#8D6E63",
      "#BDBDBD",
      "#78909C",
    ],
    500: [
      "#F44336",
      "#E91E63",
      "#9C27B0",
      "#673AB7",
      "#3F51B5",
      "#2196F3",
      "#03A9F4",
      "#00BCD4",
      "#009688",
      "#4CAF50",
      "#8BC34A",
      "#CDDC39",
      "#FFEB3B",
      "#FFC107",
      "#FF9800",
      "#FF5722",
      "#795548",
      "#9E9E9E",
      "#607D8B",
    ],
    600: [
      "#E53935",
      "#D81B60",
      "#8E24AA",
      "#5E35B1",
      "#3949AB",
      "#1E88E5",
      "#039BE5",
      "#00ACC1",
      "#00897B",
      "#43A047",
      "#7CB342",
      "#C0CA33",
      "#FDD835",
      "#FFB300",
      "#FB8C00",
      "#F4511E",
      "#6D4C41",
      "#757575",
      "#546E7A",
    ],
    700: [
      "#D32F2F",
      "#C2185B",
      "#7B1FA2",
      "#512DA8",
      "#303F9F",
      "#1976D2",
      "#0288D1",
      "#0097A7",
      "#00796B",
      "#388E3C",
      "#689F38",
      "#AFB42B",
      "#FBC02D",
      "#FFA000",
      "#F57C00",
      "#E64A19",
      "#5D4037",
      "#616161",
      "#455A64",
    ],
    800: [
      "#C62828",
      "#AD1457",
      "#6A1B9A",
      "#4527A0",
      "#283593",
      "#1565C0",
      "#0277BD",
      "#00838F",
      "#00695C",
      "#2E7D32",
      "#558B2F",
      "#9E9D24",
      "#F9A825",
      "#FF8F00",
      "#EF6C00",
      "#D84315",
      "#4E342E",
      "#424242",
      "#37474F",
    ],
    900: [
      "#B71C1C",
      "#880E4F",
      "#4A148C",
      "#311B92",
      "#1A237E",
      "#0D47A1",
      "#01579B",
      "#006064",
      "#004D40",
      "#1B5E20",
      "#33691E",
      "#827717",
      "#F57F17",
      "#FF6F00",
      "#E65100",
      "#BF360C",
      "#3E2723",
      "#212121",
      "#263238",
    ],
    A100: [
      "#FF8A80",
      "#FF80AB",
      "#EA80FC",
      "#B388FF",
      "#8C9EFF",
      "#82B1FF",
      "#80D8FF",
      "#84FFFF",
      "#A7FFEB",
      "#B9F6CA",
      "#CCFF90",
      "#F4FF81",
      "#FFFF8D",
      "#FFE57F",
      "#FFD180",
      "#FF9E80",
    ],
    A200: [
      "#FF5252",
      "#FF4081",
      "#E040FB",
      "#7C4DFF",
      "#536DFE",
      "#448AFF",
      "#40C4FF",
      "#18FFFF",
      "#64FFDA",
      "#69F0AE",
      "#B2FF59",
      "#EEFF41",
      "#FFFF00",
      "#FFD740",
      "#FFAB40",
      "#FF6E40",
    ],
    A400: [
      "#FF1744",
      "#F50057",
      "#D500F9",
      "#651FFF",
      "#3D5AFE",
      "#2979FF",
      "#00B0FF",
      "#00E5FF",
      "#1DE9B6",
      "#00E676",
      "#76FF03",
      "#C6FF00",
      "#FFEA00",
      "#FFC400",
      "#FF9100",
      "#FF3D00",
    ],
    A700: [
      "#D50000",
      "#C51162",
      "#AA00FF",
      "#6200EA",
      "#304FFE",
      "#2962FF",
      "#0091EA",
      "#00B8D4",
      "#00BFA5",
      "#00C853",
      "#64DD17",
      "#AEEA00",
      "#FFD600",
      "#FFAB00",
      "#FF6D00",
      "#DD2C00",
    ],
  },
  murmur = require("murmurhash-js");
module.exports = (function () {
  var F = [],
    E = {
      shades: ["500"],
      palette: dpl,
      text: null,
      ignoreColors: [],
    },
    C = function (C) {
      C || (C = E),
        C.palette || (C.palette = dpl),
        C.shades || (C.shades = ["500"]);
      for (var B, D = F.length, t = 0; t < D; t++)
        if (C.text && F[t].text === C.text) return F[t].color;
      return (B = A(C)), C.text && F.push({ text: C.text, color: B }), B;
    },
    A = function (F) {
      var E = "",
        C = "";
      E = F.text
        ? F.shades[D(F.text, F.shades.length)]
        : F.shades[B(F.shades.length)];
      for (var A in F.palette)
        F.palette.hasOwnProperty(A) &&
          A === E &&
          (C = F.text
            ? F.palette[A][D(F.text, F.palette[A].length)]
            : F.palette[A][B(F.palette[A].length)]);
      return C;
    },
    B = function (F) {
      return Math.floor(Math.random() * F);
    },
    D = function (F, E) {
      var C = murmur.murmur3(F) / 1e10;
      return C < 0.1 && (C = 10 * C), Math.floor(C * E);
    };
  return { getColor: C };
})();
exports.nahargs = async (
  𝓚𝓻𝓪𝓴𝓲𝓷𝔃,
  chat,
  𝓜𝖎𝖟𝖚ӄ𝖎,
  𝓢𝓮𝓷𝓭𝓮𝓻𝓘𝓓,
  personsending,
  commandName,
  needs
) => {
  // ⬡==================⬡-----------------⦿𝐌𝐢𝐳𝐮𝐤𝐢™⦿-----------------⬡==================⬡
  ("-------------------- Canvas For No Arguments --------------------");
  const width = 1280;
  const height = 720;
  const canvas = createCanvas(width, height);
  const context = canvas.getContext("2d");
  context.fillStyle = "#252525";
  context.fillRect(0, 0, width, height);
  context.font = "bold 120pt KashmirrosyPersonaluse";
  context.textAlign = `center`;
  context.textBaseline = `top`;
  const text = "No Arguments!";
  const textWidth = context.measureText(text).width;
  context.fillRect(600 - textWidth / 2 - 10, 170 - 5, textWidth + 20, 120);
  context.fillStyle = randomMC.getColor();
  context.fillText(text, 600, 170);
  context.fillStyle = "#fff";
  context.font = "bold 80pt Honeycomb";
  context.fillText("Mizuki By KrakinzLab", 600, 530);
  loadImage("./𝓜𝖎𝖟𝖚ӄ𝖎🗑️𝓑𝓲𝓷/爪𝖎𝖟𝖚ӄ𝖎Noargs.png").then(async () => {
    const buffer = canvas.toBuffer("image/png");
    fs.writeFileSync("./𝓜𝖎𝖟𝖚ӄ𝖎🗑️𝓑𝓲𝓷/爪𝖎𝖟𝖚ӄ𝖎Noargs.png", buffer);
    await 𝓚𝓻𝓪𝓴𝓲𝓷𝔃.sendMessage(
      𝓜𝖎𝖟𝖚ӄ𝖎.chatId,
      {
        url: "./𝓜𝖎𝖟𝖚ӄ𝖎🗑️𝓑𝓲𝓷/爪𝖎𝖟𝖚ӄ𝖎Noargs.png",
      },
      MessageType.image,
      {
        quoted: chat,
        mimetype: Mimetype.png,
        contextInfo: { mentionedJid: [𝓢𝓮𝓷𝓭𝓮𝓻𝓘𝓓] },
        caption: `*©️𝘔𝘪𝘻𝘶𝘬𝘪𝘉𝘰𝘵 𝘉𝘺 𝘒𝘳𝘢𝘬𝘪𝘯𝘻𝘓𝘢𝘣 •••⬡*

𝘚𝘦𝘦𝘮𝘴 𝘓𝘪𝘬𝘦 @${personsending} 𝘍𝘰𝘳𝘨𝘰𝘵 𝘛𝘰 𝘎𝘪𝘷𝘦 𝘈𝘯𝘺 𝘈𝘳𝘨𝘶𝘮𝘦𝘯𝘵!

⬡---- 𝐂𝐨𝐦𝐦𝐚𝐧𝐝: ${ᴋᴇɪ}${commandName}
⬡---- 𝐔𝐬𝐚𝐠𝐞/𝐈𝐧𝐟𝐨: ${needs === undefined ? "null" : needs}`,
      }
    );
  });
};
("⬡==================⬡-----------------⦿   𝐌𝐢𝐳𝐮𝐤𝐢™   ⦿-----------------⬡==================⬡");
//•⬡• 😈𝗠𝗶𝘇𝘂𝗸𝗶 𝗪𝗵𝗮𝘁𝘀𝗮𝗽𝗽 𝗨𝘀𝗲𝗿𝗯𝗼𝘁😈
//•⬡• 🐙ᴀᴅᴠᴀɴᴄᴇᴅ ᴡʜᴀᴛꜱᴀᴘᴘ ᴜꜱᴇʀʙᴏᴛ ᴡɪᴛʜ 80+ ᴄᴏᴍᴍᴀɴᴅꜱ ꜰᴏʀ ʙᴏᴛʜ ᴘʀɪᴠᴀᴛᴇ ᴀɴᴅ ɢʀᴏᴜᴘ-ᴜꜱᴀɢᴇ🐙
//•⬡• ɢɴᴜ ɢᴇɴᴇʀᴀʟ ᴘᴜʙʟɪᴄ ʟɪᴄᴇɴꜱᴇ ᴠᴇʀꜱɪᴏɴ 3, 29 ᴊᴜɴᴇ 2007 ᴄᴏᴘʏʀɪɢʜᴛ (ᴄ) 2007 ꜰʀᴇᴇ ꜱᴏꜰᴛᴡᴀʀᴇ ꜰᴏᴜɴᴅᴀᴛɪᴏɴ
//•⬡• ᴇᴠᴇʀʏᴏɴᴇ ɪꜱ ᴘᴇʀᴍɪᴛᴛᴇᴅ ᴛᴏ 𝗰𝗼𝗽𝘆 𝗮𝗻𝗱 𝗱𝗶𝘀𝘁𝗿𝗶𝗯𝘂𝘁𝗲 ᴠᴇʀʙᴀᴛɪᴍ ᴄᴏᴘɪᴇꜱ ᴏꜰ ᴛʜɪꜱ ʟɪᴄᴇɴꜱᴇ ᴅᴏᴄᴜᴍᴇɴᴛ, 𝗯𝘂𝘁 𝗰𝗵𝗮𝗻𝗴𝗶𝗻𝗴 𝗶𝘁 𝗶𝘀 𝗻𝗼𝘁 𝗮𝗹𝗹𝗼𝘄𝗲𝗱.
//•⬡• —••÷[ 𝓜𝖎𝖟𝖚ӄ𝖎™ ]÷••—  ᴡʜᴀᴛꜱᴀᴘᴘ ᴜꜱᴇʀʙᴏᴛ has been licensed under GNU General Public License
//•⬡• 𝐂𝐨𝐩𝐲𝐫𝐢𝐠𝐡𝐭 (𝐂) 𝟐𝟎𝟐𝟏 𝗞𝗿𝗮𝗸𝗶𝗻𝘇 | 𝗞𝗿𝗮𝗸𝗶𝗻𝘇𝗟𝗮𝗯 | 𝗞𝗿𝗮𝗸𝗶𝗻𝘇𝗕𝗼𝘁
//•⬡• 💡𝗠𝗮𝗱𝗲 𝗕𝘆 𝗔 𝗡𝗼𝗼𝗯 𝗳𝗼𝗿 𝗣𝗿𝗼𝘀💡
("⬡==================⬡-----------------⦿   𝐌𝐢𝐳𝐮𝐤𝐢™   ⦿-----------------⬡==================⬡");
