// ⦿──────────────────────────────────────────────────────────────────⦿   𝐌𝐢𝐳𝐮𝐤𝐢™   ⦿-----------------⬡==================⬡`;
const { DataTypes } = require(`sequelize`);
const _𝔏𝔞𝔟_ = require(`./_𝔏𝔞𝔟_`);
const sequelize = _𝔏𝔞𝔟_.POSTQL;
const User = sequelize.define(
  `User`,
  {
    JID: {
      type: DataTypes.STRING,
      allowNull: false,
    },
  },
  {
    tableName: `Users`,
  }
);
// ⦿──────────────────────────────────────────────────────────────────⦿   𝐌𝐢𝐳𝐮𝐤𝐢™   ⦿-----------------⬡==================⬡`;
async function addUser(jid = null) {
  User.findOrCreate({
    where: {
      JID: jid,
    },
  });
}
// ⦿──────────────────────────────────────────────────────────────────⦿   𝐌𝐢𝐳𝐮𝐤𝐢™   ⦿-----------------⬡==================⬡`;
async function getUser(jid = null) {
  var Msg = await User.findAll({
    where: {
      JID: jid,
    },
  });

  if (Msg.length < 1) {
    return false;
  } else {
    return true;
  }
}
// ⦿──────────────────────────────────────────────────────────────────⦿   𝐌𝐢𝐳𝐮𝐤𝐢™   ⦿-----------------⬡==================⬡`;
module.exports = {
  User: User,
  addUser: addUser,
  getUser: getUser,
};
// ⦿──────────────────────────────────────────────────────────────────⦿   𝐌𝐢𝐳𝐮𝐤𝐢™   ⦿-----------------⬡==================⬡`;
