`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
`|                                                                                                                        |`;
`|        (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!            |`;
`|                                                                                                                        |`;
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
const ᴄᴏʀʟᴇxᴀ_Buttons = require(`../../ᴠʟᴋʏʀᴇ🕸️ʜᴏꜱᴛᴇʀ/ᴄᴏʀʟᴇxᴀ_Buttons`);
const ᴄᴏʀʟᴇxᴀ_Static = require(`../../ᴠʟᴋʏʀᴇ🕸️ʜᴏꜱᴛᴇʀ/ᴄᴏʀʟᴇxᴀ_Static`);
const { MessageType, Mimetype } = require(`@adiwajshing/baileys`);
const cleanRF = require(`../../ᴠʟᴋʏʀᴇ🕸️ʜᴏꜱᴛᴇʀ/cleanRF`);
const ꜰᴜᴄᴋ = require(`../../ᴠʟᴋʏʀᴇ🕸️ʜᴏꜱᴛᴇʀ/oShit`);
const speed = require(`performance-now`);
const _𝔏𝔞𝔟_ = require(`../../ᴠʟᴋʏʀᴇ🕸️ʜᴏꜱᴛᴇʀ/_𝔏𝔞𝔟_`);
var ᴋᴇɪᴇx = new RegExp(_𝔏𝔞𝔟_.FOXTROT, `g`);
var ᴋᴇɪ = /\/\^\[(.*)+\]\/\g/g.exec(ᴋᴇɪᴇx)[1];
const fs = require(`fs`);
var path = require(`path`);
var scriptName = path.basename(__filename);
var newScpt = scriptName.slice(0, -3).toLowerCase();
`|⬡════════════════════════════════════════════|   (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞  🛸  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛   |═══════════════════════════════════════════⬡|`;
module.exports = {
name: newScpt,
async handle(ӄ𝖗𝖆ӄ𝖎𝖓𝖟𝕷𝖆𝖇, chat, 𝖈𝖔𝖗𝖑𝖊𝖝𝖆, Needs, ꜱɪᴛʀᴀᴘ, Clock, Ping, Timers) {
try {
var աɦօֆɛռȶɦǟȶ = 𝖈𝖔𝖗𝖑𝖊𝖝𝖆.sender;
var աɦօֆɛռȶɦǟȶռʊʍ = աɦօֆɛռȶɦǟȶ
.substring(0, աɦօֆɛռȶɦǟȶ.length - 15)
.replace(/[+ ]/g, "");
const defaultnm = 𝖈𝖔𝖗𝖑𝖊𝖝𝖆.commandName;
const FinalName = defaultnm.charAt(0).toUpperCase() + defaultnm.slice(1);
`|⬡════════════════════════════════════════════|   (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞  🛸  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛   |═══════════════════════════════════════════⬡|`;
const hold = require("../../ᴠʟᴋʏʀᴇ🕸️ʜᴏꜱᴛᴇʀ/Hold");
await hold.Hold(𝖈𝖔𝖗𝖑𝖊𝖝𝖆);
`|⬡════════════════════════════════════════════|   (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞  🛸  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛   |═══════════════════════════════════════════⬡|`;
return ᴄᴏʀʟᴇxᴀ_Buttons.MIB(
ӄ𝖗𝖆ӄ𝖎𝖓𝖟𝕷𝖆𝖇,
chat,
𝖈𝖔𝖗𝖑𝖊𝖝𝖆,
`🪶 𝐇𝐞𝐲: •@${աɦօֆɛռȶɦǟȶռʊʍ}, ${Timers}
🛸𝐕𝐥𝐤𝐲𝐫𝐞: _ɪꜱ ᴀ ᴡʜᴀᴛꜱᴀᴘᴘ ᴍᴜʟᴛɪᴘᴜʀᴘᴏꜱᴇ-ᴜꜱᴇʀʙᴏᴛ ᴡɪᴛʜ ᴍᴏᴅᴇʀᴀᴛɪᴏɴ,ᴀᴜᴛᴏᴍᴀᴛɪᴏɴ ᴀɴᴅ 100+ ᴄᴏᴍᴍᴀɴᴅꜱ!_

╔════◇🍣 𝐀𝐧𝐢𝐦𝐞
║
║• *${ᴋᴇɪ}anime:*  _search any anime_
║• *${ᴋᴇɪ}ranimewall:*  _get random anime wallpaper_
║• *${ᴋᴇɪ}smile:*  _@tag or reply_ 
║• *${ᴋᴇɪ}yes:*  _@tag or reply_
║• *${ᴋᴇɪ}bite:*  _@tag or reply_
║• *${ᴋᴇɪ}blush:*  _@tag or reply_
║• *${ᴋᴇɪ}bored:*  _@tag or reply_
║• *${ᴋᴇɪ}confused:*  _@tag or reply_
║• *${ᴋᴇɪ}cry:*  _@tag or reply_
║• *${ᴋᴇɪ}goodnight:*  _@tag or reply_
║• *${ᴋᴇɪ}happy:*  _@tag or reply_
║• *${ᴋᴇɪ}hi5:*  _@tag or reply_
║• *${ᴋᴇɪ}poke:*  _@tag or reply_
║• *${ᴋᴇɪ}sad:*  _@tag or reply_
║• *${ᴋᴇɪ}thinking:*  _@tag or reply_
║• *${ᴋᴇɪ}cuddle:*  _@tag or reply_
║• *${ᴋᴇɪ}hug:*  _@tag or reply_
║• *${ᴋᴇɪ}pat:*  _@tag or reply_
║• *${ᴋᴇɪ}slap:*  _@tag or reply_ 
║• *${ᴋᴇɪ}wink:*  _@tag or reply_
║• *${ᴋᴇɪ}angry:*  _@tag or reply_
║• *${ᴋᴇɪ}baka:*  _@tag or reply_
║• *${ᴋᴇɪ}bonk:*  _@tag or reply_
║• *${ᴋᴇɪ}bully:*  _@tag or reply_
║• *${ᴋᴇɪ}bye:*  _@tag or reply_
║• *${ᴋᴇɪ}chase:*  _@tag or reply_
║• *${ᴋᴇɪ}cheer:*  _@tag or reply_
║• *${ᴋᴇɪ}cringe:*  _@tag or reply_
║• *${ᴋᴇɪ}dab:*  _@tag or reply_
║• *${ᴋᴇɪ}dance:*  _@tag or reply_
║• *${ᴋᴇɪ}die:*  _@tag or reply_
║• *${ᴋᴇɪ}facepalm:*  _@tag or reply_
║• *${ᴋᴇɪ}feed:*  _@tag or reply_
║• *${ᴋᴇɪ}glomp:*  _@tag or reply_
║• *${ᴋᴇɪ}hold:*  _@tag or reply_
║• *${ᴋᴇɪ}hate:*  _@tag or reply_
║• *${ᴋᴇɪ}hi:*  _@tag or reply_
║• *${ᴋᴇɪ}kill:*  _@tag or reply_
║• *${ᴋᴇɪ}laugh:*  _@tag or reply_
║• *${ᴋᴇɪ}lick:*  _@tag or reply_
║• *${ᴋᴇɪ}love:*  _@tag or reply_
║• *${ᴋᴇɪ}lurk:*  _@tag or reply_
║• *${ᴋᴇɪ}nervous:*  _@tag or reply_
║• *${ᴋᴇɪ}nope:*  _@tag or reply_
║• *${ᴋᴇɪ}nom:*  _@tag or reply_
║• *${ᴋᴇɪ}nuzzle:*  _@tag or reply_
║• *${ᴋᴇɪ}panic:*  _@tag or reply_
║• *${ᴋᴇɪ}peck:*  _@tag or reply_
║• *${ᴋᴇɪ}poke:*  _@tag or reply_
║• *${ᴋᴇɪ}pout:*  _@tag or reply_
║• *${ᴋᴇɪ}run:*  _@tag or reply_
║• *${ᴋᴇɪ}sip:*  _@tag or reply_
║• *${ᴋᴇɪ}shoot:*  _@tag or reply_
║• *${ᴋᴇɪ}shrug:*  _@tag or reply_
║• *${ᴋᴇɪ}sleep:*  _@tag or reply_
║• *${ᴋᴇɪ}smug:*  _@tag or reply_
║• *${ᴋᴇɪ}stab:*  _@tag or reply_
║• *${ᴋᴇɪ}stare:*  _@tag or reply_
║• *${ᴋᴇɪ}tease:*  _@tag or reply_
║• *${ᴋᴇɪ}tickle:*  _@tag or reply_
║• *${ᴋᴇɪ}thumbsup:*  _@tag or reply_
║• *${ᴋᴇɪ}wag:*  _@tag or reply_
╚════════════╝`,
`./ᴠʟᴋʀᴇ🔌cord/𝖈𝖔𝖗𝖑𝖊𝖝𝖆.png`
);
} catch (Error) {
ꜰᴜᴄᴋ.catch(Error, ӄ𝖗𝖆ӄ𝖎𝖓𝖟𝕷𝖆𝖇, 𝖈𝖔𝖗𝖑𝖊𝖝𝖆, chat);
return;
}
},
};
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
`|                                                                                                                        |`;
`|        (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!            |`;
`|                                                                                                                        |`;
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
