("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");

//▷                                              (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!                                           ◁

("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
require(`../Vlkyre🖋️Utilities/𝕷𝖆ყO𝖚𝖙`);
require(`../Vlkyre🖋️Utilities/Ѷ𝖆𝖑.js`);
let { smsg } = require(`../Vlkyre🖋️Utilities/ɴᴇᴄᴛᴏʀ`);
let messages_upsert = async (chatUpdate, Ѷ𝖎𝖔𝖓, 𝖍𝖆𝖜ӄ) => {
try {
𝖈𝖍𝖆𝖙 = chatUpdate.messages[0];
if (!𝖈𝖍𝖆𝖙.message) return;
𝖈𝖍𝖆𝖙.message =
Object.keys(𝖈𝖍𝖆𝖙.message)[0] === `ephemeralMessage`
? 𝖈𝖍𝖆𝖙.message.ephemeralMessage.message
: 𝖈𝖍𝖆𝖙.message;
if (𝖈𝖍𝖆𝖙.key && 𝖈𝖍𝖆𝖙.key.remoteJid === `status@broadcast`) return;
if (!𝖍𝖆𝖜ӄ.public && !𝖈𝖍𝖆𝖙.key.fromMe && chatUpdate.type === `notify`)
return;
if (𝖈𝖍𝖆𝖙.key.id.startsWith(`BAE5`) && 𝖈𝖍𝖆𝖙.key.id.length === 16) return;
𝐕𝐥𝐤𝐲𝐫𝐞 = await smsg(𝖍𝖆𝖜ӄ, 𝖈𝖍𝖆𝖙, Ѷ𝖎𝖔𝖓);
require(`../Vlkyre🖋️Utilities/Ѷ𝖆𝖑.js`)(𝖍𝖆𝖜ӄ, 𝐕𝐥𝐤𝐲𝐫𝐞, chatUpdate, Ѷ𝖎𝖔𝖓);
} catch (err) {
console.log(err);
}
};
module.exports = {
Vmsgup: messages_upsert,
};
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");

//▷                                              (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!                                           ◁

("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
