`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
function _0x2a66(_0x423ad3, _0x33c8af) {
const _0x4b8f55 = _0x4b8f();
return (
(_0x2a66 = function (_0x2a668e, _0x43647b) {
_0x2a668e = _0x2a668e - 0x1ba;
let _0x1aa002 = _0x4b8f55[_0x2a668e];
return _0x1aa002;
}),
_0x2a66(_0x423ad3, _0x33c8af)
);
}
function _0x4b8f() {
const _0x1d1205 = [
"red",
"🕐𝐓𝐢𝐦𝐞:\x20",
"bgGreen",
"log",
"bgWhite",
"Private\x20Chat",
"⚡𝐢𝐬𝐒𝐞𝐧𝐝𝐞𝐫𝐓𝐔𝐅:\x20",
"2135378hHlMGQ",
"522261eADszR",
"1034iGxNsU",
"green",
"chatID",
"51550gFHBRC",
"{\x0aᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ\x20ʙʏ\x20ᴋʀᴀᴋɪɴᴢʟᴀʙ™\x0a}",
"groupMetadata",
"blue",
"bgCyanBright",
"black",
"subject",
"sendReadReceipt",
"120SosHRO",
"sender",
"No_Name",
"❗𝐢𝐬𝐒𝐞𝐧𝐝𝐞𝐫𝐀𝐝𝐦𝐢𝐧:\x20",
"153634BXwmDy",
"🧀𝐆𝐫𝐨𝐮𝐩𝐍𝐚𝐦𝐞:\x20",
"💤𝐂𝐨𝐦𝐦𝐚𝐧𝐝:\x20",
"1QHlVkf",
"644yZVgvP",
"commandName",
"isGroup",
"🧛🏽‍♂️𝐒𝐞𝐧𝐝𝐞𝐫𝐍𝐚𝐦𝐞:\x20",
"pushName",
"942UgLJAS",
"1815960ZpKeey",
"🥷𝐒𝐞𝐧𝐝𝐞𝐫:\x20",
"key",
"|⬡════════════════════════════════════════════════════════════|▷\x20\x20\x20ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ\x20ʙʏ\x20ᴋʀᴀᴋɪɴᴢʟᴀʙ™\x20\x20◁|════════════════════════════════════════════════════════════⬡|",
"▷═════════════════════|✠|═════════════════════◁",
"clear",
"bgYellowBright",
"27276rZtsFH",
];
_0x4b8f = function () {
return _0x1d1205;
};
return _0x4b8f();
}
(function (_0x30f536, _0x48de57) {
const _0x1eb00d = _0x2a66,
_0x165668 = _0x30f536();
while (!![]) {
try {
const _0x2ed616 =
(-parseInt(_0x1eb00d(0x1c6)) / 0x1) *
(parseInt(_0x1eb00d(0x1c3)) / 0x2) +
(parseInt(_0x1eb00d(0x1cc)) / 0x3) *
(parseInt(_0x1eb00d(0x1c7)) / 0x4) +
(parseInt(_0x1eb00d(0x1bf)) / 0x5) *
(-parseInt(_0x1eb00d(0x1d4)) / 0x6) +
-parseInt(_0x1eb00d(0x1dc)) / 0x7 +
parseInt(_0x1eb00d(0x1cd)) / 0x8 +
-parseInt(_0x1eb00d(0x1dd)) / 0x9 +
(-parseInt(_0x1eb00d(0x1e1)) / 0xa) *
(-parseInt(_0x1eb00d(0x1de)) / 0xb);
if (_0x2ed616 === _0x48de57) break;
else _0x165668["push"](_0x165668["shift"]());
} catch (_0x368309) {
_0x165668["push"](_0x165668["shift"]());
}
}
})(_0x4b8f, 0x3407b),
require("../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/𝕷𝖆ყO𝖚𝖙"),
(exports["BeutyFly"] = async (_0x3091c1, _0x2c6cf6, _0x1522bf) => {
const _0x33d70 = _0x2a66;
console[_0x33d70(0x1d8)](_0x1522bf["red"](_0x33d70(0x1d1))),
console["log"](
_0x1522bf[_0x33d70(0x1bc)](_0x1522bf[_0x33d70(0x1d9)](_0x33d70(0x1d6))),
_0x1522bf[_0x33d70(0x1bc)](_0x1522bf[_0x33d70(0x1d7)](new Date()))
),
console[_0x33d70(0x1d8)](
_0x1522bf[_0x33d70(0x1d3)](_0x33d70(0x1c5)),
_0x1522bf[_0x33d70(0x1bc)](
_0x1522bf[_0x33d70(0x1ba)](_0x2c6cf6[_0x33d70(0x1c8)] || "")
)
),
console[_0x33d70(0x1d8)](
_0x1522bf[_0x33d70(0x1bb)]("🖋️𝐂𝐨𝐧𝐭𝐞𝐧𝐭:\x20"),
_0x1522bf[_0x33d70(0x1df)](
_0x2c6cf6[_0x33d70(0x1c9)]
? _0x2c6cf6[_0x33d70(0x1cb)]
: _0x33d70(0x1da),
_0x2c6cf6["chatID"]
)
),
console["log"](
_0x1522bf[_0x33d70(0x1bb)](_0x33d70(0x1ce)),
_0x1522bf[_0x33d70(0x1df)](_0x2c6cf6[_0x33d70(0x1c0)])
),
console[_0x33d70(0x1d8)](
_0x1522bf[_0x33d70(0x1bb)](_0x33d70(0x1ca)),
_0x1522bf["green"](_0x2c6cf6[_0x33d70(0x1cb)] || _0x33d70(0x1c1))
),
_0x33d70(0x1d0),
await _0x3091c1[_0x33d70(0x1be)](
_0x2c6cf6[_0x33d70(0x1e0)],
_0x2c6cf6[_0x33d70(0x1c0)],
[_0x2c6cf6[_0x33d70(0x1cf)]["id"]]
),
console[_0x33d70(0x1d8)](_0x33d70(0x1c2), _0x2c6cf6["isSenderAdmin"]),
console[_0x33d70(0x1d8)](_0x33d70(0x1db), _0x2c6cf6["isSenderTUF"]);
let _0x6ee35f = await _0x2c6cf6[_0x33d70(0x1e3)];
console[_0x33d70(0x1d8)](_0x33d70(0x1c4), _0x6ee35f[_0x33d70(0x1bd)] || ""),
HEROKU === undefined &&
(console[_0x33d70(0x1d2)](), console["log"](_0x2c6cf6)),
console["log"](_0x1522bf[_0x33d70(0x1d5)](_0x33d70(0x1d1))),
console[_0x33d70(0x1d8)](_0x33d70(0x1e2));
});
`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;