`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
function _0xc3d2() {
const _0x598868 = [
"789204fzZuoj",
"messages",
"startsWith",
"5qgnQbX",
"status@broadcast",
"message",
"4366070UVJAPa",
"../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/Ѷ𝖆𝖑.js",
"exports",
"3724126gyiMtw",
"../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/𝕷𝖆ყO𝖚𝖙",
"log",
"../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/ɴᴇᴄᴛᴏʀ",
"BAE5",
"8QxOXRD",
"1942khMyBy",
"353568MrrnWJ",
"remoteJid",
"key",
"1577252TmdhrM",
"783918EVDkiV",
"notify",
"370mlzgVx",
"length",
"fromMe",
];
_0xc3d2 = function () {
return _0x598868;
};
return _0xc3d2();
}
const _0x5bc2ae = _0x4328;
(function (_0x364192, _0x519cca) {
const _0x55a6dc = _0x4328,
_0x5b7fdb = _0x364192();
while (!![]) {
try {
const _0x32b265 =
(-parseInt(_0x55a6dc(0x18d)) / 0x1) *
(parseInt(_0x55a6dc(0x19f)) / 0x2) +
parseInt(_0x55a6dc(0x187)) / 0x3 +
parseInt(_0x55a6dc(0x18a)) / 0x4 +
(parseInt(_0x55a6dc(0x193)) / 0x5) *
(parseInt(_0x55a6dc(0x190)) / 0x6) +
-parseInt(_0x55a6dc(0x199)) / 0x7 +
(-parseInt(_0x55a6dc(0x19e)) / 0x8) *
(-parseInt(_0x55a6dc(0x18b)) / 0x9) +
parseInt(_0x55a6dc(0x196)) / 0xa;
if (_0x32b265 === _0x519cca) break;
else _0x5b7fdb["push"](_0x5b7fdb["shift"]());
} catch (_0x1daa52) {
_0x5b7fdb["push"](_0x5b7fdb["shift"]());
}
}
})(_0xc3d2, 0x4369c),
require(_0x5bc2ae(0x19a)),
require(_0x5bc2ae(0x197));
let { smsg } = require(_0x5bc2ae(0x19c)),
messages_upsert = async (_0x507f11, _0xfd1a15, _0x357f27) => {
const _0x416b64 = _0x5bc2ae;
try {
𝖈𝖍𝖆𝖙 = _0x507f11[_0x416b64(0x191)][0x0];
if (!𝖈𝖍𝖆𝖙[_0x416b64(0x195)]) return;
𝖈𝖍𝖆𝖙[_0x416b64(0x195)] =
Object["keys"](𝖈𝖍𝖆𝖙["message"])[0x0] === "ephemeralMessage"
? 𝖈𝖍𝖆𝖙[_0x416b64(0x195)]["ephemeralMessage"][_0x416b64(0x195)]
: 𝖈𝖍𝖆𝖙[_0x416b64(0x195)];
if (
𝖈𝖍𝖆𝖙[_0x416b64(0x189)] &&
𝖈𝖍𝖆𝖙[_0x416b64(0x189)][_0x416b64(0x188)] === _0x416b64(0x194)
)
return;
if (
!_0x357f27["public"] &&
!𝖈𝖍𝖆𝖙[_0x416b64(0x189)][_0x416b64(0x18f)] &&
_0x507f11["type"] === _0x416b64(0x18c)
)
return;
if (
𝖈𝖍𝖆𝖙["key"]["id"][_0x416b64(0x192)](_0x416b64(0x19d)) &&
𝖈𝖍𝖆𝖙["key"]["id"][_0x416b64(0x18e)] === 0x10
)
return;
(Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊 = await smsg(_0x357f27, 𝖈𝖍𝖆𝖙, _0xfd1a15)),
require(_0x416b64(0x197))(_0x357f27, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, _0x507f11, _0xfd1a15);
} catch (_0x47ac80) {
console[_0x416b64(0x19b)](_0x47ac80);
}
};
function _0x4328(_0x2ba252, _0x245676) {
const _0xc3d25e = _0xc3d2();
return (
(_0x4328 = function (_0x43282e, _0x55776b) {
_0x43282e = _0x43282e - 0x187;
let _0x554efd = _0xc3d25e[_0x43282e];
return _0x554efd;
}),
_0x4328(_0x2ba252, _0x245676)
);
}
module[_0x5bc2ae(0x198)] = { Vmsgup: messages_upsert };
`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;