`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
const _0x1e661e = _0x34dd;
function _0x1bc8() {
const _0x41c127 = [
"11675370JscNfu",
"mongoose",
"111363yEIJMy",
"187zwUaZJ",
"172JyMmrL",
"1wTuXdn",
"565702vUIOTa",
"Autorank",
"6136659sQgzGF",
"342vJvFYx",
"8QIdTZZ",
"485631bBQucv",
"Schema",
"51740iLWVml",
"1224024hPtyeS",
];
_0x1bc8 = function () {
return _0x41c127;
};
return _0x1bc8();
}
(function (_0xf5125, _0x37af2c) {
const _0x207cd6 = _0x34dd,
_0x33db8d = _0xf5125();
while (!![]) {
try {
const _0x227102 =
(-parseInt(_0x207cd6(0xbc)) / 0x1) *
(-parseInt(_0x207cd6(0xbd)) / 0x2) +
parseInt(_0x207cd6(0xc2)) / 0x3 +
(parseInt(_0x207cd6(0xbb)) / 0x4) * (-parseInt(_0x207cd6(0xc4)) / 0x5) +
(-parseInt(_0x207cd6(0xc0)) / 0x6) *
(-parseInt(_0x207cd6(0xb9)) / 0x7) +
(-parseInt(_0x207cd6(0xc1)) / 0x8) * (parseInt(_0x207cd6(0xbf)) / 0x9) +
-parseInt(_0x207cd6(0xb7)) / 0xa +
(parseInt(_0x207cd6(0xba)) / 0xb) * (parseInt(_0x207cd6(0xc5)) / 0xc);
if (_0x227102 === _0x37af2c) break;
else _0x33db8d["push"](_0x33db8d["shift"]());
} catch (_0x25d7ae) {
_0x33db8d["push"](_0x33db8d["shift"]());
}
}
})(_0x1bc8, 0xc12b7);
let mongoose = require(_0x1e661e(0xb8)),
AutorankSchema = new mongoose[_0x1e661e(0xc3)]({ serverID: String });
function _0x34dd(_0x400b20, _0x245333) {
const _0x1bc891 = _0x1bc8();
return (
(_0x34dd = function (_0x34ddce, _0x44dba8) {
_0x34ddce = _0x34ddce - 0xb7;
let _0x9281b9 = _0x1bc891[_0x34ddce];
return _0x9281b9;
}),
_0x34dd(_0x400b20, _0x245333)
);
}
module["exports"] = mongoose["model"](_0x1e661e(0xbe), AutorankSchema);
`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
