`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
const _0x54865f = _0x1028;
function _0x454f() {
const _0x5d1dfa = [
"42jowMsY",
"1472367aEVeoQ",
"Cooldown",
"27978318FfozBL",
"10270408jzJfLM",
"exports",
"1132565xpCsKi",
"45004GrSebN",
"6626956NkJZys",
"model",
"4125032mGHHVU",
"39AyyZNW",
];
_0x454f = function () {
return _0x5d1dfa;
};
return _0x454f();
}
(function (_0x571665, _0x108d94) {
const _0x396bbb = _0x1028,
_0x363cde = _0x571665();
while (!![]) {
try {
const _0x2fa319 =
parseInt(_0x396bbb(0xb8)) / 0x1 +
(parseInt(_0x396bbb(0xb2)) / 0x2) * (parseInt(_0x396bbb(0xb6)) / 0x3) +
parseInt(_0x396bbb(0xb5)) / 0x4 +
(parseInt(_0x396bbb(0xb1)) / 0x5) * (parseInt(_0x396bbb(0xb7)) / 0x6) +
parseInt(_0x396bbb(0xb3)) / 0x7 +
-parseInt(_0x396bbb(0xbb)) / 0x8 +
-parseInt(_0x396bbb(0xba)) / 0x9;
if (_0x2fa319 === _0x108d94) break;
else _0x363cde["push"](_0x363cde["shift"]());
} catch (_0x20a76b) {
_0x363cde["push"](_0x363cde["shift"]());
}
}
})(_0x454f, 0xe480b);
function _0x1028(_0x59ee63, _0x1bf925) {
const _0x454f45 = _0x454f();
return (
(_0x1028 = function (_0x102833, _0x52c118) {
_0x102833 = _0x102833 - 0xb0;
let _0x4139a8 = _0x454f45[_0x102833];
return _0x4139a8;
}),
_0x1028(_0x59ee63, _0x1bf925)
);
}
let mongoose = require("mongoose"),
CooldownSchema = new mongoose["Schema"]({ ID: String, Duration: Number });
module[_0x54865f(0xb0)] = mongoose[_0x54865f(0xb4)](
_0x54865f(0xb9),
CooldownSchema
);
`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
