`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
const _0xd7afa3 = _0x181a;
(function (_0x2f35ee, _0x147f15) {
const _0x50aeaf = _0x181a,
_0x254563 = _0x2f35ee();
while (!![]) {
try {
const _0x106bee =
(-parseInt(_0x50aeaf(0xf0)) / 0x1) * (parseInt(_0x50aeaf(0xf2)) / 0x2) +
-parseInt(_0x50aeaf(0xfa)) / 0x3 +
parseInt(_0x50aeaf(0xf7)) / 0x4 +
-parseInt(_0x50aeaf(0xf1)) / 0x5 +
(parseInt(_0x50aeaf(0xee)) / 0x6) * (parseInt(_0x50aeaf(0xf9)) / 0x7) +
(parseInt(_0x50aeaf(0xef)) / 0x8) * (parseInt(_0x50aeaf(0xf4)) / 0x9) +
parseInt(_0x50aeaf(0xf3)) / 0xa;
if (_0x106bee === _0x147f15) break;
else _0x254563["push"](_0x254563["shift"]());
} catch (_0x5f1308) {
_0x254563["push"](_0x254563["shift"]());
}
}
})(_0x3a8c, 0x7735e);
function _0x181a(_0x23a543, _0x3deefa) {
const _0x3a8c05 = _0x3a8c();
return (
(_0x181a = function (_0x181a98, _0x2264e0) {
_0x181a98 = _0x181a98 - 0xee;
let _0x955558 = _0x3a8c05[_0x181a98];
return _0x955558;
}),
_0x181a(_0x23a543, _0x3deefa)
);
}
function _0x3a8c() {
const _0x4193df = [
"141BkzXFM",
"3657435KjBHMF",
"12524SPdzEg",
"17173660RxdVsh",
"899082lDAZXm",
"model",
"mongoose",
"980752xkxUOS",
"exports",
"2632294SVljUp",
"2135463nvFKBV",
"12LumFbf",
"8kyBFIC",
];
_0x3a8c = function () {
return _0x4193df;
};
return _0x3a8c();
}
let mongoose = require(_0xd7afa3(0xf6)),
HaltSchema = new mongoose["Schema"]({
ID: String,
TimeOut: Number,
PermaTimeOut: Number,
});
module[_0xd7afa3(0xf8)] = mongoose[_0xd7afa3(0xf5)]("Halt", HaltSchema);
`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
