("|⬡═════════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|════════════════════════════════════════════════⬡|");
/* 
(𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
("|⬡═════════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|════════════════════════════════════════════════⬡|");
const _0x8b402 = _0x2b0b;
(function (_0x2b67d9, _0x2329ef) {
const _0x38791f = _0x2b0b,
_0x515d18 = _0x2b67d9();
while (!![]) {
try {
const _0x1e8cf8 =
-parseInt(_0x38791f(0x1e1)) / 0x1 +
(-parseInt(_0x38791f(0x1e6)) / 0x2) *
(parseInt(_0x38791f(0x1eb)) / 0x3) +
(parseInt(_0x38791f(0x1e5)) / 0x4) *
(-parseInt(_0x38791f(0x1e0)) / 0x5) +
(parseInt(_0x38791f(0x1ec)) / 0x6) *
(-parseInt(_0x38791f(0x1e8)) / 0x7) +
parseInt(_0x38791f(0x1e4)) / 0x8 +
-parseInt(_0x38791f(0x1e2)) / 0x9 +
parseInt(_0x38791f(0x1ea)) / 0xa;
if (_0x1e8cf8 === _0x2329ef) break;
else _0x515d18["push"](_0x515d18["shift"]());
} catch (_0xbf3620) {
_0x515d18["push"](_0x515d18["shift"]());
}
}
})(_0xe250, 0xa2c38);
function _0xe250() {
const _0x30f2c2 = [
"25032270nNeGiI",
"1071BEIiCt",
"6mUwmXQ",
"model",
"5yczWNi",
"997929kMCjbx",
"2472867NqYKtk",
"Schema",
"8886760eMCgBx",
"2460968xeZfUa",
"2530RAScaU",
"NSFW",
"4254971qRvAdH",
"mongoose",
];
_0xe250 = function () {
return _0x30f2c2;
};
return _0xe250();
}
let mongoose = require(_0x8b402(0x1e9)),
NSFWSchema = new mongoose[_0x8b402(0x1e3)]({
serverID: String,
value: String,
});
function _0x2b0b(_0x518ee0, _0x3acb94) {
const _0xe250b1 = _0xe250();
return (
(_0x2b0b = function (_0x2b0be6, _0x54ce70) {
_0x2b0be6 = _0x2b0be6 - 0x1df;
let _0x9ec919 = _0xe250b1[_0x2b0be6];
return _0x9ec919;
}),
_0x2b0b(_0x518ee0, _0x3acb94)
);
}
module["exports"] = mongoose[_0x8b402(0x1df)](_0x8b402(0x1e7), NSFWSchema);
("|⬡═════════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|════════════════════════════════════════════════⬡|");
/* 
(𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
("|⬡═════════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|════════════════════════════════════════════════⬡|");
