("|⬡═════════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|════════════════════════════════════════════════⬡|");
/* 
(𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
("|⬡═════════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|════════════════════════════════════════════════⬡|");
function _0x5a5c() {
const _0x1b605e = [
"828921SXirEG",
"343805okWArT",
"922652upghgc",
"7iRsBuK",
"Private",
"model",
"147746RtsdnC",
"2097432TVpXif",
"2KoxTCY",
"exports",
"588339TBrMMR",
"mongoose",
"1397664gRYwJC",
];
_0x5a5c = function () {
return _0x1b605e;
};
return _0x5a5c();
}
const _0x1681c0 = _0x1d1f;
function _0x1d1f(_0x26682b, _0x2cb98f) {
const _0x5a5c5e = _0x5a5c();
return (
(_0x1d1f = function (_0x1d1f0f, _0x4e1bd3) {
_0x1d1f0f = _0x1d1f0f - 0xdd;
let _0x4ff976 = _0x5a5c5e[_0x1d1f0f];
return _0x4ff976;
}),
_0x1d1f(_0x26682b, _0x2cb98f)
);
}
(function (_0x5d1296, _0xe036e0) {
const _0x1b29f0 = _0x1d1f,
_0x75a0c9 = _0x5d1296();
while (!![]) {
try {
const _0x548814 =
parseInt(_0x1b29f0(0xe2)) / 0x1 +
(parseInt(_0x1b29f0(0xe4)) / 0x2) * (parseInt(_0x1b29f0(0xe9)) / 0x3) +
-parseInt(_0x1b29f0(0xde)) / 0x4 +
parseInt(_0x1b29f0(0xdd)) / 0x5 +
parseInt(_0x1b29f0(0xe8)) / 0x6 +
(parseInt(_0x1b29f0(0xdf)) / 0x7) * (-parseInt(_0x1b29f0(0xe3)) / 0x8) +
-parseInt(_0x1b29f0(0xe6)) / 0x9;
if (_0x548814 === _0xe036e0) break;
else _0x75a0c9["push"](_0x75a0c9["shift"]());
} catch (_0x373708) {
_0x75a0c9["push"](_0x75a0c9["shift"]());
}
}
})(_0x5a5c, 0x28e79);
let mongoose = require(_0x1681c0(0xe7)),
PrivateSchema = new mongoose["Schema"]({ ID: String, Amount: Number });
module[_0x1681c0(0xe5)] = mongoose[_0x1681c0(0xe1)](
_0x1681c0(0xe0),
PrivateSchema
);
("|⬡═════════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|════════════════════════════════════════════════⬡|");
/* 
(𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
("|⬡═════════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|════════════════════════════════════════════════⬡|");
