("|⬡═════════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|════════════════════════════════════════════════⬡|");
/* 
(𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
("|⬡═════════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|════════════════════════════════════════════════⬡|");
function _0x76de() {
const _0xb598b9 = [
"1265WcHNCE",
"model",
"116116NKTtmj",
"4kWhcYm",
"26624WcQrPo",
"1502457KaOqpy",
"Schema",
"ServerDB",
"2208qqCKwD",
"124328xsUMMS",
"exports",
"mongoose",
"111351ESDCGO",
"27760FMYgdq",
"1ergRtm",
"135Sxejdp",
"12RSaLrw",
];
_0x76de = function () {
return _0xb598b9;
};
return _0x76de();
}
function _0xa433(_0x4e4e9e, _0x23330a) {
const _0x76dec9 = _0x76de();
return (
(_0xa433 = function (_0xa43355, _0x14f552) {
_0xa43355 = _0xa43355 - 0x110;
let _0x18aef3 = _0x76dec9[_0xa43355];
return _0x18aef3;
}),
_0xa433(_0x4e4e9e, _0x23330a)
);
}
const _0x2fd01a = _0xa433;
(function (_0x655f82, _0x905300) {
const _0x3aa709 = _0xa433,
_0x411ec1 = _0x655f82();
while (!![]) {
try {
const _0x572f00 =
(-parseInt(_0x3aa709(0x119)) / 0x1) *
(-parseInt(_0x3aa709(0x114)) / 0x2) +
(-parseInt(_0x3aa709(0x117)) / 0x3) *
(parseInt(_0x3aa709(0x11f)) / 0x4) +
(parseInt(_0x3aa709(0x11c)) / 0x5) *
(-parseInt(_0x3aa709(0x113)) / 0x6) +
parseInt(_0x3aa709(0x11e)) / 0x7 +
parseInt(_0x3aa709(0x120)) / 0x8 +
(parseInt(_0x3aa709(0x11a)) / 0x9) *
(parseInt(_0x3aa709(0x118)) / 0xa) +
(-parseInt(_0x3aa709(0x110)) / 0xb) *
(-parseInt(_0x3aa709(0x11b)) / 0xc);
if (_0x572f00 === _0x905300) break;
else _0x411ec1["push"](_0x411ec1["shift"]());
} catch (_0x125088) {
_0x411ec1["push"](_0x411ec1["shift"]());
}
}
})(_0x76de, 0x1fc26);
let mongoose = require(_0x2fd01a(0x116)),
ServerDBSchema = new mongoose[_0x2fd01a(0x111)]({ ServerID: String });
module[_0x2fd01a(0x115)] = mongoose[_0x2fd01a(0x11d)](
_0x2fd01a(0x112),
ServerDBSchema
);
("|⬡═════════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|════════════════════════════════════════════════⬡|");
/* 
(𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
("|⬡═════════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|════════════════════════════════════════════════⬡|");
