`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
const _0x16de64 = _0x27f8;
(function (_0x172b1b, _0x4874e5) {
const _0x549aaa = _0x27f8,
_0x1a7bb5 = _0x172b1b();
while (!![]) {
try {
const _0x209781 =
(-parseInt(_0x549aaa(0xee)) / 0x1) *
(-parseInt(_0x549aaa(0xf3)) / 0x2) +
parseInt(_0x549aaa(0xf9)) / 0x3 +
parseInt(_0x549aaa(0xf5)) / 0x4 +
(-parseInt(_0x549aaa(0xf1)) / 0x5) * (parseInt(_0x549aaa(0xf2)) / 0x6) +
(-parseInt(_0x549aaa(0xf4)) / 0x7) *
(-parseInt(_0x549aaa(0xf7)) / 0x8) +
parseInt(_0x549aaa(0xed)) / 0x9 +
(-parseInt(_0x549aaa(0xf0)) / 0xa) * (parseInt(_0x549aaa(0xf8)) / 0xb);
if (_0x209781 === _0x4874e5) break;
else _0x1a7bb5["push"](_0x1a7bb5["shift"]());
} catch (_0xfd7654) {
_0x1a7bb5["push"](_0x1a7bb5["shift"]());
}
}
})(_0x1360, 0xba09d);
function _0x27f8(_0x1be140, _0x394ea1) {
const _0x1360dc = _0x1360();
return (
(_0x27f8 = function (_0x27f816, _0x3e88b4) {
_0x27f816 = _0x27f816 - 0xeb;
let _0x9b9f1d = _0x1360dc[_0x27f816];
return _0x9b9f1d;
}),
_0x27f8(_0x1be140, _0x394ea1)
);
}
let mongoose = require(_0x16de64(0xf6)),
WelcomeSchema = new mongoose[_0x16de64(0xeb)]({
ID: String,
message: String,
});
module["exports"] = mongoose[_0x16de64(0xec)](_0x16de64(0xef), WelcomeSchema);
function _0x1360() {
const _0x40475b = [
"77pxyVmw",
"713478eFVwsM",
"Schema",
"model",
"12673251eyKkIw",
"101iseMVt",
"Welcome",
"1679960QtLwTL",
"45hKIriv",
"410208XAipYm",
"4022idOSbW",
"43211rgXTtO",
"718064jZlGhf",
"mongoose",
"680mOCvVg",
];
_0x1360 = function () {
return _0x40475b;
};
return _0x1360();
}
`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
