`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/*        
(𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
const ᴠʟᴋʏʀᴇ_Buttons = require(`../../ᴠʟᴋʏʀᴇ🕸️ʜᴏꜱᴛᴇʀ/ᴠʟᴋʏʀᴇ_Buttons`);
const ᴠʟᴋʏʀᴇ_Static = require(`../../ᴠʟᴋʏʀᴇ🕸️ʜᴏꜱᴛᴇʀ/ᴠʟᴋʏʀᴇ_Static`);
const { MessageType, Mimetype } = require(`@adiwajshing/baileys`);
const cleanRF = require(`../../ᴠʟᴋʏʀᴇ🕸️ʜᴏꜱᴛᴇʀ/cleanRF`);
const ꜰᴜᴄᴋ = require(`../../ᴠʟᴋʏʀᴇ🕸️ʜᴏꜱᴛᴇʀ/oShit`);
const speed = require(`performance-now`);
const _𝔏𝔞𝔟_ = require(`../../ᴠʟᴋʏʀᴇ🕸️ʜᴏꜱᴛᴇʀ/_𝔏𝔞𝔟_`);
var ᴋᴇɪᴇx = new RegExp(_𝔏𝔞𝔟_.FOXTROT, `g`);
var ᴋᴇɪ = /\/\^\[(.*)+\]\/\g/g.exec(ᴋᴇɪᴇx)[1];
const fs = require(`fs`);
var path = require(`path`);
var scriptName = path.basename(__filename);
var newScpt = scriptName.slice(0, -3).toLowerCase();
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/*              (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
module.exports = {
name: newScpt,
async handle(
ӄ𝖗𝖆ӄ𝖎𝖓𝖟𝕷𝖆𝖇,
KryChat,
ᴠʟᴋʏʀᴇ,
𝖆𝖗𝖌𝖚𝖒𝖊𝖓𝖙,
ꜱɪᴛʀᴀᴘ,
Clock,
Ping,
Timers
) {
try {
const ʟɴᴀᴍᴇ = ᴠʟᴋʏʀᴇ.sender;
const ᴅꜰɴᴀᴍᴇ = ᴠʟᴋʏʀᴇ.commandName;
const ᴘɴᴀᴍᴇ = ʟɴᴀᴍᴇ.replace(/[^\d+]/g, "");
const ꜰɪɴᴀᴍᴇ = ᴅꜰɴᴀᴍᴇ.charAt(0).toUpperCase() + ᴅꜰɴᴀᴍᴇ.slice(1);
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/*              (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
return ᴠʟᴋʏʀᴇ_Buttons.MIB(
ӄ𝖗𝖆ӄ𝖎𝖓𝖟𝕷𝖆𝖇,
KryChat,
ᴠʟᴋʏʀᴇ,
(MainText = `*₍ @${ᴘɴᴀᴍᴇ} ₎*
╔◇🪔 𝐒𝐮𝐩𝐩𝐨𝐫𝐭 🪔
╚◇════════════◇꧂
🦋𝐕𝐥𝐤𝐲𝐫𝐞: _Is an Advance Whatsapp User-Bot!_
🛰️𝐖𝐞𝐛𝐬𝐢𝐭𝐞: _VlkyreAI.krakinzkon.repl.co_

꧁◇⚡𝐁𝐞𝐥𝐨𝐰 𝐅𝐮𝐥𝐥 𝐋𝐢𝐬𝐭⚡◇꧂
╔⧉༻👇🏽 𝗚𝗮𝗺𝗲𝘀👇🏽
║💰 ${ᴋᴇɪ}shop
║💰 ${ᴋᴇɪ}zoo
║💰 ${ᴋᴇɪ}inv
║💰 ${ᴋᴇɪ}buy
║💰 ${ᴋᴇɪ}pay
║💰 ${ᴋᴇɪ}hunt
║💰 ${ᴋᴇɪ}gamble
║💰 ${ᴋᴇɪ}fish
║💰 ${ᴋᴇɪ}daily
║💰 ${ᴋᴇɪ}work
║💰 ${ᴋᴇɪ}balance
║💰 ${ᴋᴇɪ}rob  _(beta)_
║💰 ${ᴋᴇɪ}truthdare
╚◇╗
╔◇╝👇🏽𝐒𝐞𝐚𝐫𝐜𝐡👇🏽
║  
║🔎 ${ᴋᴇɪ}ytsearch
║🔎 ${ᴋᴇɪ}lyrics
║🔎 ${ᴋᴇɪ}github
║🔎 ${ᴋᴇɪ}pinterest
║🔎 ${ᴋᴇɪ}weather
║🔎 ${ᴋᴇɪ}google 
║🔎 ${ᴋᴇɪ}wikipedia
║🔎 ${ᴋᴇɪ}ud
║🔎 ${ᴋᴇɪ}tenor
║🔎 ${ᴋᴇɪ}gif
║🔎 ${ᴋᴇɪ}wallpaper
╚◇╗
╔◇╝👇🏽𝐃𝐨𝐰𝐧𝐥𝐨𝐚𝐝𝐞𝐫𝐬👇🏽
║  
║📥 ${ᴋᴇɪ}play: (80mb max)
║📥 ${ᴋᴇɪ}watch: (50mb max)
║📥 ${ᴋᴇɪ}soundcloud
║📥 ${ᴋᴇɪ}spotify
║📥 ${ᴋᴇɪ}gifdl
║📥 ${ᴋᴇɪ}imagedl
║📥 ${ᴋᴇɪ}videodl
╚◇╗
╔◇╝👇🏽𝐅𝐅𝐦𝐩𝐞𝐠👇🏽
║  
║🗂️ ${ᴋᴇɪ}tomp3
║🗂️ ${ᴋᴇɪ}img2url
║🗂️ ${ᴋᴇɪ}ocr
║🗂️ ${ᴋᴇɪ}sticker
║🗂️ ${ᴋᴇɪ}carbon
║🗂️ ${ᴋᴇɪ}tinyurl
╚◇╗
╔◇╝👇🏽𝐘𝐨𝐮𝐓𝐮𝐛𝐞+𝐅𝐢𝐥𝐭𝐞𝐫👇🏽
║  
║⭕ ${ᴋᴇɪ}yt8d
║⭕ ${ᴋᴇɪ}ytbassboost
║⭕ ${ᴋᴇɪ}ytecho
║⭕ ${ᴋᴇɪ}ytflanger
║⭕ ${ᴋᴇɪ}ytnightcore
║⭕ ${ᴋᴇɪ}ytphaser
║⭕ ${ᴋᴇɪ}ytreverse
║⭕ ${ᴋᴇɪ}ytslow
║⭕ ${ᴋᴇɪ}ytspeed
║⭕ ${ᴋᴇɪ}ytsubboost
║⭕ ${ᴋᴇɪ}ytsuperslow
║⭕ ${ᴋᴇɪ}ytsuperspeed
║⭕ ${ᴋᴇɪ}ytsurround
║⭕ ${ᴋᴇɪ}ytvaporwave
║⭕ ${ᴋᴇɪ}ytvibrato
╚◇╗
╔◇╝👇🏽𝐅𝐢𝐥𝐭𝐞𝐫𝐬/𝐀𝐮𝐝𝐢𝐨👇🏽
║  
║🍰 ${ᴋᴇɪ}8d
║🍰 ${ᴋᴇɪ}bassboost
║🍰 ${ᴋᴇɪ}echo
║🍰 ${ᴋᴇɪ}fast
║🍰 ${ᴋᴇɪ}flanger
║🍰 ${ᴋᴇɪ}nightcore
║🍰 ${ᴋᴇɪ}phaser
║🍰 ${ᴋᴇɪ}reverse
║🍰 ${ᴋᴇɪ}slow
║🍰 ${ᴋᴇɪ}speed
║🍰 ${ᴋᴇɪ}subboost
║🍰 ${ᴋᴇɪ}superslow
║🍰 ${ᴋᴇɪ}superspeed
║🍰 ${ᴋᴇɪ}surround
║🍰 ${ᴋᴇɪ}vaporwave
║🍰 ${ᴋᴇɪ}vibrato
╚◇╗
╔◇╝👇🏽𝐎𝐰𝐧𝐞𝐫👇🏽
║  
║👑 ${ᴋᴇɪ}join
║👑 ${ᴋᴇɪ}dyno
║👑 ${ᴋᴇɪ}ban
║👑 ${ᴋᴇɪ}unban
║👑 ${ᴋᴇɪ}broadcast
║👑 ${ᴋᴇɪ}bugreport
║👑 ${ᴋᴇɪ}help
║👑 ${ᴋᴇɪ}reboot
║👑 ${ᴋᴇɪ}broadcast
║👑 ${ᴋᴇɪ}leave
║👑 ${ᴋᴇɪ}spam
╚◇╗
╔◇╝👇🏽𝐀𝐧𝐢𝐦𝐞👇🏽
║  
║🍙 ${ᴋᴇɪ}anime
║🍙 ${ᴋᴇɪ}ranimewall
║🍙 ${ᴋᴇɪ}smile
║🍙 ${ᴋᴇɪ}yes
║🍙 ${ᴋᴇɪ}bite
║🍙 ${ᴋᴇɪ}blush
║🍙 ${ᴋᴇɪ}bored
║🍙 ${ᴋᴇɪ}confused
║🍙 ${ᴋᴇɪ}cry
║🍙 ${ᴋᴇɪ}goodnight
║🍙 ${ᴋᴇɪ}happy
║🍙 ${ᴋᴇɪ}hi5
║🍙 ${ᴋᴇɪ}poke
║🍙 ${ᴋᴇɪ}sad
║🍙 ${ᴋᴇɪ}thinking
║🍙 ${ᴋᴇɪ}cuddle
║🍙 ${ᴋᴇɪ}hug
║🍙 ${ᴋᴇɪ}pat
║🍙 ${ᴋᴇɪ}slap
║🍙 ${ᴋᴇɪ}wink
║🍙 ${ᴋᴇɪ}angry
║🍙 ${ᴋᴇɪ}baka
║🍙 ${ᴋᴇɪ}bonk
║🍙 ${ᴋᴇɪ}bully
║🍙 ${ᴋᴇɪ}bye
║🍙 ${ᴋᴇɪ}chase
║🍙 ${ᴋᴇɪ}cheer
║🍙 ${ᴋᴇɪ}cringe
║🍙 ${ᴋᴇɪ}dab
║🍙 ${ᴋᴇɪ}dance
║🍙 ${ᴋᴇɪ}die
║🍙 ${ᴋᴇɪ}facepalm
║🍙 ${ᴋᴇɪ}feed
║🍙 ${ᴋᴇɪ}glomp
║🍙 ${ᴋᴇɪ}hold
║🍙 ${ᴋᴇɪ}hate
║🍙 ${ᴋᴇɪ}hi
║🍙 ${ᴋᴇɪ}kill
║🍙 ${ᴋᴇɪ}lick
║🍙 ${ᴋᴇɪ}love
║🍙 ${ᴋᴇɪ}lurk
║🍙 ${ᴋᴇɪ}nervous
║🍙 ${ᴋᴇɪ}nope
║🍙 ${ᴋᴇɪ}nom
║🍙 ${ᴋᴇɪ}nuzzle
║🍙 ${ᴋᴇɪ}panic
║🍙 ${ᴋᴇɪ}peck
║🍙 ${ᴋᴇɪ}pout
║🍙 ${ᴋᴇɪ}run
║🍙 ${ᴋᴇɪ}sip
║🍙 ${ᴋᴇɪ}shoot
║🍙 ${ᴋᴇɪ}shrug
║🍙 ${ᴋᴇɪ}sleep
║🍙 ${ᴋᴇɪ}smug
║🍙 ${ᴋᴇɪ}stab
║🍙 ${ᴋᴇɪ}stare
║🍙 ${ᴋᴇɪ}tease
║🍙 ${ᴋᴇɪ}tickle
║🍙 ${ᴋᴇɪ}thumbsup
║🍙 ${ᴋᴇɪ}wag
╚◇╗
╔◇╝👇🏽𝐆𝐫𝐨𝐮𝐩𝐬/𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧👇🏽
║  
║🔰 ${ᴋᴇɪ}antilink
║🔰 ${ᴋᴇɪ}autorank
║🔰 ${ᴋᴇɪ}setwelcome
║🔰 ${ᴋᴇɪ}delete
║🔰 ${ᴋᴇɪ}promote
║🔰 ${ᴋᴇɪ}demote
║🔰 ${ᴋᴇɪ}warn
║🔰 ${ᴋᴇɪ}unwarn
║🔰 ${ᴋᴇɪ}invite
║🔰 ${ᴋᴇɪ}lock
║🔰 ${ᴋᴇɪ}unlock
║🔰 ${ᴋᴇɪ}admins
║🔰 ${ᴋᴇɪ}groupdp
║🔰 ${ᴋᴇɪ}kick
║🔰 ${ᴋᴇɪ}getdesc
║🔰 ${ᴋᴇɪ}getdp
║🔰 ${ᴋᴇɪ}tagall
╚◇╗
╔◇╝👇🏽𝐑𝐚𝐧𝐝𝐨𝐦𝐬👇🏽
║  
║🦄 ${ᴋᴇɪ}rank
║🦄 ${ᴋᴇɪ}leaderboard
║🦄 ${ᴋᴇɪ}fact
║🦄 ${ᴋᴇɪ}trivia
║🦄 ${ᴋᴇɪ}joke
║🦄 ${ᴋᴇɪ}meme
║🦄 ${ᴋᴇɪ}tr
║🦄 ${ᴋᴇɪ}tts
║🦄 ${ᴋᴇɪ}pokedex
║🦄 ${ᴋᴇɪ}triggered
╚◇╗
╔◇╝👇🏽𝗠𝗲𝗺𝗯𝗲𝗿 𝗦𝘁𝗼𝗿𝗲👇🏽
║  
║🛍️ ${ᴋᴇɪ}buy basic 
║🛍️ ${ᴋᴇɪ}buy bronze 
║🛍️ ${ᴋᴇɪ}buy silver 
║🛍️ ${ᴋᴇɪ}buy gold 
║🛍️ ${ᴋᴇɪ}buy platinum 
║🛍️ ${ᴋᴇɪ}buy diamond
║🛍️ ${ᴋᴇɪ}buy sword
║🛍️ ${ᴋᴇɪ}buy laptop
║🛍️ ${ᴋᴇɪ}buy charm
╚◇╗
╔◇╝👇🏽𝐂𝐡𝐞𝐜𝐤👇🏽
║  
║🎨 ${ᴋᴇɪ}gaycheck
║🎨 ${ᴋᴇɪ}lesbocheck
║🎨 ${ᴋᴇɪ}beautycheck
║🎨 ${ᴋᴇɪ}dumbcheck
║🎨 ${ᴋᴇɪ}gay
║🎨 ${ᴋᴇɪ}lesbo
║🎨 ${ᴋᴇɪ}beauty
║🎨 ${ᴋᴇɪ}dumb
╚◇╗
╔◇╝👇🏽𝐇𝐮𝐦𝐚𝐧+𝐍𝐒𝐅𝐖👇🏽
║  
║🥃 ${ᴋᴇɪ}4k
║🥃 ${ᴋᴇɪ}blowjob
║🥃 ${ᴋᴇɪ}milf
║🥃 ${ᴋᴇɪ}milk
║🥃 ${ᴋᴇɪ}pussy
║🥃 ${ᴋᴇɪ}slut
║🥃 ${ᴋᴇɪ}tikporn
╚◇╗
╔◇╝👇🏽𝐇𝐞𝐧𝐭𝐚𝐢+𝐍𝐒𝐅𝐖👇🏽
║  
║🍑 ${ᴋᴇɪ}ass
║🍑 ${ᴋᴇɪ}bdsm
║🍑 ${ᴋᴇɪ}cum  
║🍑 ${ᴋᴇɪ}doujin
║🍑 ${ᴋᴇɪ}feet  
║🍑 ${ᴋᴇɪ}femdom  
║🍑 ${ᴋᴇɪ}foxgirl  
║🍑 ${ᴋᴇɪ}glasses  
║🍑 ${ᴋᴇɪ}hentai
║🍑 ${ᴋᴇɪ}maid 
║🍑 ${ᴋᴇɪ}masturbation
║🍑 ${ᴋᴇɪ}netorare  
║🍑 ${ᴋᴇɪ}orgy
║🍑 ${ᴋᴇɪ}panties
║🍑 ${ᴋᴇɪ}pussy
║🍑 ${ᴋᴇɪ}school
║🍑 ${ᴋᴇɪ}tentacles
║🍑 ${ᴋᴇɪ}thighs
║🍑 ${ᴋᴇɪ}uniform
║🍑 ${ᴋᴇɪ}yuri
╚════════════╝`),
"./ᴠʟᴋʏʀᴇ🔌cord/ᴠʟᴋʏʀᴇ_Uni.png"
);
} catch (error) {
ꜰᴜᴄᴋ.catch(error, ӄ𝖗𝖆ӄ𝖎𝖓𝖟𝕷𝖆𝖇, ᴠʟᴋʏʀᴇ, KryChat);
return;
}
},
};
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/*        
(𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
