("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");

//▷                                              (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!                                           ◁

("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
const _0xc129f8 = _0x3bc2;
(function (_0x3ba365, _0x4239f1) {
const _0x42781d = _0x3bc2,
_0x1f73a5 = _0x3ba365();
while (!![]) {
try {
const _0x2d9ec8 =
-parseInt(_0x42781d(0x1c5)) / 0x1 +
(parseInt(_0x42781d(0x1c6)) / 0x2) *
(parseInt(_0x42781d(0x1c8)) / 0x3) +
(-parseInt(_0x42781d(0x1c3)) / 0x4) *
(-parseInt(_0x42781d(0x1d4)) / 0x5) +
(-parseInt(_0x42781d(0x1d5)) / 0x6) *
(parseInt(_0x42781d(0x1d8)) / 0x7) +
(-parseInt(_0x42781d(0x1cf)) / 0x8) *
(-parseInt(_0x42781d(0x1ca)) / 0x9) +
(-parseInt(_0x42781d(0x1d2)) / 0xa) *
(parseInt(_0x42781d(0x1c1)) / 0xb) +
parseInt(_0x42781d(0x1bb)) / 0xc;
if (_0x2d9ec8 === _0x4239f1) break;
else _0x1f73a5["push"](_0x1f73a5["shift"]());
} catch (_0x29b304) {
_0x1f73a5["push"](_0x1f73a5["shift"]());
}
}
})(_0x3c25, 0xa46a6);
let cron = require(_0xc129f8(0x1c7));
cron["schedule"](_0xc129f8(0x1c2), () => {
const _0x1facbe = _0xc129f8;
let _0x61adb0 = require(_0x1facbe(0x1cd)),
_0x18c299 = require("./package.json"),
_0x5219d7 = new Date(),
_0x403cc1 = ("0" + _0x5219d7[_0x1facbe(0x1c9)]())[_0x1facbe(0x1d1)](-0x2),
_0x4d36f1 = ("0" + (_0x5219d7["getMonth"]() + 0x1))[_0x1facbe(0x1d1)](-0x2),
_0xe405c6 = _0x5219d7[_0x1facbe(0x1cb)](),
_0x10b1fc = _0x5219d7[_0x1facbe(0x1c0)](),
_0x40f417 = _0x5219d7[_0x1facbe(0x1d3)](),
_0x5fe397 = _0x5219d7[_0x1facbe(0x1d7)]();
!_0x61adb0["which"]("git") &&
(_0x61adb0[_0x1facbe(0x1bd)](_0x1facbe(0x1d9)),
_0x61adb0[_0x1facbe(0x1d0)](0x1)),
_0x61adb0[_0x1facbe(0x1ce)](
"git\x20pull\x20&&\x20git\x20add\x20--all\x20&&\x20git\x20commit\x20-am\x20\x22「\x20🕊️\x20Ѷ𝖑𝐤𝐲𝖗𝖊\x20🕊️\x20」\x20:\x20" +
_0x18c299[_0x1facbe(0x1c4)] +
_0x1facbe(0x1cc) +
(_0xe405c6 +
"-" +
_0x4d36f1 +
"-" +
_0x403cc1 +
"\x20" +
_0x10b1fc +
":" +
_0x40f417 +
":" +
_0x5fe397) +
_0x1facbe(0x1d6)
)[_0x1facbe(0x1bf)] !== 0x0 &&
(_0x61adb0[_0x1facbe(0x1bc)](), _0x61adb0["echo"](_0x1facbe(0x1be)));
});
function _0x3bc2(_0x222326, _0x488bd5) {
const _0x3c25f2 = _0x3c25();
return (
(_0x3bc2 = function (_0x3bc2ed, _0x268795) {
_0x3bc2ed = _0x3bc2ed - 0x1bb;
let _0x19e38b = _0x3c25f2[_0x3bc2ed];
return _0x19e38b;
}),
_0x3bc2(_0x222326, _0x488bd5)
);
}
function _0x3c25() {
const _0x3eb2dc = [
"155095QTWPun",
"292svcuKm",
"node-cron",
"12765jvlhxo",
"getDate",
"27WFSQjt",
"getFullYear",
"\x20📅𝐃𝐚𝐭𝐞:\x20",
"shelljs",
"exec",
"1552136qUljww",
"exit",
"slice",
"10ccwgtP",
"getMinutes",
"3969065RAgozt",
"6325962RwRThx",
"\x20\x22\x20&&\x20git\x20push",
"getSeconds",
"7oWQZqP",
"Sorry,\x20this\x20script\x20requires\x20git",
"5845044yvYKNF",
"error",
"echo",
"💡𝐈𝐧𝐟𝐨꧂\x20Exited\x20With\x20Code\x20!==0",
"code",
"getHours",
"6614443fFDibW",
"*/2\x20*\x20*\x20*\x20*\x20*",
"4ALSCbk",
"vers",
];
_0x3c25 = function () {
return _0x3eb2dc;
};
return _0x3c25();
}
("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");

//▷                                              (𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!                                           ◁

("|⬡════════════════════════════════════════════════════════════════════════════════════|▷ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ◁|═════════════════════════════════════════════════════════════════════⬡|");
