`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
`|                                                                                                                        |`;
`|        (𝐜)𝐂𝐨𝐫𝐭𝐚𝐧𝐚𝐀𝐈 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!            |`;
`|                                                                                                                        |`;
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
const Cortana_Buttons = require(`../../Cortana🛰️Server/Cortana_Buttons`);
const _𝔏𝔞𝔟_ = require(`../../Cortana🛰️Server/_𝔏𝔞𝔟_`);
const ꜰᴜᴄᴋ = require(`../../Cortana🛰️Server/oShit`);
var ᴋᴇɪᴇx = new RegExp(_𝔏𝔞𝔟_.FOXTROT, `g`);
var ᴋᴇɪ = /\/\^\[(.*)+\]\/\g/g.exec(ᴋᴇɪᴇx)[1];
const fs = require(`fs`);
var path = require(`path`);
var scriptName = path.basename(__filename);
var newScpt = scriptName.slice(0, -3).toLowerCase();
`|⬡════════════════════════════════════════════|   (𝐜)𝐂𝐨𝐫𝐭𝐚𝐧𝐚𝐀𝐈  🛸  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛   |═══════════════════════════════════════════⬡|`;
module.exports = {
name: newScpt,
async handle(ӄʀǟӄɨռʐ, chat, ƈօʀȶǟռǟ, Needs, ꜱɪᴛʀᴀᴘ, Clock, Ping, Timers) {
try {
var աɦօֆɛռȶɦǟȶ = ƈօʀȶǟռǟ.sender;
const defaultnm = ƈօʀȶǟռǟ.commandName;
var աɦօֆɛռȶɦǟȶռʊʍ = աɦօֆɛռȶɦǟȶ
.substring(0, աɦօֆɛռȶɦǟȶ.length - 15)
.replace(/[+ ]/g, "");
const FinalName = defaultnm.charAt(0).toUpperCase() + defaultnm.slice(1);
`|⬡════════════════════════════════════════════|   (𝐜)𝐂𝐨𝐫𝐭𝐚𝐧𝐚𝐀𝐈  🛸  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛   |═══════════════════════════════════════════⬡|`;
const hold = require("../../Cortana🛰️Server/Hold");
await hold.Hold(ƈօʀȶǟռǟ);
`|⬡════════════════════════════════════════════|   (𝐜)𝐂𝐨𝐫𝐭𝐚𝐧𝐚𝐀𝐈  🛸  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛   |═══════════════════════════════════════════⬡|`;
var MediaUrl = `./Cortana☣️Reactor/ƈօʀȶǟռǟ.png`;
var MainText = `🪶 𝐇𝐞𝐲: •@${աɦօֆɛռȶɦǟȶռʊʍ}, ${Timers}
🛸𝐂𝐨𝐫𝐭𝐚𝐧𝐚𝐀𝐈: _ɪꜱ ᴀ ᴡʜᴀᴛꜱᴀᴘᴘ ᴍᴜʟᴛɪᴘᴜʀᴘᴏꜱᴇ-ᴜꜱᴇʀʙᴏᴛ ᴡɪᴛʜ ᴍᴏᴅᴇʀᴀᴛɪᴏɴ,ᴀᴜᴛᴏᴍᴀᴛɪᴏɴ ᴀɴᴅ 100+ ᴄᴏᴍᴍᴀɴᴅꜱ!_


╔══◇꧁༺ 𝗚𝗮𝗺𝗲𝘀 ༻꧂  
║
║💰• ${ᴋᴇɪ}shop
║💰• ${ᴋᴇɪ}zoo
║💰• ${ᴋᴇɪ}inv
║💰• ${ᴋᴇɪ}buy
║💰• ${ᴋᴇɪ}pay
║💰• ${ᴋᴇɪ}hunt
║💰• ${ᴋᴇɪ}gamble
║💰• ${ᴋᴇɪ}fish
║💰• ${ᴋᴇɪ}daily
║💰• ${ᴋᴇɪ}work
║💰• ${ᴋᴇɪ}balance
║💰• ${ᴋᴇɪ}rob _(beta)_
║💰• ${ᴋᴇɪ}truthdare
║
╚◇╗
╔◇╜꧁༺ 𝐒𝐞𝐚𝐫𝐜𝐡 ༻꧂  
║
║🔎• ${ᴋᴇɪ}ytsearc
║🔎• ${ᴋᴇɪ}lyrics
║🔎• ${ᴋᴇɪ}github
║🔎• ${ᴋᴇɪ}pinterest
║🔎• ${ᴋᴇɪ}weather
║🔎• ${ᴋᴇɪ}google 
║🔎• ${ᴋᴇɪ}wikipedia
║🔎• ${ᴋᴇɪ}ud
║🔎• ${ᴋᴇɪ}tenor
║🔎• ${ᴋᴇɪ}gif
║🔎• ${ᴋᴇɪ}wallpaper
║
╚◇╗
╔◇╜꧁༺ 𝐃𝐨𝐰𝐧𝐥𝐨𝐚𝐝𝐞𝐫𝐬 ༻꧂  
║
║📥• ${ᴋᴇɪ}play
║📥• ${ᴋᴇɪ}song
║📥• ${ᴋᴇɪ}stream
║📥• ${ᴋᴇɪ}watch
║📥• ${ᴋᴇɪ}ytmlink
║📥• ${ᴋᴇɪ}ytvlink
║📥• ${ᴋᴇɪ}instagram
║📥• ${ᴋᴇɪ}facebook
║
╚◇╗
╔◇╜꧁༺ 𝐅𝐅𝐦𝐩𝐞𝐠 ༻꧂  
║
║🗂️• ${ᴋᴇɪ}tomp3
║🗂️• ${ᴋᴇɪ}img2url
║🗂️• ${ᴋᴇɪ}ocr
║🗂️• ${ᴋᴇɪ}sticker
║🗂️• ${ᴋᴇɪ}carbon
║
╚◇╗
╔◇╜꧁༺ 𝐅𝐢𝐥𝐭𝐞𝐫𝐬/𝐀𝐮𝐝𝐢𝐨 ༻꧂  
║
║🏝️• ${ᴋᴇɪ}bass
║🏝️• ${ᴋᴇɪ}blown
║🏝️• ${ᴋᴇɪ}deep
║🏝️• ${ᴋᴇɪ}earrape
║🏝️• ${ᴋᴇɪ}fast
║🏝️• ${ᴋᴇɪ}fat
║🏝️• ${ᴋᴇɪ}nightcore
║🏝️• ${ᴋᴇɪ}reverse
║🏝️• ${ᴋᴇɪ}robot
║🏝️• ${ᴋᴇɪ}slow
║🏝️• ${ᴋᴇɪ}smooth
║
╚◇╗
╔◇╜꧁༺ 𝐊𝐢𝐧𝐠/𝐎𝐰𝐧𝐞𝐫 ༻꧂  
║
║🐙• ${ᴋᴇɪ}join
║🐙• ${ᴋᴇɪ}dyno
║🐙• ${ᴋᴇɪ}ban
║🐙• ${ᴋᴇɪ}unban
║🐙• ${ᴋᴇɪ}broadcast
║🐙• ${ᴋᴇɪ}bugreport
║🐙• ${ᴋᴇɪ}help
║🐙• ${ᴋᴇɪ}sakura
║🐙• ${ᴋᴇɪ}reboot
║🐙• ${ᴋᴇɪ}broadcast
║🐙• ${ᴋᴇɪ}leave
║🐙• ${ᴋᴇɪ}spam
║
╚◇╗
╔◇╜꧁༺ 𝐀𝐧𝐢𝐦𝐞 ༻꧂  
║
║🍣• ${ᴋᴇɪ}anime
║🍣• ${ᴋᴇɪ}ranimewall
║🍣• ${ᴋᴇɪ}smile
║🍣• ${ᴋᴇɪ}yes
║🍣• ${ᴋᴇɪ}bite
║🍣• ${ᴋᴇɪ}blush
║🍣• ${ᴋᴇɪ}bored
║🍣• ${ᴋᴇɪ}confused
║🍣• ${ᴋᴇɪ}cry
║🍣• ${ᴋᴇɪ}goodnight
║🍣• ${ᴋᴇɪ}happy
║🍣• ${ᴋᴇɪ}hi5
║🍣• ${ᴋᴇɪ}poke
║🍣• ${ᴋᴇɪ}sad
║🍣• ${ᴋᴇɪ}thinking
║🍣• ${ᴋᴇɪ}cuddle
║🍣• ${ᴋᴇɪ}hug
║🍣• ${ᴋᴇɪ}pat
║🍣• ${ᴋᴇɪ}slap
║🍣• ${ᴋᴇɪ}wink
║🍣• ${ᴋᴇɪ}angry
║🍣• ${ᴋᴇɪ}baka
║🍣• ${ᴋᴇɪ}bonk
║🍣• ${ᴋᴇɪ}bully
║🍣• ${ᴋᴇɪ}bye
║🍣• ${ᴋᴇɪ}chase
║🍣• ${ᴋᴇɪ}cheer
║🍣• ${ᴋᴇɪ}cringe
║🍣• ${ᴋᴇɪ}dab
║🍣• ${ᴋᴇɪ}dance
║🍣• ${ᴋᴇɪ}die
║🍣• ${ᴋᴇɪ}facepalm
║🍣• ${ᴋᴇɪ}feed
║🍣• ${ᴋᴇɪ}glomp
║🍣• ${ᴋᴇɪ}hold
║🍣• ${ᴋᴇɪ}hate
║🍣• ${ᴋᴇɪ}hi
║🍣• ${ᴋᴇɪ}kill
║🍣• ${ᴋᴇɪ}laugh
║🍣• ${ᴋᴇɪ}lick
║🍣• ${ᴋᴇɪ}love
║🍣• ${ᴋᴇɪ}lurk
║🍣• ${ᴋᴇɪ}nervous
║🍣• ${ᴋᴇɪ}nope
║🍣• ${ᴋᴇɪ}nom
║🍣• ${ᴋᴇɪ}nuzzle
║🍣• ${ᴋᴇɪ}panic
║🍣• ${ᴋᴇɪ}peck
║🍣• ${ᴋᴇɪ}pout
║🍣• ${ᴋᴇɪ}run
║🍣• ${ᴋᴇɪ}sip
║🍣• ${ᴋᴇɪ}shoot
║🍣• ${ᴋᴇɪ}shrug
║🍣• ${ᴋᴇɪ}sleep
║🍣• ${ᴋᴇɪ}smug
║🍣• ${ᴋᴇɪ}stab
║🍣• ${ᴋᴇɪ}stare
║🍣• ${ᴋᴇɪ}tease
║🍣• ${ᴋᴇɪ}tickle
║🍣• ${ᴋᴇɪ}thumbsup
║🍣• ${ᴋᴇɪ}wag
║
╚◇╗
╔◇╜ 𝐆𝐫𝐨𝐮𝐩𝐬/𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧 ༻꧂  
║
║🔰• ${ᴋᴇɪ}antilink
║🔰• ${ᴋᴇɪ}autorank
║🔰• ${ᴋᴇɪ}setwelcome
║🔰• ${ᴋᴇɪ}promote
║🔰• ${ᴋᴇɪ}demote
║🔰• ${ᴋᴇɪ}warn
║🔰• ${ᴋᴇɪ}unwarn
║🔰• ${ᴋᴇɪ}invite
║🔰• ${ᴋᴇɪ}lock
║🔰• ${ᴋᴇɪ}unlock
║🔰• ${ᴋᴇɪ}admins
║🔰• ${ᴋᴇɪ}groupdp
║🔰• ${ᴋᴇɪ}kick
║🔰• ${ᴋᴇɪ}getdesc
║🔰• ${ᴋᴇɪ}getdp
║🔰• ${ᴋᴇɪ}tagall
║
╚◇╗
╔◇╜ 𝐑𝐚𝐧𝐝𝐨𝐦𝐬 ༻꧂  
║
║🦄• ${ᴋᴇɪ}rank
║🦄• ${ᴋᴇɪ}joke
║🦄• ${ᴋᴇɪ}meme
║🦄• ${ᴋᴇɪ}tr
║🦄• ${ᴋᴇɪ}tts
║🦄• ${ᴋᴇɪ}pokedex
║🦄• ${ᴋᴇɪ}triggered
║
╚◇╗
╔◇╜ 𝐂𝐡𝐞𝐜𝐤 ༻꧂  
║
║🎨• ${ᴋᴇɪ}gaycheck
║🎨• ${ᴋᴇɪ}lesbocheck
║🎨• ${ᴋᴇɪ}beautycheck
║🎨• ${ᴋᴇɪ}dumbcheck
║
╚◇╗
╔◇╜ 𝐇𝐮𝐦𝐚𝐧/𝐍𝐒𝐅𝐖 ༻꧂  
║
║🥃• ${ᴋᴇɪ}4k
║🥃• ${ᴋᴇɪ}blowjob
║🥃• ${ᴋᴇɪ}milf
║🥃• ${ᴋᴇɪ}milk
║🥃• ${ᴋᴇɪ}pussy
║🥃• ${ᴋᴇɪ}slut
║🥃• ${ᴋᴇɪ}tikporn
║
╚◇╗
╔◇╜ 𝐇𝐞𝐧𝐭𝐚𝐢/𝐍𝐒𝐅𝐖 ༻꧂  
║
║🍄• ${ᴋᴇɪ}porn
║🍄• ${ᴋᴇɪ}ass
║🍄• ${ᴋᴇɪ}bdsm
║🍄• ${ᴋᴇɪ}cum  
║🍄• ${ᴋᴇɪ}doujin
║🍄• ${ᴋᴇɪ}feet  
║🍄• ${ᴋᴇɪ}femdom  
║🍄• ${ᴋᴇɪ}foxgirl  
║🍄• ${ᴋᴇɪ}glasses  
║🍄• ${ᴋᴇɪ}hentai
║🍄• ${ᴋᴇɪ}maid 
║🍄• ${ᴋᴇɪ}masturbation
║🍄• ${ᴋᴇɪ}netorare  
║🍄• ${ᴋᴇɪ}orgy
║🍄• ${ᴋᴇɪ}panties
║🍄• ${ᴋᴇɪ}pussy
║🍄• ${ᴋᴇɪ}school
║🍄• ${ᴋᴇɪ}tentacles
║🍄• ${ᴋᴇɪ}thighs
║🍄• ${ᴋᴇɪ}uniform
║🍄• ${ᴋᴇɪ}yuri
╚════════════╝`;
Cortana_Buttons.MIB(ӄʀǟӄɨռʐ, chat, ƈօʀȶǟռǟ, MainText, MediaUrl);
return;
`|⬡════════════════════════════════════════════|   (𝐜)𝐂𝐨𝐫𝐭𝐚𝐧𝐚𝐀𝐈  🛸  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛   |═══════════════════════════════════════════⬡|`;
} catch (Error) {
ꜰᴜᴄᴋ.catch(Error, ӄʀǟӄɨռʐ, ƈօʀȶǟռǟ, chat);
return;
}
},
};
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
`|                                                                                                                        |`;
`|        (𝐜)𝐂𝐨𝐫𝐭𝐚𝐧𝐚𝐀𝐈 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!            |`;
`|                                                                                                                        |`;
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
