("◎☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱[ νℓкуяє вσт ву mågneum ]☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱◎");
/*
╔⧉༻ [ 𝐕𝐥𝐤𝐲𝐫𝐞🕊️𝐌𝐮𝐥𝐭𝐢𝐃𝐞𝐯𝐢𝐜𝐞 𝐀𝐏𝐈 ] 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
║ 🐞𝐃𝐞𝐯𝐞𝐥𝐨𝐩𝐞𝐫𝐬 +918436686758,917430922909
║ 
║ We won't be responsible for any kind of ban due to this bot.
║ Vlkyre was made for fun purpose and to make group management easier.
║ It's your concern if you spam and gets your account banned.
║ Also, Forks won't be entertained.
║ If you fork this repo and edit plugins, it's your concern for further updates.
║ Forking Repo is fine. But if you edit something we will not provide any help.
║ In short, Fork At Your Own Risk.
╚════════════╝
*/
("◎☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱[ νℓкуяє вσт ву mågneum ]☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱◎");
ppath = require("path");
require("../../global.js");
psname = ppath.basename(__filename);
pfname = psname.slice(0, -3).toLowerCase();
module.exports = async (
νℓкуяє,
vcнaт,
gmeta,
isAdmin,
groupName,
isBotAdmin,
groupAdmins,
participants,
isSudoWorker
) => {
await νℓкуяє.sendMessage(vcнaт.chat, {
react: {
text: "🔖",
key: vcнaт.key,
},
});
try {
if (!vcнaт.isGroup) {
await νℓкуяє.sendMessage(vcнaт.chat, {
react: {
text: "❌",
key: vcнaт.key,
},
});
return vcнaт.reply(
`*😥Sorry:* _${νℓкуяє.pushname || νℓкуяє.Tname}_

*❌Error* 
> _It's a group command!_`
);
}
if (!isAdmin) {
await νℓкуяє.sendMessage(vcнaт.chat, {
react: {
text: "❌",
key: vcнaт.key,
},
});
return vcнaт.reply(
`*😥Sorry:* _${νℓкуяє.pushname || νℓкуяє.Tname}_

*❌Error* 
> _This is an Admin only Command!_`
);
}
if (!isBotAdmin) {
await νℓкуяє.sendMessage(vcнaт.chat, {
react: {
text: "❌",
key: vcнaт.key,
},
});
return vcнaт.reply(
`*😥Sorry:* _${νℓкуяє.pushname || νℓкуяє.Tname}_

*❌Error* 
> _Bot not Admin!_`
);
}
("◎☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱[ νℓкуяє вσт ву mågneum ]☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱◎");
try {
𝕯𝖎𝖘𝖕𝖑𝖆𝖞 = await νℓкуяє.profilePictureUrl(vcнaт.sender, "image");
} catch {
𝕯𝖎𝖘𝖕𝖑𝖆𝖞 = "./Gallery/νℓкуяє.jpg";
}
("◎☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱[ νℓкуяє вσт ву mågneum ]☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱◎");
if (νℓкуяє.args[0] === "open") {
await νℓкуяє
.groupSettingUpdate(vcнaт.chat, "not_announcement")
.then(
async (res) =>
await νℓкуяє.imgB(
νℓкуяє,
vcнaт,
`> *Group have been Opened by: ${νℓкуяє.pushname || νℓкуяє.Tname}*`,
𝕯𝖎𝖘𝖕𝖑𝖆𝖞
)
)
.catch((error) =>
vcнaт.reply(
`*😥Sorry:* _${νℓкуяє.pushname || νℓкуяє.Tname}_
*❌Error* 
> ${jsonformat(error)}`
)
);
("◎☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱[ νℓкуяє вσт ву mågneum ]☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱◎");
} else if (νℓкуяє.args[0] === "close") {
await νℓкуяє
.groupSettingUpdate(vcнaт.chat, "announcement")
.then(
async (res) =>
await νℓкуяє.imgB(
νℓкуяє,
vcнaт,
`> *Group have been Closed by: ${νℓкуяє.pushname || νℓкуяє.Tname}*`,
𝕯𝖎𝖘𝖕𝖑𝖆𝖞
)
)
.catch((error) =>
vcнaт.reply(
`*😥Sorry:* _${νℓкуяє.pushname || νℓкуяє.Tname}_
*❌Error* 
> ${jsonformat(error)}`
)
);
("◎☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱[ νℓкуяє вσт ву mågneum ]☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱◎");
} else if (νℓкуяє.args[0] === "antilink") {
if (
νℓкуяє.args[1] === "ON" ||
νℓкуяє.args[1] === "on" ||
νℓкуяє.args[1] === "On"
) {
return await νℓкуяє.LinkList.findOne(
{
serverID: vcнaт.chat,
},
async (error, server) => {
if (error) {
return νℓкуяє.reply(`*🕊️You:* ${
νℓкуяє.pushname || "ɴᴏ_ɴᴀᴍᴇ"
}\n*📢ID:* ${vcнaт.chat}

*😥Sorry:* _${νℓкуяє.pushname || νℓкуяє.Tname}_
*❌ Error* 
> There has been an API Error. Please try again later.

*🐞 Bug* 
> ${error}`);
}
("◎☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱[ νℓкуяє вσт ву mågneum ]☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱◎");
if (!server) {
let newServer = new νℓкуяє.LinkList({
serverID: vcнaт.chat,
value: "ON",
});
await newServer.save();
return await νℓкуяє.imgB(
νℓкуяє,
vcнaт,
`> *🔗Antilink:* _✅Has been turned ON_`,
𝕯𝖎𝖘𝖕𝖑𝖆𝖞
);
} else {
return await νℓкуяє.imgB(
νℓкуяє,
vcнaт,
`> *🔗Antilink:* _✅Was already turned ON_`,
𝕯𝖎𝖘𝖕𝖑𝖆𝖞
);
}
}
);
("◎☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱[ νℓкуяє вσт ву mågneum ]☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱◎");
} else if (
νℓкуяє.args[1] === "OFF" ||
νℓкуяє.args[1] === "off" ||
νℓкуяє.args[1] === "Off"
) {
return await νℓкуяє.LinkList.findOne(
{
serverID: vcнaт.chat,
},
async (error, server) => {
if (error) {
return νℓкуяє.reply(`*🕊️You:* ${
νℓкуяє.pushname || "ɴᴏ_ɴᴀᴍᴇ"
}\n*📢ID:* ${vcнaт.chat}

*😥Sorry:* _${νℓкуяє.pushname || νℓкуяє.Tname}_
*❌ Error* 
> There has been an API Error. Please try again later.

*🐞 Bug* 
> ${error}`);
}
("◎☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱[ νℓкуяє вσт ву mågneum ]☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱◎");
if (!server) {
return await νℓкуяє.imgB(
νℓкуяє,
vcнaт,
`> *🔗Antilink:* _❌Has been turned OFF_`,
𝕯𝖎𝖘𝖕𝖑𝖆𝖞
);
} else {
await server.delete();
return await νℓкуяє.imgB(
νℓкуяє,
vcнaт,
`> *🔗Antilink:* _❌was not turned OFF_`,
𝕯𝖎𝖘𝖕𝖑𝖆𝖞
);
}
}
);
("◎☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱[ νℓкуяє вσт ву mågneum ]☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱◎");
} else {
await νℓкуяє.sendMessage(vcнaт.chat, {
react: {
text: "❌",
key: vcнaт.key,
},
});
return vcнaт.reply(
`*😥Sorry:* _${νℓкуяє.pushname || νℓкуяє.Tname}_

*❌Error* 
> _Argument Missing!_

*⚡Usage* 
> _${νℓкуяє.prefix}${pfname} close/open
> _${νℓкуяє.prefix}${pfname} antilink on/off`
);
}
("◎☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱[ νℓкуяє вσт ву mågneum ]☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱◎");
} else {
await νℓкуяє.sendMessage(vcнaт.chat, {
react: {
text: "❌",
key: vcнaт.key,
},
});
return vcнaт.reply(
`*😥Sorry:* _${νℓкуяє.pushname || νℓкуяє.Tname}_

*❌Error* 
> _Argument Missing!_

*⚡Usage* 
> _${νℓкуяє.prefix}${pfname} close/open
> _${νℓкуяє.prefix}${pfname} antilink on/off`
);
}
("◎☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱[ νℓкуяє вσт ву mågneum ]☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱◎");
} catch (error) {
return νℓкуяє.grab(νℓкуяє, vcнaт);
}
};