`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
`|                                                                                                                        |`;
`|        (𝐜)𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!            |`;
`|                                                                                                                        |`;
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
const Sakura_Buttons = require(`../../Sakura🛰️Server/Sakura_Buttons`);
const Sakura_Static = require(`../../Sakura🛰️Server/Sakura_Static`);
const { MessageType, Mimetype } = require(`@adiwajshing/baileys`);
const Economy = require(`../../Sakura🍃Goose/economy`);
const Robbery = require(`../../Sakura🍃Goose/robbery`);
const _𝔏𝔞𝔟_ = require(`../../Sakura🛰️Server/_𝔏𝔞𝔟_`);
const ꜰᴜᴄᴋ = require(`../../Sakura🛰️Server/oShit`);
var ᴋᴇɪᴇx = new RegExp(_𝔏𝔞𝔟_.FOXTROT, `g`);
var ᴋᴇɪ = /\/\^\[(.*)+\]\/\g/g.exec(ᴋᴇɪᴇx)[1];
const ms = require(`parse-ms`);
const fs = require(`fs`);
var path = require(`path`);
var scriptName = path.basename(__filename);
var newScpt = scriptName.slice(0, -3).toLowerCase();
module.exports = {
  name: newScpt,
  ֆǟӄʊʀǟӄǟɨʐօ: `*Reply-Person:* ${ᴋᴇɪ}${newScpt}`,
  async handle(ӄʀǟӄɨռʐ, chat, ֆǟӄʊʀǟ, Needs, ꜱɪᴛʀᴀᴘ, Clock, Ping) {
    try {
      const defaultnm = ֆǟӄʊʀǟ.commandName;
      const FinalName = defaultnm.charAt(0).toUpperCase() + defaultnm.slice(1);
      `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
      if (!ֆǟӄʊʀǟ.isGroup) {
        return Sakura_Buttons.MTB(
          ӄʀǟӄɨռʐ,
          chat,
          ֆǟӄʊʀǟ,
          `🦋𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 @${աɦօֆɛռȶɦǟȶռʊʍ}, 

╔════◇🔒𝐏𝐞𝐫𝐦𝐢𝐬𝐬𝐢𝐨𝐧 
║💡 _This Command is Only For Groups!_
╚════════════╝`
        );
      }
      `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
      if (!ֆǟӄʊʀǟ.isReply) {
        var 𝓜Usage = ꜱɪᴛʀᴀᴘ.get(ֆǟӄʊʀǟ.commandName);
        var ᴍɪᴢᴜᴋɪᴍᴏʀᴇ =
          𝓜Usage.ֆǟӄʊʀǟӄǟɨʐօ === undefined ? `Null` : 𝓜Usage.ֆǟӄʊʀǟӄǟɨʐօ;
        const ᴀʀɢᴜᴍᴇɴᴛ = require(`../../Sakura🛰️Server/ɴᴇᴇᴅᴀʀɢᴜᴍᴇɴᴛ`);
        return ᴀʀɢᴜᴍᴇɴᴛ.ɴᴇᴇᴅᴀʀɢᴜᴍᴇɴᴛ(
          ӄʀǟӄɨռʐ,
          chat,
          ֆǟӄʊʀǟ,
          աɦօֆɛռȶɦǟȶ,
          աɦօֆɛռȶɦǟȶռʊʍ,
          ֆǟӄʊʀǟ.commandName,
          ᴍɪᴢᴜᴋɪᴍᴏʀᴇ
        );
      }
      `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
      if (ֆǟӄʊʀǟ.isReply) {
        var Receiver = chat.message.extendedTextMessage.contextInfo.participant;
        var քɛʀֆօռɢօȶռʊʍ = Receiver.substring(0, Receiver.length - 15);
        var աɦօֆɛռȶɦǟȶ = ֆǟӄʊʀǟ.sender;
        var աɦօֆɛռȶɦǟȶռʊʍ = աɦօֆɛռȶɦǟȶ.substring(0, աɦօֆɛռȶɦǟȶ.length - 15);
        `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
        if (Receiver === աɦօֆɛռȶɦǟȶ) {
          return Sakura_Buttons.MTB(
            ӄʀǟӄɨռʐ,
            chat,
            ֆǟӄʊʀǟ,
            `🦋𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 @${աɦօֆɛռȶɦǟȶռʊʍ}, 

╔════◇🔒𝐏𝐞𝐫𝐦𝐢𝐬𝐬𝐢𝐨𝐧 
║❌ 𝗘𝗿𝗿𝗼𝗿: _can't rob your own bank!_
╚════════════╝`
          );
        }
        `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
        await Robbery.findOne(
          {
            ID: Receiver,
          },
          async (Error, Victim) => {
            if (Error) return ꜰᴜᴄᴋ.catch(Error, ӄʀǟӄɨռʐ, ֆǟӄʊʀǟ, chat);
            if (!Victim) {
              var newUser = new Robbery({
                ID: Receiver,
                padlock: 0,
                sword: 0,
                laptop: 0,
                charm: 0,
                CurrentRobberyTime: 0,
                PermanentRobberyTime: 3600000,
              });
              await newUser
                .save()
                .catch((Error) => ꜰᴜᴄᴋ.catch(Error, ӄʀǟӄɨռʐ, ֆǟӄʊʀǟ, chat));
              return Sakura_Buttons.MTB(
                ӄʀǟӄɨռʐ,
                chat,
                ֆǟӄʊʀǟ,
                `🦋𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 @${աɦօֆɛռȶɦǟȶռʊʍ}, 

╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
┊ 
╚═══◇║
╔═══◇║🔱𝐂𝐨𝐦𝐦𝐚𝐧𝐝: _${ᴋᴇɪ}${FinalName}_
║
║❌ 𝗘𝗿𝗿𝗼𝗿: @${քɛʀֆօռɢօȶռʊʍ}'s Bank Police Caught You and Took You To The Jail!
╚════════════╝`
              );
            }
            `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
            await Robbery.findOne(
              {
                ID: աɦօֆɛռȶɦǟȶ,
              },
              async (Error, Culprit) => {
                if (Error) return ꜰᴜᴄᴋ.catch(Error, ӄʀǟӄɨռʐ, ֆǟӄʊʀǟ, chat);
                if (!Culprit) {
                  var newUser = new Robbery({
                    ID: աɦօֆɛռȶɦǟȶ,
                    padlock: 0,
                    sword: 0,
                    laptop: 0,
                    charm: 0,
                    CurrentRobberyTime: 0,
                    PermanentRobberyTime: 3600000,
                  });
                  await newUser
                    .save()
                    .catch((Error) => ꜰᴜᴄᴋ.catch(Error, ӄʀǟӄɨռʐ, ֆǟӄʊʀǟ, chat));
                  return Sakura_Buttons.MIB(
                    ӄʀǟӄɨռʐ,
                    chat,
                    ֆǟӄʊʀǟ,
                    `🦋𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 @${աɦօֆɛռȶɦǟȶռʊʍ}, 

╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
┊ 
╚═══◇║
╔═══◇║🔱𝐂𝐨𝐦𝐦𝐚𝐧𝐝: _${ᴋᴇɪ}${FinalName}_
║
║❌ 𝗘𝗿𝗿𝗼𝗿: You are the worst robber. Fell On a pool and k/o!
╚════════════╝`
                  );
                }
                `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
                await Robbery.findOne(
                  {
                    ID: աɦօֆɛռȶɦǟȶ,
                  },
                  async (Error, Culprit) => {
                    if (Error) return ꜰᴜᴄᴋ.catch(Error, ӄʀǟӄɨռʐ, ֆǟӄʊʀǟ, chat);
                    await Robbery.findOne(
                      {
                        ID: Receiver,
                      },
                      async (Error, Victim) => {
                        if (Error)
                          return ꜰᴜᴄᴋ.catch(Error, ӄʀǟӄɨռʐ, ֆǟӄʊʀǟ, chat);
                        if (Culprit && Victim) {
                          await Economy.findOne(
                            {
                              ID: աɦօֆɛռȶɦǟȶ,
                            },
                            async (Error, CulpritEconomy) => {
                              if (Error)
                                return ꜰᴜᴄᴋ.catch(Error, ӄʀǟӄɨռʐ, ֆǟӄʊʀǟ, chat);
                              if (!CulpritEconomy) {
                                var newUser = new Economy({
                                  ID: աɦօֆɛռȶɦǟȶ,
                                  money: 0,
                                  daily: 0,
                                  timeout: 86400000,
                                  fishdone: 0,
                                  fishtimeout: 1800000,
                                  workdone: 0,
                                  worktimeout: 900000,
                                });
                                await newUser
                                  .save()
                                  .catch((Error) =>
                                    ꜰᴜᴄᴋ.catch(Error, ӄʀǟӄɨռʐ, ֆǟӄʊʀǟ, chat)
                                  );
                                return Sakura_Buttons.MTB(
                                  ӄʀǟӄɨռʐ,
                                  chat,
                                  ֆǟӄʊʀǟ,
                                  `🦋𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 @${աɦօֆɛռȶɦǟȶռʊʍ}, 

╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
┊ 
╚═══◇║
╔═══◇║🔱𝐂𝐨𝐦𝐦𝐚𝐧𝐝: _${ᴋᴇɪ}${FinalName}_
║
║❌ 𝗘𝗿𝗿𝗼𝗿: _You Will Need Atleast 1000 in your bank before you can rob someone!_
║🍌‍ 𝗥𝗲𝗮𝘀𝗼𝗻: _If You Get Caught, victim will charge you money to spare your life._
╚════════════╝`
                                );
                              } else {
                                await Economy.findOne(
                                  {
                                    ID: Receiver,
                                  },
                                  async (Error, VictimEconomy) => {
                                    if (Error)
                                      return ꜰᴜᴄᴋ.catch(
                                        Error,
                                        ӄʀǟӄɨռʐ,
                                        ֆǟӄʊʀǟ,
                                        chat
                                      );
                                    if (!VictimEconomy) {
                                      var newUser = new Economy({
                                        ID: Receiver,
                                        money: 0,
                                        daily: 0,
                                        timeout: 86400000,
                                        fishdone: 0,
                                        fishtimeout: 1800000,
                                        workdone: 0,
                                        worktimeout: 900000,
                                      });
                                      await newUser
                                        .save()
                                        .catch((Error) =>
                                          ꜰᴜᴄᴋ.catch(
                                            Error,
                                            ӄʀǟӄɨռʐ,
                                            ֆǟӄʊʀǟ,
                                            chat
                                          )
                                        );
                                      return Sakura_Buttons.MTB(
                                        ӄʀǟӄɨռʐ,
                                        chat,
                                        ֆǟӄʊʀǟ,
                                        `🦋𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 @${աɦօֆɛռȶɦǟȶռʊʍ}, 

╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
┊ 
╚═══◇║
╔═══◇║🔱𝐂𝐨𝐦𝐦𝐚𝐧𝐝: _${ᴋᴇɪ}${FinalName}_
║
║❌ 𝗘𝗿𝗿𝗼𝗿: @${քɛʀֆօռɢօȶռʊʍ} _caught You Red Handed and Sent You To The Jail!_
╚════════════╝`
                                      );
                                    } else {
                                      `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
                                      const MoneyRobbed =
                                        Math.floor(
                                          Math.random() * (1000 - 50 + 1)
                                        ) + 50;
                                      const LaptopRem =
                                        Math.floor(
                                          Math.random() * (500 - 250 + 1)
                                        ) + 250;
                                      const charmRem =
                                        Math.floor(
                                          Math.random() * (800 - 350 + 1)
                                        ) + 350;
                                      const PadLockRem =
                                        Math.floor(
                                          Math.random() * (100 - 50 + 1)
                                        ) + 50;
                                      const swordRem =
                                        Math.floor(
                                          Math.random() * (200 - 50 + 1)
                                        ) + 50;
                                      `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
                                      if (
                                        Culprit.PermanentRobberyTime -
                                          (Date.now() -
                                            Culprit.CurrentRobberyTime) >
                                        0
                                      ) {
                                        let time = ms(
                                          Culprit.PermanentRobberyTime -
                                            (Date.now() -
                                              Culprit.CurrentRobberyTime)
                                        );
                                        return Sakura_Buttons.MTB(
                                          ӄʀǟӄɨռʐ,
                                          chat,
                                          ֆǟӄʊʀǟ,
                                          `🦋𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 @${աɦօֆɛռȶɦǟȶռʊʍ},
╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
┊ 
╚═══◇║
╔═══◇║🔱𝐂𝐨𝐦𝐦𝐚𝐧𝐝: _${ᴋᴇɪ}${FinalName}_
║
║❌ 𝗘𝗿𝗿𝗼𝗿: _You've Recently Tried Robbing Someone!._
║🕐 𝐑𝐨𝐛 𝗔𝗴𝗮𝗶𝗻: _${time.minutes}m ${time.seconds}s._
╚════════════╝`
                                        );
                                      }
                                      `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
                                      if (VictimEconomy.money < 1000) {
                                        return Sakura_Buttons.MTB(
                                          ӄʀǟӄɨռʐ,
                                          chat,
                                          ֆǟӄʊʀǟ,
                                          `🦋𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 @${աɦօֆɛռȶɦǟȶռʊʍ}, 

╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
┊ 
╚═══◇║
╔═══◇║🔱𝐂𝐨𝐦𝐦𝐚𝐧𝐝: _${ᴋᴇɪ}${FinalName}_
║
║❌ 𝗘𝗿𝗿𝗼𝗿: @${քɛʀֆօռɢօȶռʊʍ}, _needs atleast 1000coins in their account before you can rob them!_
║🍌‍ 𝗥𝗲𝗮𝘀𝗼𝗻: _Broke AF! Leave This Begger Alone!_
╚════════════╝`
                                        );
                                      }
                                      `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
                                      if (CulpritEconomy.money < 1000) {
                                        return Sakura_Buttons.MTB(
                                          ӄʀǟӄɨռʐ,
                                          chat,
                                          ֆǟӄʊʀǟ,
                                          `🦋𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 @${աɦօֆɛռȶɦǟȶռʊʍ}, 

╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
┊ 
╚═══◇║
╔═══◇║🔱𝐂𝐨𝐦𝐦𝐚𝐧𝐝: _${ᴋᴇɪ}${FinalName}_
║
║❌ 𝗘𝗿𝗿𝗼𝗿: _You Will Need Atleast 1000 in your bank before you can rob someone!_
║🍌‍ 𝗥𝗲𝗮𝘀𝗼𝗻: _If You Get Caught, victim will charge you money to spare your life._
╚════════════╝`
                                        );
                                      }
                                      `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
                                      if (Victim.padlock === 1) {
                                        Victim.padlock = 0;
                                        CulpritEconomy.money =
                                          CulpritEconomy.money - PadLockRem;
                                        Culprit.CurrentRobberyTime = Date.now();
                                        await Victim.save().catch((Error) =>
                                          ꜰᴜᴄᴋ.catch(
                                            Error,
                                            ӄʀǟӄɨռʐ,
                                            ֆǟӄʊʀǟ,
                                            chat
                                          )
                                        );
                                        await Culprit.save().catch((Error) =>
                                          ꜰᴜᴄᴋ.catch(
                                            Error,
                                            ӄʀǟӄɨռʐ,
                                            ֆǟӄʊʀǟ,
                                            chat
                                          )
                                        );
                                        return Sakura_Buttons.MTB(
                                          ӄʀǟӄɨռʐ,
                                          chat,
                                          ֆǟӄʊʀǟ,
                                          `🦋𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 @${աɦօֆɛռȶɦǟȶռʊʍ}, 

╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
┊ 
╚═══◇║
╔═══◇║🔱𝐂𝐨𝐦𝐦𝐚𝐧𝐝: _${ᴋᴇɪ}${FinalName}_
║
║❌ 𝗘𝗿𝗿𝗼𝗿: @${քɛʀֆօռɢօȶռʊʍ} _had a 🔒padlock in their bank!_
║👮🏽‍ 𝐒𝐭𝐚𝐭𝐮𝐬: _You Got Arrested!_
║💰 𝗧𝗼𝘁𝗮𝗹 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${CulpritEconomy.money}coins_
╚════════════╝`
                                        );
                                        `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
                                      }
                                      if (Victim.sword === 1) {
                                        Victim.sword = 0;
                                        CulpritEconomy.money =
                                          CulpritEconomy.money - swordRem;
                                        Culprit.CurrentRobberyTime = Date.now();
                                        await Victim.save().catch((Error) =>
                                          ꜰᴜᴄᴋ.catch(
                                            Error,
                                            ӄʀǟӄɨռʐ,
                                            ֆǟӄʊʀǟ,
                                            chat
                                          )
                                        );
                                        await Culprit.save().catch((Error) =>
                                          ꜰᴜᴄᴋ.catch(
                                            Error,
                                            ӄʀǟӄɨռʐ,
                                            ֆǟӄʊʀǟ,
                                            chat
                                          )
                                        );
                                        return Sakura_Buttons.MTB(
                                          ӄʀǟӄɨռʐ,
                                          chat,
                                          ֆǟӄʊʀǟ,
                                          `🦋𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 @${աɦօֆɛռȶɦǟȶռʊʍ}, 

╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
┊ 
╚═══◇║
╔═══◇║🔱𝐂𝐨𝐦𝐦𝐚𝐧𝐝: _${ᴋᴇɪ}${FinalName}_
║
║❌ 𝗘𝗿𝗿𝗼𝗿: @${քɛʀֆօռɢօȶռʊʍ} _had a powerful ⚔️sword that killed you!_
║👮🏽‍ 𝐒𝐭𝐚𝐭𝐮𝐬: You Got Arrested!
║💰 𝗧𝗼𝘁𝗮𝗹 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${CulpritEconomy.money}coins_
╚════════════╝`
                                        );
                                        `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
                                      }
                                      if (Victim.laptop === 1) {
                                        Victim.laptop = 0;
                                        CulpritEconomy.money =
                                          CulpritEconomy.money - LaptopRem;
                                        Culprit.CurrentRobberyTime = Date.now();
                                        await Victim.save().catch((Error) =>
                                          ꜰᴜᴄᴋ.catch(
                                            Error,
                                            ӄʀǟӄɨռʐ,
                                            ֆǟӄʊʀǟ,
                                            chat
                                          )
                                        );
                                        await Culprit.save().catch((Error) =>
                                          ꜰᴜᴄᴋ.catch(
                                            Error,
                                            ӄʀǟӄɨռʐ,
                                            ֆǟӄʊʀǟ,
                                            chat
                                          )
                                        );
                                        return Sakura_Buttons.MTB(
                                          ӄʀǟӄɨռʐ,
                                          chat,
                                          ֆǟӄʊʀǟ,
                                          `🦋𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 @${աɦօֆɛռȶɦǟȶռʊʍ}, 

╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
┊ 
╚═══◇║
╔═══◇║🔱𝐂𝐨𝐦𝐦𝐚𝐧𝐝: _${ᴋᴇɪ}${FinalName}_
║
║❌ 𝗘𝗿𝗿𝗼𝗿: @${քɛʀֆօռɢօȶռʊʍ} _had a 💻laptop that caught you digitally-robbing!_
║👮🏽‍ 𝐒𝐭𝐚𝐭𝐮𝐬: _You Got Arrested!_
║💰 𝗧𝗼𝘁𝗮𝗹 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${CulpritEconomy.money}coins_
╚════════════╝`
                                        );
                                      } else if (Victim.charm === 1) {
                                        Victim.charm = 0;
                                        CulpritEconomy.money =
                                          CulpritEconomy.money - charmRem;
                                        Culprit.CurrentRobberyTime = Date.now();
                                        await Victim.save().catch((Error) =>
                                          ꜰᴜᴄᴋ.catch(
                                            Error,
                                            ӄʀǟӄɨռʐ,
                                            ֆǟӄʊʀǟ,
                                            chat
                                          )
                                        );
                                        await Culprit.save().catch((Error) =>
                                          ꜰᴜᴄᴋ.catch(
                                            Error,
                                            ӄʀǟӄɨռʐ,
                                            ֆǟӄʊʀǟ,
                                            chat
                                          )
                                        );
                                        return Sakura_Buttons.MTB(
                                          ӄʀǟӄɨռʐ,
                                          chat,
                                          ֆǟӄʊʀǟ,
                                          `🦋𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 @${աɦօֆɛռȶɦǟȶռʊʍ}, 

╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
┊ 
╚═══◇║
╔═══◇║🔱𝐂𝐨𝐦𝐦𝐚𝐧𝐝: _${ᴋᴇɪ}${FinalName}_
║
║❌ 𝗘𝗿𝗿𝗼𝗿: @${քɛʀֆօռɢօȶռʊʍ} had a 🔮charm that magically saved their bank!
║👮🏽‍ 𝐒𝐭𝐚𝐭𝐮𝐬: _You Got Arrested!_
║💰 𝗧𝗼𝘁𝗮𝗹 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${CulpritEconomy.money}coins_
╚════════════╝`
                                        );
                                      }
                                      `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
                                      VictimEconomy.money =
                                        VictimEconomy.money - MoneyRobbed;
                                      CulpritEconomy.money =
                                        CulpritEconomy.money + MoneyRobbed;
                                      Culprit.CurrentRobberyTime = Date.now();
                                      await Victim.save().catch((Error) =>
                                        ꜰᴜᴄᴋ.catch(Error, ӄʀǟӄɨռʐ, ֆǟӄʊʀǟ, chat)
                                      );
                                      await Culprit.save().catch((Error) =>
                                        ꜰᴜᴄᴋ.catch(Error, ӄʀǟӄɨռʐ, ֆǟӄʊʀǟ, chat)
                                      );
                                      return Sakura_Buttons.MTB(
                                        ӄʀǟӄɨռʐ,
                                        chat,
                                        ֆǟӄʊʀǟ,
                                        `🦋𝐊𝐨𝐧𝐢𝐜𝐡𝐢𝐰𝐚 @${աɦօֆɛռȶɦǟȶռʊʍ}, 

╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
┊ 
╚═══◇║
╔═══◇║🔱𝐂𝐨𝐦𝐦𝐚𝐧𝐝: _${ᴋᴇɪ}${FinalName}_
║
║🔓 𝐒𝐭𝐚𝐭𝐮𝐬: @${քɛʀֆօռɢօȶռʊʍ} _Got Robbed!_
╚════════════╝


╔════◇ 🥸𝐂𝐮𝐥𝐩𝐫𝐢𝐭: @${քɛʀֆօռɢօȶռʊʍ}
║
║❓ 𝗕𝗲𝗳𝗼𝗿𝗲 𝗥𝗼𝗯𝗯𝗲𝗿𝘆: _${CulpritEconomy.money}coins_
║💸 𝗔𝗳𝘁𝗲𝗿 𝗥𝗼𝗯𝗯𝗲𝗿𝘆: _${CulpritEconomy.money + MoneyRobbed}coins_
║
╚═══◇║
╔═══◇║💀𝐕𝐢𝐜𝐭𝐢𝐦: @${քɛʀֆօռɢօȶռʊʍ}
║
║❓ 𝗕𝗲𝗳𝗼𝗿𝗲 𝗥𝗼𝗯𝗯𝗲𝗿𝘆: _${VictimEconomy.money}coins_
║🥲 𝗔𝗳𝘁𝗲𝗿 𝗥𝗼𝗯𝗯𝗲𝗿𝘆: _${VictimEconomy.money - MoneyRobbed}coins_
╚════════════╝`
                                      );
                                    }
                                  }
                                );
                              }
                            }
                          );
                        }
                      }
                    );
                  }
                );
              }
            );
          }
        );
        `|⬡════════════════════════════════════════════|  ™𝐊𝐫𝐚𝐤𝐢𝐧𝐳𝐋𝐚𝐛🍹𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭(𝐜) |════════════════════════════════════════════⬡|`;
      } else {
        var 𝓜Usage = ꜱɪᴛʀᴀᴘ.get(ֆǟӄʊʀǟ.commandName);
        var ᴍɪᴢᴜᴋɪᴍᴏʀᴇ =
          𝓜Usage.ֆǟӄʊʀǟӄǟɨʐօ === undefined ? `Null` : 𝓜Usage.ֆǟӄʊʀǟӄǟɨʐօ;
        const ᴀʀɢᴜᴍᴇɴᴛ = require(`../../Sakura🛰️Server/ɴᴇᴇᴅᴀʀɢᴜᴍᴇɴᴛ`);
        return ᴀʀɢᴜᴍᴇɴᴛ.ɴᴇᴇᴅᴀʀɢᴜᴍᴇɴᴛ(
          ӄʀǟӄɨռʐ,
          chat,
          ֆǟӄʊʀǟ,
          աɦօֆɛռȶɦǟȶ,
          աɦօֆɛռȶɦǟȶռʊʍ,
          ֆǟӄʊʀǟ.commandName,
          ᴍɪᴢᴜᴋɪᴍᴏʀᴇ
        );
      }
    } catch (Error) {
      ꜰᴜᴄᴋ.catch(Error, ӄʀǟӄɨռʐ, ֆǟӄʊʀǟ, chat);
      return;
    }
  },
};
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
`|                                                                                                                        |`;
`|        (𝐜)𝐒𝐚𝐤𝐮𝐫𝐚𝐁𝐨𝐭 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!            |`;
`|                                                                                                                        |`;
`|⬡════════════════════════════════════════════|                            |═══════════════════════════════════════════⬡|`;
