("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
 * * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
 */
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
function _0x4c45(_0x11751f, _0x4ba99e) {
  const _0x3d0a6a = _0x3d0a();
  return (
    (_0x4c45 = function (_0x4c4522, _0x19d706) {
      _0x4c4522 = _0x4c4522 - 0x153;
      let _0x46e424 = _0x3d0a6a[_0x4c4522];
      return _0x46e424;
    }),
    _0x4c45(_0x11751f, _0x4ba99e)
  );
}
const _0x4c3e45 = _0x4c45;
(function (_0x108391, _0x4f428c) {
  const _0x2d733a = _0x4c45,
    _0x1b612c = _0x108391();
  while (!![]) {
    try {
      const _0x1e980e =
        parseInt(_0x2d733a(0x164)) / 0x1 +
        parseInt(_0x2d733a(0x168)) / 0x2 +
        parseInt(_0x2d733a(0x16d)) / 0x3 +
        parseInt(_0x2d733a(0x15e)) / 0x4 +
        (-parseInt(_0x2d733a(0x169)) / 0x5) *
          (-parseInt(_0x2d733a(0x167)) / 0x6) +
        (-parseInt(_0x2d733a(0x16f)) / 0x7) *
          (-parseInt(_0x2d733a(0x156)) / 0x8) +
        (-parseInt(_0x2d733a(0x16a)) / 0x9) *
          (parseInt(_0x2d733a(0x16e)) / 0xa);
      if (_0x1e980e === _0x4f428c) break;
      else _0x1b612c["push"](_0x1b612c["shift"]());
    } catch (_0x4af1ee) {
      _0x1b612c["push"](_0x1b612c["shift"]());
    }
  }
})(_0x3d0a, 0x587ff),
  require(_0x4c3e45(0x162));
function _0x3d0a() {
  const _0x583191 = [
    "slice",
    "2435048UxjGeq",
    "../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Video_Button",
    "unofficial-carbon-now",
    "../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Image_Button",
    "../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/𝕷𝖆ყO𝖚𝖙",
    "../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Group_Only",
    "479847hNbuiz",
    "child_process",
    "../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Sender_Not_Admin",
    "216ZdgKdW",
    "986374mIicbn",
    "98270OKEwZW",
    "54YfWiGm",
    "mailist",
    "axios",
    "1181010BusZzg",
    "4136240iVePTZ",
    "1128603UfNcYF",
    "quick.db",
    "../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Bot_Not_Admin",
    "basename",
    "../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Caught",
    "8swBGOa",
    "hxz-api",
    "../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/ɴᴇᴄᴛᴏʀ",
    "toLowerCase",
    "path",
    "util",
    "canvacord",
  ];
  _0x3d0a = function () {
    return _0x583191;
  };
  return _0x3d0a();
}
let {
    isUrl,
    fetchJson,
    getBuffer,
    jsonformat,
    GIFBufferToVideoBuffer,
    getRandom,
  } = require(_0x4c3e45(0x158)),
  fs = require("fs"),
  util = require(_0x4c3e45(0x15b)),
  hxz = require(_0x4c3e45(0x157)),
  chalk = require("chalk"),
  db = require(_0x4c3e45(0x170)),
  axios = require(_0x4c3e45(0x16c)),
  canvacord = require(_0x4c3e45(0x15c)),
  { Character } = require(_0x4c3e45(0x16b)),
  moment = require("moment-timezone"),
  Carbon = require(_0x4c3e45(0x160)),
  { exec, execSync } = require(_0x4c3e45(0x165)),
  { N𝖊𝖊𝖉__A𝖗𝖌𝖘 } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/N𝖊𝖊𝖉__A𝖗𝖌𝖘"),
  { Sticker, StickerTypes } = require("wa-sticker-formatter"),
  { Group_Only } = require(_0x4c3e45(0x163)),
  { Image_Button } = require(_0x4c3e45(0x161)),
  { Video_Button } = require(_0x4c3e45(0x15f)),
  { Bot_Not_Admin } = require(_0x4c3e45(0x153)),
  { Sender_Not_Admin } = require(_0x4c3e45(0x166)),
  Present_Path = require(_0x4c3e45(0x15a)),
  Script_Name = Present_Path[_0x4c3e45(0x154)](__filename),
  Final_Name = Script_Name[_0x4c3e45(0x15d)](0x0, -0x3)[_0x4c3e45(0x159)](),
  { Caught } = require(_0x4c3e45(0x155));
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
exports.fact = async (
  ᴋᴜɴᴀɪ,
  Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
  A𝖗𝖌𝖘,
  pushName,
  fromMe,
  F𝖚𝖑𝖑_A𝖗𝖌𝖘,
  quoted,
  isMedia,
  isGroup,
  groupMetadata,
  groupName,
  participants,
  groupAdmins,
  isBotAdmin,
  isSenderAdmin,
  isSenderTUF,
  commandName,
  body,
  isReply,
  mentionByTag,
  mentionByReply
) => {
  let 𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆 = Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata;
  ("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
  await axios.get(`https://nekos.life/api/v2/fact`).then(async (response) => {
    return await Image_Button(
      ᴋᴜɴᴀɪ,
      Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
      A𝖗𝖌𝖘,
      "./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.png",
      `📛 *Fact:* ${response.data.fact}`
    );
  });
};
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
 * * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
 */
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
