("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
* * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
*/
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
const _0x277c3e = _0x30c5;
function _0x72aa() {
const _0x5b2e1c = [
"wa-sticker-formatter",
"path",
"unofficial-carbon-now",
"11GGtOfV",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Sender_Not_Admin",
"chalk",
"mailist",
"toLowerCase",
"29144520hCbhvq",
"1168vUhEzZ",
"380dqcFQv",
"quick.db",
"5457Ymgbix",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/ɴᴇᴄᴛᴏʀ",
"child_process",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Bot_Not_Admin",
"820770miRuFo",
"slice",
"basename",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Video_Button",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/𝕷𝖆ყO𝖚𝖙",
"472Swajbl",
"220QwYSsK",
"17226KDPNbY",
"moment-timezone",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/N𝖊𝖊𝖉__A𝖗𝖌𝖘",
"11081AUCLXD",
"hxz-api",
"node-fetch",
"499103SVagWr",
"axios",
"224226CqZgEu",
];
_0x72aa = function () {
return _0x5b2e1c;
};
return _0x72aa();
}
(function (_0xc2c633, _0x1b52ea) {
const _0x1a6855 = _0x30c5,
_0x5b21d1 = _0xc2c633();
while (!![]) {
try {
const _0x23d7b6 =
-parseInt(_0x1a6855(0x168)) / 0x1 +
-parseInt(_0x1a6855(0x15b)) / 0x2 +
(-parseInt(_0x1a6855(0x177)) / 0x3) *
(parseInt(_0x1a6855(0x160)) / 0x4) +
(-parseInt(_0x1a6855(0x175)) / 0x5) *
(parseInt(_0x1a6855(0x162)) / 0x6) +
(parseInt(_0x1a6855(0x165)) / 0x7) *
(-parseInt(_0x1a6855(0x174)) / 0x8) +
(parseInt(_0x1a6855(0x16a)) / 0x9) *
(-parseInt(_0x1a6855(0x161)) / 0xa) +
(-parseInt(_0x1a6855(0x16e)) / 0xb) *
(-parseInt(_0x1a6855(0x173)) / 0xc);
if (_0x23d7b6 === _0x1b52ea) break;
else _0x5b21d1["push"](_0x5b21d1["shift"]());
} catch (_0x488710) {
_0x5b21d1["push"](_0x5b21d1["shift"]());
}
}
})(_0x72aa, 0x4afd6),
require(_0x277c3e(0x15f));
function _0x30c5(_0x386287, _0x4c4e5e) {
const _0x72aaab = _0x72aa();
return (
(_0x30c5 = function (_0x30c5a0, _0x5d33cf) {
_0x30c5a0 = _0x30c5a0 - 0x15a;
let _0x49422b = _0x72aaab[_0x30c5a0];
return _0x49422b;
}),
_0x30c5(_0x386287, _0x4c4e5e)
);
}
let {
isUrl,
fetchJson,
getBuffer,
jsonformat,
GIFBufferToVideoBuffer,
getRandom,
} = require(_0x277c3e(0x178)),
fs = require("fs"),
util = require("util"),
hxz = require(_0x277c3e(0x166)),
chalk = require(_0x277c3e(0x170)),
db = require(_0x277c3e(0x176)),
axios = require(_0x277c3e(0x169)),
Fetch = require(_0x277c3e(0x167)),
canvacord = require("canvacord"),
{ Character } = require(_0x277c3e(0x171)),
moment = require(_0x277c3e(0x163)),
Carbon = require(_0x277c3e(0x16d)),
{ exec, execSync } = require(_0x277c3e(0x179)),
{ N𝖊𝖊𝖉__A𝖗𝖌𝖘 } = require(_0x277c3e(0x164)),
{ Sticker, StickerTypes } = require(_0x277c3e(0x16b)),
{ Group_Only } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Group_Only"),
{ Image_Button } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Image_Button"),
{ Video_Button } = require(_0x277c3e(0x15e)),
{ Bot_Not_Admin } = require(_0x277c3e(0x15a)),
{ Sender_Not_Admin } = require(_0x277c3e(0x16f)),
Present_Path = require(_0x277c3e(0x16c)),
Script_Name = Present_Path[_0x277c3e(0x15d)](__filename),
Final_Name = Script_Name[_0x277c3e(0x15c)](0x0, -0x3)[_0x277c3e(0x172)](),
{ Caught } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Caught");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
exports.meme = async (
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
pushName,
fromMe,
F𝖚𝖑𝖑_A𝖗𝖌𝖘,
quoted,
isMedia,
isGroup,
groupMetadata,
groupName,
participants,
groupAdmins,
isBotAdmin,
isSenderAdmin,
isSenderTUF,
commandName,
body,
isReply,
mentionByTag,
mentionByReply
) => {
if (!Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup) return await Group_Only(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊);
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
let Reds = ["memes", "me_irl", "dankmemes", "comedyheaven", "Animemes"];
let Rads = Reds[Math.floor(Math.random() * Reds.length)];
let res = await Fetch(`https://www.reddit.com/r/${Rads}/random/.json`);
let json = await res.json();
if (!json[0]) {
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.png",
`_Your Life Lmfao!_`
);
}
let data = json[0].data.children[0].data;
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
data.url,
`🥪𝗧𝗶𝘁𝗹𝗲: ${data.title}
✒️𝗔𝘂𝘁𝗵𝗼𝗿: ${data.author}
👍🏽‍𝗨𝗽𝘀: ${data.ups || 0} 👍
👎🏽‍𝗗𝗼𝘄𝗻𝘀: ${data.downs || 0} 👎
💬𝗖𝗼𝗺𝗺𝗲𝗻𝘁𝘀: ${data.num_comments || 0} 💬
🔎𝗟𝗶𝗻𝗸: https://reddit.com${data.permalink}`
);
};
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
* * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
*/
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
