("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
* * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
*/
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
const _0x46916b = _0x134a;
function _0x24ed() {
const _0x4c8098 = [
"child_process",
"toLowerCase",
"2zpDbXZ",
"112oQHuBs",
"145161AHQUoP",
"62772ljXIrd",
"wa-sticker-formatter",
"canvacord",
"2581445gpJqJM",
"moment-timezone",
"quick.db",
"unofficial-carbon-now",
"1314656jWgPQg",
"1353ZPbNqH",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Caught",
"6xkievX",
"6DKiXYP",
"521696tLasHL",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Image_Button",
"hxz-api",
"chalk",
"basename",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Video_Button",
"path",
"slice",
"util",
"330230JAjKgR",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/N𝖊𝖊𝖉__A𝖗𝖌𝖘",
"98068hUTqUX",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/𝕷𝖆ყO𝖚𝖙",
];
_0x24ed = function () {
return _0x4c8098;
};
return _0x24ed();
}
function _0x134a(_0x4e751d, _0x21ce09) {
const _0x24edb4 = _0x24ed();
return (
(_0x134a = function (_0x134aae, _0x237b15) {
_0x134aae = _0x134aae - 0xce;
let _0x20167a = _0x24edb4[_0x134aae];
return _0x20167a;
}),
_0x134a(_0x4e751d, _0x21ce09)
);
}
(function (_0x3f29f4, _0x369329) {
const _0xc720f0 = _0x134a,
_0x4a209d = _0x3f29f4();
while (!![]) {
try {
const _0x2bd186 =
(parseInt(_0xc720f0(0xdc)) / 0x1) * (parseInt(_0xc720f0(0xeb)) / 0x2) +
(parseInt(_0xc720f0(0xea)) / 0x3) * (parseInt(_0xc720f0(0xd8)) / 0x4) +
(-parseInt(_0xc720f0(0xe2)) / 0x5) * (parseInt(_0xc720f0(0xe9)) / 0x6) +
-parseInt(_0xc720f0(0xe6)) / 0x7 +
(-parseInt(_0xc720f0(0xdd)) / 0x8) * (parseInt(_0xc720f0(0xde)) / 0x9) +
parseInt(_0xc720f0(0xd6)) / 0xa +
(-parseInt(_0xc720f0(0xe7)) / 0xb) * (-parseInt(_0xc720f0(0xdf)) / 0xc);
if (_0x2bd186 === _0x369329) break;
else _0x4a209d["push"](_0x4a209d["shift"]());
} catch (_0x1dadca) {
_0x4a209d["push"](_0x4a209d["shift"]());
}
}
})(_0x24ed, 0x4d74f),
require(_0x46916b(0xd9));
let {
isUrl,
fetchJson,
getBuffer,
jsonformat,
GIFBufferToVideoBuffer,
getRandom,
} = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/ɴᴇᴄᴛᴏʀ"),
fs = require("fs"),
util = require(_0x46916b(0xd5)),
hxz = require(_0x46916b(0xcf)),
chalk = require(_0x46916b(0xd0)),
db = require(_0x46916b(0xe4)),
axios = require("axios"),
canvacord = require(_0x46916b(0xe1)),
{ Character } = require("mailist"),
moment = require(_0x46916b(0xe3)),
Carbon = require(_0x46916b(0xe5)),
{ exec, execSync } = require(_0x46916b(0xda)),
{ N𝖊𝖊𝖉__A𝖗𝖌𝖘 } = require(_0x46916b(0xd7)),
{ Sticker, StickerTypes } = require(_0x46916b(0xe0)),
{ Group_Only } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Group_Only"),
{ Image_Button } = require(_0x46916b(0xce)),
{ Video_Button } = require(_0x46916b(0xd2)),
{ Bot_Not_Admin } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Bot_Not_Admin"),
{ Sender_Not_Admin } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Sender_Not_Admin"),
Present_Path = require(_0x46916b(0xd3)),
Script_Name = Present_Path[_0x46916b(0xd1)](__filename),
Final_Name = Script_Name[_0x46916b(0xd4)](0x0, -0x3)[_0x46916b(0xdb)](),
{ Caught } = require(_0x46916b(0xe8));
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
exports.reddit = async (
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
pushName,
fromMe,
F𝖚𝖑𝖑_A𝖗𝖌𝖘,
quoted,
isMedia,
isGroup,
groupMetadata,
groupName,
participants,
groupAdmins,
isBotAdmin,
isSenderAdmin,
isSenderTUF,
commandName,
body,
isReply,
mentionByTag,
mentionByReply
) => {
if (!Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup) return await Group_Only(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊);
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
if (!F𝖚𝖑𝖑_A𝖗𝖌𝖘) {
return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
`*❌ERROR:* No query provided!

*⚡USAGE:* ${prefix}${Final_Name} <Term>`
);
}
let res = await axios.get(
`https://meme-api.herokuapp.com/gimme/` + F𝖚𝖑𝖑_A𝖗𝖌𝖘 + `/`
);
if (!res.data.url) {
if (!F𝖚𝖑𝖑_A𝖗𝖌𝖘) {
return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
`*❌ERROR:* No Such Subreddit!

*⚡USAGE:* ${prefix}${Final_Name} <Term>`
);
}
}
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
res.data.url,
`🖌️ *Title:* ${res.data.title}
*👨‍🎨 Author:* ${res.data.author}
*🎏 Subreddit:* ${res.data.subreddit}
🌐 *Post:* ${res.data.postLink}`
);
};
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
* * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
*/
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
