`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
const _0x83fdc0 = _0x8ac5;
(function (_0x1be987, _0x5e09c3) {
const _0x2462b8 = _0x8ac5,
_0x953194 = _0x1be987();
while (!![]) {
try {
const _0x3a3d3f =
-parseInt(_0x2462b8(0xa7)) / 0x1 +
-parseInt(_0x2462b8(0xb2)) / 0x2 +
(-parseInt(_0x2462b8(0xac)) / 0x3) * (parseInt(_0x2462b8(0xa3)) / 0x4) +
parseInt(_0x2462b8(0xaf)) / 0x5 +
-parseInt(_0x2462b8(0xbb)) / 0x6 +
parseInt(_0x2462b8(0xa4)) / 0x7 +
parseInt(_0x2462b8(0xa2)) / 0x8;
if (_0x3a3d3f === _0x5e09c3) break;
else _0x953194["push"](_0x953194["shift"]());
} catch (_0x1fbd15) {
_0x953194["push"](_0x953194["shift"]());
}
}
})(_0x1b46, 0x39fd4),
require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/𝕷𝖆ყO𝖚𝖙");
function _0x1b46() {
const _0x47031f = [
"toLowerCase",
"1581790yjpKKC",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/ɴᴇᴄᴛᴏʀ",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/N𝖊𝖊𝖉__A𝖗𝖌𝖘",
"740758rncmdK",
"quick.db",
"mailist",
"slice",
"wa-sticker-formatter",
"child_process",
"moment-timezone",
"chalk",
"path",
"1715286CBcLPE",
"hxz-api",
"5963992GLzFUU",
"4024gItNOw",
"3209122jRtRlK",
"basename",
"util",
"317677IOXevU",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Image_Button",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Video_Button",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Bot_Not_Admin",
"../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Sender_Not_Admin",
"921PnBeZi",
"axios",
];
_0x1b46 = function () {
return _0x47031f;
};
return _0x1b46();
}
function _0x8ac5(_0x146d2d, _0x4299ca) {
const _0x1b46ef = _0x1b46();
return (
(_0x8ac5 = function (_0x8ac595, _0x862bfa) {
_0x8ac595 = _0x8ac595 - 0xa1;
let _0x14b06e = _0x1b46ef[_0x8ac595];
return _0x14b06e;
}),
_0x8ac5(_0x146d2d, _0x4299ca)
);
}
let {
isUrl,
fetchJson,
getBuffer,
jsonformat,
GIFBufferToVideoBuffer,
getRandom,
} = require(_0x83fdc0(0xb0)),
fs = require("fs"),
util = require(_0x83fdc0(0xa6)),
hxz = require(_0x83fdc0(0xa1)),
chalk = require(_0x83fdc0(0xb9)),
db = require(_0x83fdc0(0xb3)),
axios = require(_0x83fdc0(0xad)),
canvacord = require("canvacord"),
{ Character } = require(_0x83fdc0(0xb4)),
moment = require(_0x83fdc0(0xb8)),
googleTTS = require("google-tts-api"),
Carbon = require("unofficial-carbon-now"),
{ exec, execSync } = require(_0x83fdc0(0xb7)),
{ N𝖊𝖊𝖉__A𝖗𝖌𝖘 } = require(_0x83fdc0(0xb1)),
{ Sticker, StickerTypes } = require(_0x83fdc0(0xb6)),
{ Group_Only } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Group_Only"),
{ Image_Button } = require(_0x83fdc0(0xa8)),
{ Video_Button } = require(_0x83fdc0(0xa9)),
{ Bot_Not_Admin } = require(_0x83fdc0(0xaa)),
{ Sender_Not_Admin } = require(_0x83fdc0(0xab)),
Present_Path = require(_0x83fdc0(0xba)),
Script_Name = Present_Path[_0x83fdc0(0xa5)](__filename),
Final_Name = Script_Name[_0x83fdc0(0xb5)](0x0, -0x3)[_0x83fdc0(0xae)](),
{ Caught } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Caught");
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
exports.tts = async (
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
pushName,
fromMe,
F𝖚𝖑𝖑_A𝖗𝖌𝖘,
quoted,
isMedia,
isGroup,
groupAdmins,
isBotAdmin,
isSenderAdmin,
isSenderTUF,
commandName,
body,
isReply,
mentionByTag,
mentionByReply
) => {
let 𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆 = Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata;
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
if (!F𝖚𝖑𝖑_A𝖗𝖌𝖘) {
return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
`*❌ERROR:* No query provided!

*⚡USAGE:* ${prefix}${Final_Name} <text>
${prefix}${Final_Name} <text> | <language code>`
);
}
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
let text = "";
let langCode = "en";
for (var i = 0; i < A𝖗𝖌𝖘.length; i++) {
if (A𝖗𝖌𝖘[i] == `=`) {
langCode = A𝖗𝖌𝖘[i + 1];
break;
}
text += A𝖗𝖌𝖘[i] + " ";
}
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
if (text.length > 200) {
return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
`*❌ERROR:* Total characters should be less than 200.!
Total characters for current input were {}.


*⚡USAGE:* ${prefix}${Final_Name} <text>
${prefix}${Final_Name} <text> | <language code>`.format(text.length)
);
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
} else {
const Media = googleTTS.getAudioUrl(text, {
lang: langCode,
slow: false,
host: `https://translate.google.com`,
});
return await ᴋᴜɴᴀɪ.sendMessage(
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.chatID,
{
audio: { url: Media },
contextInfo: {
externalAdReply: {
title: `🔥𝐓𝐞𝐱𝐭 𝟐 𝐒𝐩𝐞𝐞𝐜𝐡`,
body: `ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™`,
mediaType: 2,
thumbnail: await getBuffer(
"https://i.postimg.cc/qBSnwdzq/White.png"
),
mediaUrl: "https://i.postimg.cc/qBSnwdzq/White.png",
},
},
mimetype: `audio/mpeg`,
fileName: `Tts.mp3`,
},
{ quoted: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊 }
);
}
};
`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
