`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/*        
(𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
import { MessageType } from "../../𝐀𝐫𝐜𝐭𝐢𝐱⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/message-type";
import { proto } from "@adiwajshing/baileys";
import Client from "../../𝐀𝐫𝐜𝐭𝐢𝐱⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/client";
import νℓкуяιє from "../../𝐀𝐫𝐜𝐭𝐢𝐱⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/msb";
import ʟᴀʏᴏᴜᴛ from "../../𝐀𝐫𝐜𝐭𝐢𝐱🀄𝐕𝐞𝐧𝐭/ʟᴀʏᴏᴜᴛ";
("|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|");
import * as fs from 'fs';
import path from 'path';
var scriptName = path.basename(__filename);
var dotScrpt = scriptName.slice(0, -3).toLowerCase();
("|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|");
export = {
name: dotScrpt,
async handle(
client: Client,
chat: proto.IWebMessageInfo,
νℓкуяιє: νℓкуяιє,
args: string[],
ӄ𝖗𝖆ӄ𝖎𝖓𝖟𝕷𝖆𝖇
): Promise<void> {
await client.sendMessage(
νℓкуяιє.chatId,
{
quoted: chat.message,
contextInfo: {
mentionedJid: [νℓкуяιє.sender],
},
timestamp: Date(),
image: { url: "./𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞👜𝐁𝐚𝐠/νℓкуяιє.png" },
caption: `╔◇✥𝐔𝐬𝐞𝐫: ${chat.pushName}
║🦋 𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞: _Is an Advance Whatsapp User-Bot!_
║🛰️ 𝐖𝐞𝐛𝐬𝐢𝐭𝐞: _VlkyreAI.krakinzkon.repl.co_
╚◇════════════◇꧂


◇⚡𝐁𝐞𝐥𝐨𝐰 𝐅𝐮𝐥𝐥 𝐋𝐢𝐬𝐭⚡◇
╔⧉༻👇🏽 𝗚𝗮𝗺𝗲𝘀👇🏽
║
║💰 ${ʟᴀʏᴏᴜᴛ.MuveOn}shop
║💰 ${ʟᴀʏᴏᴜᴛ.MuveOn}zoo
║💰 ${ʟᴀʏᴏᴜᴛ.MuveOn}inv
║💰 ${ʟᴀʏᴏᴜᴛ.MuveOn}buy
║💰 ${ʟᴀʏᴏᴜᴛ.MuveOn}pay
║💰 ${ʟᴀʏᴏᴜᴛ.MuveOn}hunt
║💰 ${ʟᴀʏᴏᴜᴛ.MuveOn}gamble
║💰 ${ʟᴀʏᴏᴜᴛ.MuveOn}fish
║💰 ${ʟᴀʏᴏᴜᴛ.MuveOn}daily
║💰 ${ʟᴀʏᴏᴜᴛ.MuveOn}work
║💰 ${ʟᴀʏᴏᴜᴛ.MuveOn}balance
║💰 ${ʟᴀʏᴏᴜᴛ.MuveOn}rob  _(beta)_
║💰 ${ʟᴀʏᴏᴜᴛ.MuveOn}truthdare
╚════════════╝

╔◇👇🏽𝐒𝐞𝐚𝐫𝐜𝐡👇🏽
║  
║🔎 ${ʟᴀʏᴏᴜᴛ.MuveOn}ytsearch
║🔎 ${ʟᴀʏᴏᴜᴛ.MuveOn}lyrics
║🔎 ${ʟᴀʏᴏᴜᴛ.MuveOn}github
║🔎 ${ʟᴀʏᴏᴜᴛ.MuveOn}pinterest
║🔎 ${ʟᴀʏᴏᴜᴛ.MuveOn}weather
║🔎 ${ʟᴀʏᴏᴜᴛ.MuveOn}google 
║🔎 ${ʟᴀʏᴏᴜᴛ.MuveOn}wikipedia
║🔎 ${ʟᴀʏᴏᴜᴛ.MuveOn}ud
║🔎 ${ʟᴀʏᴏᴜᴛ.MuveOn}tenor
║🔎 ${ʟᴀʏᴏᴜᴛ.MuveOn}gif
║🔎 ${ʟᴀʏᴏᴜᴛ.MuveOn}wallpaper
╚════════════╝

╔◇👇🏽𝐃𝐨𝐰𝐧𝐥𝐨𝐚𝐝𝐞𝐫𝐬👇🏽
║  
║📥 ${ʟᴀʏᴏᴜᴛ.MuveOn}play: (80mb max)
║📥 ${ʟᴀʏᴏᴜᴛ.MuveOn}watch: (50mb max)
║📥 ${ʟᴀʏᴏᴜᴛ.MuveOn}soundcloud
║📥 ${ʟᴀʏᴏᴜᴛ.MuveOn}spotify
║📥 ${ʟᴀʏᴏᴜᴛ.MuveOn}gifdl
║📥 ${ʟᴀʏᴏᴜᴛ.MuveOn}imagedl
║📥 ${ʟᴀʏᴏᴜᴛ.MuveOn}videodl
╚════════════╝

╔◇👇🏽𝐅𝐅𝐦𝐩𝐞𝐠👇🏽
║  
║🗂️ ${ʟᴀʏᴏᴜᴛ.MuveOn}tomp3
║🗂️ ${ʟᴀʏᴏᴜᴛ.MuveOn}img2url
║🗂️ ${ʟᴀʏᴏᴜᴛ.MuveOn}ocr
║🗂️ ${ʟᴀʏᴏᴜᴛ.MuveOn}sticker
║🗂️ ${ʟᴀʏᴏᴜᴛ.MuveOn}carbon
║🗂️ ${ʟᴀʏᴏᴜᴛ.MuveOn}tinyurl
╚════════════╝

╔◇👇🏽𝐘𝐨𝐮𝐓𝐮𝐛𝐞+𝐅𝐢𝐥𝐭𝐞𝐫👇🏽
║  
║⭕ ${ʟᴀʏᴏᴜᴛ.MuveOn}yt8d
║⭕ ${ʟᴀʏᴏᴜᴛ.MuveOn}ytbassboost
║⭕ ${ʟᴀʏᴏᴜᴛ.MuveOn}ytecho
║⭕ ${ʟᴀʏᴏᴜᴛ.MuveOn}ytflanger
║⭕ ${ʟᴀʏᴏᴜᴛ.MuveOn}ytnightcore
║⭕ ${ʟᴀʏᴏᴜᴛ.MuveOn}ytphaser
║⭕ ${ʟᴀʏᴏᴜᴛ.MuveOn}ytreverse
║⭕ ${ʟᴀʏᴏᴜᴛ.MuveOn}ytslow
║⭕ ${ʟᴀʏᴏᴜᴛ.MuveOn}ytspeed
║⭕ ${ʟᴀʏᴏᴜᴛ.MuveOn}ytsubboost
║⭕ ${ʟᴀʏᴏᴜᴛ.MuveOn}ytsuperslow
║⭕ ${ʟᴀʏᴏᴜᴛ.MuveOn}ytsuperspeed
║⭕ ${ʟᴀʏᴏᴜᴛ.MuveOn}ytsurround
║⭕ ${ʟᴀʏᴏᴜᴛ.MuveOn}ytvaporwave
║⭕ ${ʟᴀʏᴏᴜᴛ.MuveOn}ytvibrato
╚════════════╝

╔◇👇🏽𝐅𝐢𝐥𝐭𝐞𝐫𝐬/𝐀𝐮𝐝𝐢𝐨👇🏽
║  
║🍰 ${ʟᴀʏᴏᴜᴛ.MuveOn}8d
║🍰 ${ʟᴀʏᴏᴜᴛ.MuveOn}bassboost
║🍰 ${ʟᴀʏᴏᴜᴛ.MuveOn}echo
║🍰 ${ʟᴀʏᴏᴜᴛ.MuveOn}fast
║🍰 ${ʟᴀʏᴏᴜᴛ.MuveOn}flanger
║🍰 ${ʟᴀʏᴏᴜᴛ.MuveOn}nightcore
║🍰 ${ʟᴀʏᴏᴜᴛ.MuveOn}phaser
║🍰 ${ʟᴀʏᴏᴜᴛ.MuveOn}reverse
║🍰 ${ʟᴀʏᴏᴜᴛ.MuveOn}slow
║🍰 ${ʟᴀʏᴏᴜᴛ.MuveOn}speed
║🍰 ${ʟᴀʏᴏᴜᴛ.MuveOn}subboost
║🍰 ${ʟᴀʏᴏᴜᴛ.MuveOn}superslow
║🍰 ${ʟᴀʏᴏᴜᴛ.MuveOn}superspeed
║🍰 ${ʟᴀʏᴏᴜᴛ.MuveOn}surround
║🍰 ${ʟᴀʏᴏᴜᴛ.MuveOn}vaporwave
║🍰 ${ʟᴀʏᴏᴜᴛ.MuveOn}vibrato
╚════════════╝

╔◇👇🏽𝐎𝐰𝐧𝐞𝐫👇🏽
║  
║👑 ${ʟᴀʏᴏᴜᴛ.MuveOn}join
║👑 ${ʟᴀʏᴏᴜᴛ.MuveOn}dyno
║👑 ${ʟᴀʏᴏᴜᴛ.MuveOn}ban
║👑 ${ʟᴀʏᴏᴜᴛ.MuveOn}unban
║👑 ${ʟᴀʏᴏᴜᴛ.MuveOn}broadcast
║👑 ${ʟᴀʏᴏᴜᴛ.MuveOn}bugreport
║👑 ${ʟᴀʏᴏᴜᴛ.MuveOn}help
║👑 ${ʟᴀʏᴏᴜᴛ.MuveOn}reboot
║👑 ${ʟᴀʏᴏᴜᴛ.MuveOn}broadcast
║👑 ${ʟᴀʏᴏᴜᴛ.MuveOn}leave
║👑 ${ʟᴀʏᴏᴜᴛ.MuveOn}spam
╚════════════╝

╔◇👇🏽𝐀𝐧𝐢𝐦𝐞👇🏽
║  
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}anime
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}ranimewall
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}smile
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}yes
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}bite
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}blush
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}bored
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}confused
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}cry
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}goodnight
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}happy
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}hi5
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}poke
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}sad
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}thinking
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}cuddle
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}hug
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}pat
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}slap
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}wink
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}angry
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}baka
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}bonk
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}bully
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}bye
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}chase
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}cheer
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}cringe
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}dab
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}dance
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}die
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}facepalm
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}feed
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}glomp
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}hold
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}hate
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}hi
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}kill
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}lick
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}love
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}lurk
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}nervous
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}nope
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}nom
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}nuzzle
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}panic
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}peck
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}pout
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}run
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}sip
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}shoot
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}shrug
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}sleep
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}smug
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}stab
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}stare
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}tease
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}tickle
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}thumbsup
║🍙 ${ʟᴀʏᴏᴜᴛ.MuveOn}wag
╚════════════╝

╔◇👇🏽𝐆𝐫𝐨𝐮𝐩𝐬/𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧👇🏽
║  
║🔰 ${ʟᴀʏᴏᴜᴛ.MuveOn}antilink
║🔰 ${ʟᴀʏᴏᴜᴛ.MuveOn}autorank
║🔰 ${ʟᴀʏᴏᴜᴛ.MuveOn}setwelcome
║🔰 ${ʟᴀʏᴏᴜᴛ.MuveOn}delete
║🔰 ${ʟᴀʏᴏᴜᴛ.MuveOn}promote
║🔰 ${ʟᴀʏᴏᴜᴛ.MuveOn}demote
║🔰 ${ʟᴀʏᴏᴜᴛ.MuveOn}warn
║🔰 ${ʟᴀʏᴏᴜᴛ.MuveOn}unwarn
║🔰 ${ʟᴀʏᴏᴜᴛ.MuveOn}invite
║🔰 ${ʟᴀʏᴏᴜᴛ.MuveOn}lock
║🔰 ${ʟᴀʏᴏᴜᴛ.MuveOn}unlock
║🔰 ${ʟᴀʏᴏᴜᴛ.MuveOn}admins
║🔰 ${ʟᴀʏᴏᴜᴛ.MuveOn}groupdp
║🔰 ${ʟᴀʏᴏᴜᴛ.MuveOn}kick
║🔰 ${ʟᴀʏᴏᴜᴛ.MuveOn}getdesc
║🔰 ${ʟᴀʏᴏᴜᴛ.MuveOn}getdp
║🔰 ${ʟᴀʏᴏᴜᴛ.MuveOn}tagall
╚════════════╝

╔◇👇🏽𝐑𝐚𝐧𝐝𝐨𝐦𝐬👇🏽
║  
║🦄 ${ʟᴀʏᴏᴜᴛ.MuveOn}rank
║🦄 ${ʟᴀʏᴏᴜᴛ.MuveOn}leaderboard
║🦄 ${ʟᴀʏᴏᴜᴛ.MuveOn}fact
║🦄 ${ʟᴀʏᴏᴜᴛ.MuveOn}trivia
║🦄 ${ʟᴀʏᴏᴜᴛ.MuveOn}joke
║🦄 ${ʟᴀʏᴏᴜᴛ.MuveOn}meme
║🦄 ${ʟᴀʏᴏᴜᴛ.MuveOn}tr
║🦄 ${ʟᴀʏᴏᴜᴛ.MuveOn}tts
║🦄 ${ʟᴀʏᴏᴜᴛ.MuveOn}pokedex
║🦄 ${ʟᴀʏᴏᴜᴛ.MuveOn}triggered
╚════════════╝

╔◇👇🏽𝗠𝗲𝗺𝗯𝗲𝗿 𝗦𝘁𝗼𝗿𝗲👇🏽
║  
║🛍️ ${ʟᴀʏᴏᴜᴛ.MuveOn}buy basic 
║🛍️ ${ʟᴀʏᴏᴜᴛ.MuveOn}buy bronze 
║🛍️ ${ʟᴀʏᴏᴜᴛ.MuveOn}buy silver 
║🛍️ ${ʟᴀʏᴏᴜᴛ.MuveOn}buy gold 
║🛍️ ${ʟᴀʏᴏᴜᴛ.MuveOn}buy platinum 
║🛍️ ${ʟᴀʏᴏᴜᴛ.MuveOn}buy diamond
║🛍️ ${ʟᴀʏᴏᴜᴛ.MuveOn}buy sword
║🛍️ ${ʟᴀʏᴏᴜᴛ.MuveOn}buy laptop
║🛍️ ${ʟᴀʏᴏᴜᴛ.MuveOn}buy charm
╚════════════╝

╔◇👇🏽𝐂𝐡𝐞𝐜𝐤👇🏽
║  
║🎨 ${ʟᴀʏᴏᴜᴛ.MuveOn}gaycheck
║🎨 ${ʟᴀʏᴏᴜᴛ.MuveOn}lesbocheck
║🎨 ${ʟᴀʏᴏᴜᴛ.MuveOn}beautycheck
║🎨 ${ʟᴀʏᴏᴜᴛ.MuveOn}dumbcheck
║🎨 ${ʟᴀʏᴏᴜᴛ.MuveOn}gay
║🎨 ${ʟᴀʏᴏᴜᴛ.MuveOn}lesbo
║🎨 ${ʟᴀʏᴏᴜᴛ.MuveOn}beauty
║🎨 ${ʟᴀʏᴏᴜᴛ.MuveOn}dumb
╚════════════╝

╔◇👇🏽𝐇𝐮𝐦𝐚𝐧+𝐍𝐒𝐅𝐖👇🏽
║  
║🥃 ${ʟᴀʏᴏᴜᴛ.MuveOn}4k
║🥃 ${ʟᴀʏᴏᴜᴛ.MuveOn}blowjob
║🥃 ${ʟᴀʏᴏᴜᴛ.MuveOn}milf
║🥃 ${ʟᴀʏᴏᴜᴛ.MuveOn}milk
║🥃 ${ʟᴀʏᴏᴜᴛ.MuveOn}pussy
║🥃 ${ʟᴀʏᴏᴜᴛ.MuveOn}slut
║🥃 ${ʟᴀʏᴏᴜᴛ.MuveOn}tikporn
╚════════════╝

╔◇👇🏽𝐇𝐞𝐧𝐭𝐚𝐢+𝐍𝐒𝐅𝐖👇🏽  
║
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}ass
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}bdsm
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}cum  
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}doujin
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}feet  
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}femdom  
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}foxgirl  
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}glasses  
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}hentai
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}maid 
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}masturbation
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}netorare  
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}orgy
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}panties
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}pussy
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}school
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}tentacles
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}thighs
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}uniform
║🍑 ${ʟᴀʏᴏᴜᴛ.MuveOn}yuri
╚════════════╝`,
footer: "`⦓ 𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 ⦔",
buttons: [
{
buttonId: `${ʟᴀʏᴏᴜᴛ.MuveOn}help`,
buttonText: { displayText: `${ʟᴀʏᴏᴜᴛ.MuveOn}help` },
type: 1,
},
{
buttonId: `${ʟᴀʏᴏᴜᴛ.MuveOn}menu`,
buttonText: { displayText: `${ʟᴀʏᴏᴜᴛ.MuveOn}menu` },
type: 1,
},
],
headerType: 4,
},
MessageType.buttonsMessage
);
},
};
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/*        
(𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
