`|⬡════════════════════════════════════════════|❝ Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/* 
(𝐜)𝐀𝐫𝐜𝐭𝐢𝐱 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
const UserPrivate = require(`../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/private`);
const Welcome = require(`../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/setwelcome`);
const LinkList = require(`../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/antilink`);
const DebugList = require(`../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/debug`);
const Ranker = require(`../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/autorank`);
const BanPerson = require(`../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/ban`);
const NsfwList = require(`../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/nsfw`);
const Kooldown = require(`../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/halt`);
const BanGroup = require(`../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/ban`);
const Bagde = require(`../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/badge`);
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
import Link_Proctectron from "../𝐀𝐫𝐜𝐭𝐢𝐱🀄𝐕𝐞𝐧𝐭/Link_Proctectron";
import { MessageType } from "../𝐀𝐫𝐜𝐭𝐢𝐱⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/message-type";
const Video_Button = require(`../𝐀𝐫𝐜𝐭𝐢𝐱☘️𝐊𝐞𝐲𝐬/Video_Button`);
const Image_Button = require(`../𝐀𝐫𝐜𝐭𝐢𝐱☘️𝐊𝐞𝐲𝐬/Image_Button`);
const Text_List = require(`../𝐀𝐫𝐜𝐭𝐢𝐱☘️𝐊𝐞𝐲𝐬/Text_List`);
const VOID = require(`../𝐀𝐫𝐜𝐭𝐢𝐱⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/void`);
import resolve from "../𝐀𝐫𝐜𝐭𝐢𝐱⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/helper";
import { proto } from "@adiwajshing/baileys";
const Oops = require(`../𝐀𝐫𝐜𝐭𝐢𝐱☘️𝐊𝐞𝐲𝐬/Oops`);
import First_Proto__ from "./First_Proto__";
import Client from "../𝐀𝐫𝐜𝐭𝐢𝐱⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/TUF";
import AʀƈȶɨӼ from "../𝐀𝐫𝐜𝐭𝐢𝐱⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/msb";
import ʟᴀʏᴏᴜᴛ from "../𝐀𝐫𝐜𝐭𝐢𝐱🀄𝐕𝐞𝐧𝐭/ʟᴀʏᴏᴜᴛ";
import Silent from "../𝐀𝐫𝐜𝐭𝐢𝐱🀄𝐕𝐞𝐧𝐭/Silent";
import Rankr from "../𝐀𝐫𝐜𝐭𝐢𝐱🀄𝐕𝐞𝐧𝐭/Ranker";
const git = require(`simple-git`)();
import ms from "parse-ms";
import Kolor from "chalk";
import * as fs from "fs";
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
const messages_upsert = async (
update: any,
ӄ𝖗𝖞ӄ𝖓𝖟: any,
commandHandler: any,
ӄ: any
): Promise<void> => {
if (update.type !== "notify") return;
if (update.type === "append" && !ʟᴀʏᴏᴜᴛ.OFFLINE_RESPONSE) return;
let Fox: proto.IWebMessageInfo = update.messages[0];
let AʀƈȶɨӼ: AʀƈȶɨӼ = await resolve(Fox, ӄ𝖗𝖞ӄ𝖓𝖟);
let TUF: Client = new Client(ӄ𝖗𝖞ӄ𝖓𝖟);
await First_Proto__.First_Proto__(AʀƈȶɨӼ, TUF, Fox);
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/

// await BanPerson.findOne(
// {
// ID: AʀƈȶɨӼ.sender,
// },
// async (error: any, BanPerson: any) => {
// if (error) return console.log(error);
// await BanGroup.findOne(
// {
// ID: AʀƈȶɨӼ.chatId,
// },
// async (error: any, BanGroup: any) => {
// if (error) return console.log(error);
// if (AʀƈȶɨӼ.isGroup && !AʀƈȶɨӼ.fromMe && !BanGroup && !BanPerson) {
// }
// }
// );
// }
// );
await First_Proto__.First_Proto__(AʀƈȶɨӼ, TUF, Fox);
if (AʀƈȶɨӼ.isCmd && !AʀƈȶɨӼ.isGroup && !AʀƈȶɨӼ.isSenderTUFs) {
await UserPrivate.findOne(
{
ID: AʀƈȶɨӼ.sender,
},
async (error: any, user: any) => {
if (error) return Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error);
if (!user) {
var newUser = new UserPrivate({
ID: AʀƈȶɨӼ.sender,
Amount: 1,
});
await newUser
.save()
.catch((error: any) => Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error));
await Image_Button.VImg(
TUF,
Fox,
AʀƈȶɨӼ,
`
╔◇═══════════════◇╗
┊ 𝐊𝐫𝐲𝐙𝐞𝐧👑𝐏𝐫𝐢𝐯𝐚𝐭𝐞
┊    𝐌𝐞𝐜𝐡𝐚𝐧𝐢𝐬𝐦
╚◇═══════════════◇╝

✋🏽‍𝐖𝐚𝐢𝐭 𝐅𝐨𝐫 𝐌𝐲 𝐎𝐰𝐧𝐞𝐫 𝐓𝐨 𝐑𝐞𝐬𝐩𝐨𝐧𝐝!
⚡• Dear Random User, This Private Is Being Guarded By Vlkyre AI!
⚡• Do Not Spam The Chat Box!
⚡• No Spamming In Private!
⚡• You Will be blocked after 4 warnings!

🌿𝐏𝐮𝐧𝐢𝐬𝐡𝐦𝐞𝐧𝐭
❗• 𝗪𝗮𝗿𝗻𝗶𝗻𝗴𝘀: 1/4
❗• 𝗪𝗮𝗿𝗻𝗲𝗱 𝗧𝗼: @${AʀƈȶɨӼ.sender.replace(/[^\d+]/g, "")}
❗• You Will be Auto-Blocked After 4 warnings!`,
"./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png"
);
return;
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
} else if (user.Amount < 4) {
user.Amount = user.Amount + 1;
await user
.save()
.catch((error: any) => Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error));
await Image_Button.VImg(
TUF,
Fox,
AʀƈȶɨӼ,
`╔◇═══════════════◇╗
┊ 𝐊𝐫𝐲𝐙𝐞𝐧👑𝐏𝐫𝐢𝐯𝐚𝐭𝐞
┊    𝐌𝐞𝐜𝐡𝐚𝐧𝐢𝐬𝐦
╚◇═══════════════◇╝

✋🏽‍𝐖𝐚𝐢𝐭 𝐅𝐨𝐫 𝐌𝐲 𝐎𝐰𝐧𝐞𝐫 𝐓𝐨 𝐑𝐞𝐬𝐩𝐨𝐧𝐝!
⚡• Dear Random User, This Private Is Being Guarded By Vlkyre AI!
⚡• Do Not Spam The Chat Box!
⚡• No Spamming In Private!
⚡• You Will be blocked after 4 warnings!

🌿𝐏𝐮𝐧𝐢𝐬𝐡𝐦𝐞𝐧𝐭
❗• 𝗪𝗮𝗿𝗻𝗶𝗻𝗴𝘀: ${user.Amount}/4
❗• 𝗪𝗮𝗿𝗻𝗲𝗱 𝗧𝗼: @${AʀƈȶɨӼ.sender.replace(/[^\d+]/g, "")}
❗• You Will be Auto-Blocked After 4 warnings!`,
"./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png"
);
return;
} else {
await user
.delete()
.catch((error: any) => Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error));
await ӄ𝖗𝖞ӄ𝖓𝖟.blockUser(AʀƈȶɨӼ.sender, "add");
return;
}
}
);
}
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
if (AʀƈȶɨӼ.isCmd && AʀƈȶɨӼ.isGroup) {
await Kooldown.findOne(
{
ID: AʀƈȶɨӼ.sender,
},
async (error: any, userHalt: any) => {
if (error) {
console.log("❌𝐄𝐫𝐫𝐨𝐫: " + error);
return;
}
if (!userHalt) {
var newHalt = new Kooldown({
ID: AʀƈȶɨӼ.sender,
TimeOut: Date.now(),
PermaTimeOut: 5000,
});
return await newHalt
.save()
.catch((error: any) => console.log("❌𝐄𝐫𝐫𝐨𝐫: " + error));
}
if (
!AʀƈȶɨӼ.fromMe &&
userHalt.PermaTimeOut - (Date.now() - userHalt.TimeOut) > 0
) {
return await TUF.sendMessage(
AʀƈȶɨӼ.chatId,
`┌─「 𝐀𝐫𝐜𝐭𝐢𝐱 𝐏𝐫𝐨𝐭𝐨® 」
├• *ɴᴀᴍᴇ:* ${Fox.pushName}
├• *ᴍᴇɴᴛɪᴏɴ:* @${AʀƈȶɨӼ.sender.replace(/[^\d+]/g, "")}
├• *ᴄᴏᴍᴍᴀɴᴅ:* ${AʀƈȶɨӼ.commandName}
└────────────────◇

❌𝗘𝗿𝗿𝗼𝗿: Wait For 5seconds!`,
MessageType.text,
{
quoted: Fox,
timestamp: Date(),
contextInfo: { mentionedJid: [AʀƈȶɨӼ.sender] },
}
);
}
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
console.log(Fox);
console.log(
Kolor.cyanBright(
"|════════════════════════「 𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢® 」════════════════════════|"
)
);
await git.fetch();
var newCommits = await git.log([
"𝐀𝐫𝐜𝐭𝐢𝐱📡𝐏𝐫𝐨𝐭𝐨®..origin/𝐀𝐫𝐜𝐭𝐢𝐱📡𝐏𝐫𝐨𝐭𝐨®",
]);
if (newCommits.total != 0) {
// try {
// let list_chats_user = ӄ.chats.all().map((v) => v.id);
// for (let Jid of list_chats_user) {
// await TUF.sendMessage(
// Jid,
// {
// quoted: Fox,
// timestamp: Date(),
// contextInfo: { mentionedJid: [AʀƈȶɨӼ.sender] },
// image: { url: "./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png" },
// caption: `「 Broadcast 」

// ╔◇══════════════◇╗
// ┊  🤖𝐑𝐞𝐛𝐨𝐨𝐭𝐢𝐧𝐠🤖
// ╚◇══════════════◇╝
// Please Wait For ARCTIX to reboot itself and all of it's dedicated components & servers.
// Will take 40secs maximum.`,
// footer: `⦓ Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ⦔`,
// buttons: [
// {
// buttonId: `${ʟᴀʏᴏᴜᴛ.MuveOn}help`,
// buttonText: { displayText: `${ʟᴀʏᴏᴜᴛ.MuveOn}help` },
// type: 1,
// },
// {
// buttonId: `${ʟᴀʏᴏᴜᴛ.MuveOn}support`,
// buttonText: { displayText: `${ʟᴀʏᴏᴜᴛ.MuveOn}support` },
// type: 1,
// },
// ],
// headerType: 4,
// },
// MessageType.buttonsMessage
// );
// }
// } catch (error) {
// console.log(Kolor.red(error));
// }
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
try {
var 𝖛𝖑𝖐𝖕 = require("child_process").exec(
"git config --global user.name 'KryKnz' && git config --global user.email 'KryKnz@yandex.com' && git config pull.rebase false && git init --initial-branch=𝐀𝐫𝐜𝐭𝐢𝐱📡𝐏𝐫𝐨𝐭𝐨® && git fetch origin 𝐀𝐫𝐜𝐭𝐢𝐱📡𝐏𝐫𝐨𝐭𝐨® && git reset --hard origin/𝐀𝐫𝐜𝐭𝐢𝐱📡𝐏𝐫𝐨𝐭𝐨® && git stash && git stash drop && git pull"
);
console.log("🛰️ 𝐓𝐡𝐫𝐞𝐚𝐝 𝐈𝐃:", Kolor.green(𝖛𝖑𝖐𝖕.pid));
𝖛𝖑𝖐𝖕.stderr.pipe(process.stderr);
𝖛𝖑𝖐𝖕.stdout.pipe(process.stdout);
𝖛𝖑𝖐𝖕.on("exit", function (code: any, signal: any) {
if (code)
console.log("📟 𝐕𝐥𝐤𝐲𝐫𝐞 𝐄𝐱𝐢𝐭𝐞𝐝 𝐖𝐢𝐭𝐡 𝐂𝐨𝐝𝐞:", Kolor.red(code));
if (signal)
console.log(
"📶 𝐕𝐥𝐤𝐲𝐫𝐞 𝐄𝐱𝐢𝐭𝐞𝐝 𝐖𝐢𝐭𝐡 𝐒𝐢𝐠𝐧𝐚𝐥:",
Kolor.blue(signal)
);
process.exitCode = 1;
});
var h𝖛𝖑𝖐𝖕 = require("child_process").exec(
`heroku ps:restart worker -a ${ʟᴀʏᴏᴜᴛ.Heroku_App}`
);
console.log("🛰️ 𝐓𝐡𝐫𝐞𝐚𝐝 𝐈𝐃:", Kolor.green(h𝖛𝖑𝖐𝖕.pid));
h𝖛𝖑𝖐𝖕.stderr.pipe(process.stderr);
h𝖛𝖑𝖐𝖕.on("exit", function (code: any, signal: any) {
if (code)
console.log("📟 𝐕𝐥𝐤𝐲𝐫𝐞 𝐄𝐱𝐢𝐭𝐞𝐝 𝐖𝐢𝐭𝐡 𝐂𝐨𝐝𝐞:", Kolor.red(code));
if (signal)
console.log(
"📶 𝐕𝐥𝐤𝐲𝐫𝐞 𝐄𝐱𝐢𝐭𝐞𝐝 𝐖𝐢𝐭𝐡 𝐒𝐢𝐠𝐧𝐚𝐥:",
Kolor.blue(signal)
);
process.exitCode = 1;
});
} catch (error) {
console.log(Kolor.red(error));
}
}
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
const ARC = commandHandler.get(AʀƈȶɨӼ.commandName);
console.log(
Kolor.blue(`💡𝐈𝐧𝐟𝐨: ${AʀƈȶɨӼ.commandName} Command executed.`)
);
var ǟʀɢʊʍɛռȶ = AʀƈȶɨӼ.body.trim().split(/\s+/).slice(1);
await Silent.VSln(TUF, Fox, AʀƈȶɨӼ, ӄ𝖗𝖞ӄ𝖓𝖟);
await Rankr.VRnIT(TUF, Fox, AʀƈȶɨӼ, ӄ𝖗𝖞ӄ𝖓𝖟);
await Link_Proctectron.VFLink(TUF, Fox, AʀƈȶɨӼ, ӄ𝖗𝖞ӄ𝖓𝖟);
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
try {
let MEMBER_A = [];
let MEMBER_B = [];
let MEMBER_C = [];
let MEMBER_D = [];
// let MEMBER_E = [];
// let MEMBER_F = [];
const MetaFor_A = await ӄ𝖗𝖞ӄ𝖓𝖟.groupMetadata(
"120363020792949649@g.us"
);
const MetaFor_B = await ӄ𝖗𝖞ӄ𝖓𝖟.groupMetadata(
"120363024871653603@g.us"
);
const MetaFor_C = await ӄ𝖗𝖞ӄ𝖓𝖟.groupMetadata(
"120363042762307739@g.us"
);
const MetaFor_D = await ӄ𝖗𝖞ӄ𝖓𝖟.groupMetadata(
"120363022161584857@g.us"
);
// const MetaFor_E = await ӄ𝖗𝖞ӄ𝖓𝖟.groupMetadata("120363042762307739@g.us");
// const MetaFor_F = await ӄ𝖗𝖞ӄ𝖓𝖟.groupMetadata("120363039223842047@g.us");
for (var i = 0; i < MetaFor_A.participants.length; i++)
MEMBER_A[i] = MetaFor_A.participants[i].id;
for (var i = 0; i < MetaFor_B.participants.length; i++)
MEMBER_B[i] = MetaFor_B.participants[i].id;
for (var i = 0; i < MetaFor_C.participants.length; i++)
MEMBER_C[i] = MetaFor_C.participants[i].id;
for (var i = 0; i < MetaFor_D.participants.length; i++)
MEMBER_D[i] = MetaFor_D.participants[i].id;
// for (var i = 0; i < MetaFor_E.participants.length; i++)
// MEMBER_E[i] = MetaFor_E.participants[i].id;
// for (var i = 0; i < MetaFor_F.participants.length; i++)
// MEMBER_F[i] = MetaFor_F.participants[i].id;
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
if (
AʀƈȶɨӼ.isCmd &&
!AʀƈȶɨӼ.isSenderTUFs &&
!AʀƈȶɨӼ.body.includes(ʟᴀʏᴏᴜᴛ.MuveOn + "help")
) {
if (
!MEMBER_A.includes(AʀƈȶɨӼ.sender) &&
!MEMBER_B.includes(AʀƈȶɨӼ.sender) &&
!MEMBER_C.includes(AʀƈȶɨӼ.sender) &&
!MEMBER_D.includes(AʀƈȶɨӼ.sender)
) {
return Image_Button.VImg(
TUF,
Fox,
AʀƈȶɨӼ,
`
╔◇══════════════◇╗
┊ 🦊𝐕𝐞𝐫𝐢𝐟𝐢𝐜𝐚𝐭𝐢𝐨𝐧🦊
╚◇══════════════◇╝

𝐉𝐨𝐢𝐧 𝐓𝐨 𝐁𝐞 𝐕𝐞𝐫𝐢𝐟𝐢𝐞𝐝:
*⛩️𝗚roup A:* chat.whatsapp.com/Gn50KMVAJKZHYJeaGhs3UV
*⛩️𝗚roup B:* chat.whatsapp.com/BF6J4MiaduL7ZRgt2Tqzk8
*⛩️𝗚roup C:* chat.whatsapp.com/Hx5VAZMfthg5okQwerohXM
*⛩️𝗚roup D:* chat.whatsapp.com/EwPq86c1N5L4iZKxpHL6WP`,
"./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png"
);
}
}
} catch (error) {
console.log(error);
}
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
if (!ARC) {
await TUF.sendMessage(
AʀƈȶɨӼ.chatId,
{
quoted: Fox,
contextInfo: {
mentionedJid: [AʀƈȶɨӼ.sender],
},
timestamp: Date(),
image: { url: "./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ_Red.png" },
caption: `*ᴍᴇɴᴛɪᴏɴ:* @${AʀƈȶɨӼ.sender.replace(/[^\d+]/g, "")}

*❌𝗘𝗿𝗿𝗼𝗿:* No Such Command In Database.Wait for it to be installed in near future.`,
footer: `⦓ 𝐀𝐫𝐜𝐭𝐢𝐱 ⦔`,
buttons: [
{
buttonId: `${ʟᴀʏᴏᴜᴛ.MuveOn}help`,
buttonText: { displayText: `${ʟᴀʏᴏᴜᴛ.MuveOn}help` },
type: 1,
},
],
headerType: 4,
},
MessageType.buttonsMessage
);
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
} else if (ARC && AʀƈȶɨӼ.commandName == "all") {
try {
return ARC.handle(
TUF,
Fox,
AʀƈȶɨӼ,
ǟʀɢʊʍɛռȶ,
ӄ𝖗𝖞ӄ𝖓𝖟,
commandHandler
);
} catch (err) {
console.log(Kolor.red("❌𝐄𝐫𝐫𝐨𝐫: ", err));
return;
}
}
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
try {
await ARC.handle(TUF, Fox, AʀƈȶɨӼ, ǟʀɢʊʍɛռȶ, ӄ𝖗𝖞ӄ𝖓𝖟).catch(
(error: any) => console.log("❌𝐄𝐫𝐫𝐨𝐫: " + error)
);
} catch (err) {
console.log(Kolor.red("❌𝐄𝐫𝐫𝐨𝐫: ", err));
}
}
);
}
};
export = {
messages_upsert: messages_upsert,
};
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/* 
(𝐜)𝐀𝐫𝐜𝐭𝐢𝐱 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
