"use strict";
var __awaiter = (this && this.__awaiter) || function (thisArg, _arguments, P, generator) {
    function adopt(value) { return value instanceof P ? value : new P(function (resolve) { resolve(value); }); }
    return new (P || (P = Promise))(function (resolve, reject) {
        function fulfilled(value) { try { step(generator.next(value)); } catch (e) { reject(e); } }
        function rejected(value) { try { step(generator["throw"](value)); } catch (e) { reject(e); } }
        function step(result) { result.done ? resolve(result.value) : adopt(result.value).then(fulfilled, rejected); }
        step((generator = generator.apply(thisArg, _arguments || [])).next());
    });
};
var __importDefault = (this && this.__importDefault) || function (mod) {
    return (mod && mod.__esModule) ? mod : { "default": mod };
};
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/*
(𝐜)𝐀𝐫𝐜𝐭𝐢𝐱 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!
*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
const Image_Button_1 = __importDefault(require("../\uD835\uDC00\uD835\uDC2B\uD835\uDC1C\uD835\uDC2D\uD835\uDC22\uD835\uDC31\u2618\uFE0F\uD835\uDC0A\uD835\uDC1E\uD835\uDC32\uD835\uDC2C/Image_Button"));
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
const UserPrivate = require("../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/private");
const Welcome = require("../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/setwelcome");
const LinkList = require("../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/antilink");
const DebugList = require("../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/debug");
const Ranker = require("../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/autorank");
const Robbery = require(`../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/robbery`);
const Pokemon = require("../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/pokemon");
const Economy = require("../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/economy");
const NsfwList = require("../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/nsfw");
const BanPerson = require("../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/ban");
const BanGroup = require("../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/ban");
const Bagde = require("../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/badge");
const Halt = require("../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/halt");
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
const VOID = require(`../𝐀𝐫𝐜𝐭𝐢𝐱⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/void`);
const ______1 = __importDefault(require("../\uD835\uDC00\uD835\uDC2B\uD835\uDC1C\uD835\uDC2D\uD835\uDC22\uD835\uDC31\uD83C\uDC04\uD835\uDC15\uD835\uDC1E\uD835\uDC27\uD835\uDC2D/\u029F\u1D00\u028F\u1D0F\u1D1C\u1D1B"));
const Oops_1 = __importDefault(require("../\uD835\uDC00\uD835\uDC2B\uD835\uDC1C\uD835\uDC2D\uD835\uDC22\uD835\uDC31\u2618\uFE0F\uD835\uDC0A\uD835\uDC1E\uD835\uDC32\uD835\uDC2C/Oops"));
const Kolor = require("chalk");
const parse_ms_1 = __importDefault(require("parse-ms"));
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
const Rob_Reply = (TUF, Fox, AʀƈȶɨӼ) => __awaiter(void 0, void 0, void 0, function* () {
    try {
        const ʟɴᴀᴍᴇ = AʀƈȶɨӼ.sender;
        const ᴅꜰɴᴀᴍᴇ = AʀƈȶɨӼ.commandName;
        const ᴘɴᴀᴍᴇ = ʟɴᴀᴍᴇ.replace(/[^\d+]/g, "");
        console.log(Kolor.cyan("Received REPLY request"));
        yield TUF.getGroupMetaData(AʀƈȶɨӼ.chatId, AʀƈȶɨӼ);
        const ꜰɪɴᴀᴍᴇ = ᴅꜰɴᴀᴍᴇ.charAt(0).toUpperCase() + ᴅꜰɴᴀᴍᴇ.slice(1);
        /*
        ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
        「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
        ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
        */
        var REPLIED_RAW = Fox.message.extendedTextMessage.contextInfo.participant;
        const MoneyLaptop = Math.floor(Math.random() * (4000 - 3000 + 1)) + 3000;
        const MoneyRandom = Math.floor(Math.random() * (2000 - 1500 + 1)) + 1500;
        const MoneyCharm = Math.floor(Math.random() * (6000 - 5000 + 1)) + 5000;
        const Moneylightsaber = Math.floor(Math.random() * (2000 - 1000 + 1)) + 1000;
        var REPLIED = REPLIED_RAW.substring(0, REPLIED_RAW.length - 15);
        /*
        ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
        「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
        ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
        */
        yield Economy.findOne({
            ID: ʟɴᴀᴍᴇ,
        }, (error, cEconomy) => __awaiter(void 0, void 0, void 0, function* () {
            if (error)
                return Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error);
            yield Economy.findOne({
                ID: REPLIED_RAW,
            }, (error, vEconomy) => __awaiter(void 0, void 0, void 0, function* () {
                if (error)
                    return Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error);
                if (!vEconomy) {
                    var newUser = new Economy({
                        ID: REPLIED_RAW,
                        money: 0,
                        daily: 0,
                        timeout: 86400000,
                        fishdone: 0,
                        fishtimeout: 1800000,
                        workdone: 0,
                        worktimeout: 900000,
                    });
                    yield newUser
                        .save()
                        .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                    return yield Image_Button_1.default.VImg(TUF, Fox, AʀƈȶɨӼ, `
╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝

🪄𝐁𝐚𝐧𝐤 𝗦𝗮𝗳𝗲𝘁𝘆: _1/4 used_
 @${REPLIED}'s Bank Guard Caught You and Took You To The Jail!
💡‍𝐒𝐭𝐚𝐭𝐮𝐬: _You Got Arrested and Took 0gold.ReTry Again!_`, "./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png");
                    /*
                    ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                    「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
                    ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                    */
                }
                else if (!cEconomy) {
                    var newUser = new Economy({
                        ID: ʟɴᴀᴍᴇ,
                        money: 0,
                        daily: 0,
                        timeout: 86400000,
                        fishdone: 0,
                        fishtimeout: 1800000,
                        workdone: 0,
                        worktimeout: 900000,
                    });
                    yield newUser
                        .save()
                        .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                    return yield Image_Button_1.default.VImg(TUF, Fox, AʀƈȶɨӼ, `
╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝

🪄𝐁𝐚𝐧𝐤 𝗦𝗮𝗳𝗲𝘁𝘆: _2/4 used_
 _You are the worst robber._
🍌‍𝗥𝗲𝗮𝘀𝗼𝗻:  _Fell On a pool and died!.ReTry Again!_`, "./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png");
                    /*
                    ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                    「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
                    ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                    */
                }
                else if (cEconomy.money < 1000) {
                    return yield Image_Button_1.default.VImg(TUF, Fox, AʀƈȶɨӼ, `
╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝

 _You Will Need Atleast 1000 in your bank before you can rob someone!_
🍌‍𝗥𝗲𝗮𝘀𝗼𝗻: _If You Get Caught, victim will charge you money to spare your life._`, "./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png");
                    /*
                    ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                    「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
                    ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                    */
                }
                else if (vEconomy.money < 1000) {
                    return yield Image_Button_1.default.VImg(TUF, Fox, AʀƈȶɨӼ, `
╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝

*@${REPLIED}*
❌ 𝗘𝗿𝗿𝗼𝗿:  _needs atleast 1000gold in their account before you can rob them!_
🍌‍ 𝗥𝗲𝗮𝘀𝗼𝗻: _Broke AF! Leave This Begger Alone!_`, "./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png");
                    /*
                    ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                    「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
                    ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                    */
                }
                else {
                    Robbery.findOne({
                        ID: ʟɴᴀᴍᴇ,
                    }, (error, culprit) => __awaiter(void 0, void 0, void 0, function* () {
                        if (error)
                            return Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error);
                        Robbery.findOne({
                            ID: REPLIED_RAW,
                        }, (error, victim) => __awaiter(void 0, void 0, void 0, function* () {
                            if (error)
                                return Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error);
                            if (!victim) {
                                var newUser = new Robbery({
                                    ID: REPLIED_RAW,
                                    lightsaber: 0,
                                    arclock: 0,
                                    ninja: 0,
                                    CurrentRobberyTime: Date.now(),
                                    PermanentRobberyTime: 900000,
                                });
                                yield newUser
                                    .save()
                                    .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                cEconomy.money = cEconomy.money - MoneyRandom;
                                yield cEconomy
                                    .save()
                                    .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                return yield Image_Button_1.default.VImg(TUF, Fox, AʀƈȶɨӼ, `
╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝

🪄𝐁𝐚𝐧𝐤 𝗦𝗮𝗳𝗲𝘁𝘆: _3/4 used_
 @${REPLIED}'s Bank Police Caught You and Took You To The Jail!
💡‍𝐒𝐭𝐚𝐭𝐮𝐬: _You Got Arrested and Took ${MoneyRandom}gold!_

💰𝗕𝗮𝗹𝗮𝗻𝗰𝗲
@${ᴘɴᴀᴍᴇ}, _${cEconomy.money}_`, "./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png");
                                /*
                                ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                                「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
                                ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                                */
                            }
                            else if (!culprit) {
                                var newUser = new Robbery({
                                    ID: ʟɴᴀᴍᴇ,
                                    lightsaber: 0,
                                    arclock: 0,
                                    ninja: 0,
                                    CurrentRobberyTime: Date.now(),
                                    PermanentRobberyTime: 900000,
                                });
                                yield newUser
                                    .save()
                                    .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                cEconomy.money = cEconomy.money - MoneyRandom;
                                yield cEconomy
                                    .save()
                                    .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                return yield Image_Button_1.default.VImg(TUF, Fox, AʀƈȶɨӼ, `
╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝

🪄𝐁𝐚𝐧𝐤 𝗦𝗮𝗳𝗲𝘁𝘆: _4/4 used_
 @${REPLIED} _caught You Red Handed and Sent You To The Jail!_
💡‍𝐒𝐭𝐚𝐭𝐮𝐬: _You Got Arrested and Took ${MoneyRandom}gold!_

💰𝗕𝗮𝗹𝗮𝗻𝗰𝗲
@${ᴘɴᴀᴍᴇ}, _${cEconomy.money}_`, "./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png");
                            }
                            /*
                            ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
                            ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                            */
                            if (culprit.PermanentRobberyTime -
                                (Date.now() - culprit.CurrentRobberyTime) >
                                0) {
                                let Time = (0, parse_ms_1.default)(culprit.PermanentRobberyTime -
                                    (Date.now() - culprit.CurrentRobberyTime));
                                return yield Image_Button_1.default.VImg(TUF, Fox, AʀƈȶɨӼ, `
╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝

 _You've Recently Tried Robbing Someone!._
🕐𝐑𝐨𝐛 𝗔𝗴𝗮𝗶𝗻: _${Time.minutes}m ${Time.seconds}s._`, "./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png");
                            }
                            /*
                            ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
                            ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                            */
                            if (victim.lightsaber > 0) {
                                victim.lightsaber = victim.lightsaber - 1;
                                if (cEconomy.money < 3000) {
                                    vEconomy.money = vEconomy.money + cEconomy.money;
                                    cEconomy.money = 0;
                                }
                                else {
                                    vEconomy.money = vEconomy.money + Moneylightsaber;
                                    cEconomy.money = cEconomy.money - Moneylightsaber;
                                }
                                culprit.CurrentRobberyTime = Date.now();
                                yield victim
                                    .save()
                                    .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                yield culprit
                                    .save()
                                    .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                yield vEconomy
                                    .save()
                                    .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                yield cEconomy
                                    .save()
                                    .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                return yield Image_Button_1.default.VImg(TUF, Fox, AʀƈȶɨӼ, `
╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝

 @${REPLIED} _had a powerful ⚡lightsaber that killed you!_
💡‍𝐒𝐭𝐚𝐭𝐮𝐬: You Got Arrested!

💰𝗕𝗮𝗹𝗮𝗻𝗰𝗲 
🥸𝐂𝐮𝐥𝐩𝐫𝐢𝐭: @${ᴘɴᴀᴍᴇ}, _${cEconomy.money}🪙_
💀𝐕𝐢𝐜𝐭𝐢𝐦: @${REPLIED}, _${vEconomy.money}🪙_`, "./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png");
                                /*
                                ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                                「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
                                ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                                */
                            }
                            else if (victim.arclock > 0) {
                                victim.arclock = victim.arclock - 1;
                                if (cEconomy.money < 4000) {
                                    vEconomy.money = vEconomy.money + cEconomy.money;
                                    cEconomy.money = 0;
                                }
                                else {
                                    vEconomy.money = vEconomy.money + MoneyLaptop;
                                    cEconomy.money = cEconomy.money - MoneyLaptop;
                                }
                                culprit.CurrentRobberyTime = Date.now();
                                yield victim
                                    .save()
                                    .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                yield culprit
                                    .save()
                                    .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                yield vEconomy
                                    .save()
                                    .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                yield cEconomy
                                    .save()
                                    .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                return yield Image_Button_1.default.VImg(TUF, Fox, AʀƈȶɨӼ, `
╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝

 @${REPLIED} _had a ❄️laptop that caught you digitally-robbing!_
💡‍𝐒𝐭𝐚𝐭𝐮𝐬: _You Got Arrested!_

💰𝗕𝗮𝗹𝗮𝗻𝗰𝗲 
🥸𝐂𝐮𝐥𝐩𝐫𝐢𝐭: @${ᴘɴᴀᴍᴇ}, _${cEconomy.money}🪙_
💀𝐕𝐢𝐜𝐭𝐢𝐦: @${REPLIED}, _${vEconomy.money}🪙_`, "./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png");
                                /*
                                ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                                「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
                                ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                                */
                            }
                            else if (victim.ninja > 0) {
                                victim.ninja = victim.ninja - 1;
                                if (cEconomy.money < 6000) {
                                    vEconomy.money = vEconomy.money + cEconomy.money;
                                    cEconomy.money = 0;
                                }
                                else {
                                    vEconomy.money = vEconomy.money + MoneyCharm;
                                    cEconomy.money = cEconomy.money - MoneyCharm;
                                }
                                culprit.CurrentRobberyTime = Date.now();
                                yield victim
                                    .save()
                                    .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                yield culprit
                                    .save()
                                    .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                yield vEconomy
                                    .save()
                                    .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                yield cEconomy
                                    .save()
                                    .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                return yield Image_Button_1.default.VImg(TUF, Fox, AʀƈȶɨӼ, `
╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝

 @${REPLIED} had a 🥷charm that magically saved their bank!
💡‍𝐒𝐭𝐚𝐭𝐮𝐬: _You Got Arrested!_

💰𝗕𝗮𝗹𝗮𝗻𝗰𝗲 
🥸𝐂𝐮𝐥𝐩𝐫𝐢𝐭: @${ᴘɴᴀᴍᴇ}, _${cEconomy.money}🪙_
💀𝐕𝐢𝐜𝐭𝐢𝐦: @${REPLIED}, _${vEconomy.money}🪙_`, "./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png");
                                /*
                                ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                                「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
                                ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                                */
                            }
                            else {
                                if (vEconomy.money < 1000) {
                                    vEconomy.money = 0;
                                    cEconomy.money = cEconomy.money + vEconomy.money;
                                    culprit.CurrentRobberyTime = Date.now();
                                    yield vEconomy
                                        .save()
                                        .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                    yield cEconomy
                                        .save()
                                        .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                    return yield Image_Button_1.default.VImg(TUF, Fox, AʀƈȶɨӼ, `
╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝

🔓𝐒𝐭𝐚𝐭𝐮𝐬: @${REPLIED} _Got Robbed!_
👑𝗔𝗺𝗼𝘂𝗻𝘁: *Seems Like The Victim Had Gold<1000. _You Got All Their Golds ${vEconomy.money}!*_
⚰️𝗥𝗲𝗮𝘀𝗼𝗻: _Didn't have any safety stuffs. @${REPLIED}, visit ${______1.default.MuveOn}shop ASAP._

🥸𝐂𝐮𝐥𝐩𝐫𝐢𝐭: @${ᴘɴᴀᴍᴇ}, 
❓𝗕𝗲𝗳𝗼𝗿𝗲: _${cEconomy.money}🪙_
💸𝗔𝗳𝘁𝗲𝗿: _${cEconomy.money + MoneyRandom}🪙_

💀𝐕𝐢𝐜𝐭𝐢𝐦: @${REPLIED}
❓𝗕𝗲𝗳𝗼𝗿𝗲: _${vEconomy.money}🪙_
🥲𝗔𝗳𝘁𝗲𝗿: _${vEconomy.money - MoneyRandom}🪙_`, "./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png");
                                    /*
                                    ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                                    「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」                                                                            「   𝐀𝐫𝐜𝐭𝐢𝐱 𝐀𝐩𝐢®   」
                                    ⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
                                    */
                                }
                                else {
                                    vEconomy.money = vEconomy.money - MoneyRandom;
                                    cEconomy.money = cEconomy.money + MoneyRandom;
                                    culprit.CurrentRobberyTime = Date.now();
                                    yield vEconomy
                                        .save()
                                        .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                    yield cEconomy
                                        .save()
                                        .catch((error) => Oops_1.default.VOp(TUF, Fox, AʀƈȶɨӼ, error));
                                    return yield Image_Button_1.default.VImg(TUF, Fox, AʀƈȶɨӼ, `
╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝

🔓𝐒𝐭𝐚𝐭𝐮𝐬: @${REPLIED} _Got Robbed!_
👑𝗔𝗺𝗼𝘂𝗻𝘁: You Got _${MoneyRandom}🪙_
⚰️𝗥𝗲𝗮𝘀𝗼𝗻: _Didn't have any safety stuffs. @${REPLIED}, visit ${______1.default.MuveOn}shop ASAP._

🥸𝐂𝐮𝐥𝐩𝐫𝐢𝐭: @${ᴘɴᴀᴍᴇ}, 
❓𝗕𝗲𝗳𝗼𝗿𝗲: _${cEconomy.money}🪙_
💸𝗔𝗳𝘁𝗲𝗿: _${cEconomy.money + MoneyRandom}🪙_

💀𝐕𝐢𝐜𝐭𝐢𝐦: @${REPLIED}
❓𝗕𝗲𝗳𝗼𝗿𝗲: _${vEconomy.money}🪙_
🥲𝗔𝗳𝘁𝗲𝗿: _${vEconomy.money - MoneyRandom}🪙_`, "./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png");
                                }
                            }
                        }));
                    }));
                }
            }));
        }));
    }
    catch (error) {
        console.log(error);
    }
});
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/*
(𝐜)𝐀𝐫𝐜𝐭𝐢𝐱 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!
*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
module.exports = {
    VNrl: Rob_Reply,
};
