`|⬡════════════════════════════════════════════|❝ Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/*        
(𝐜)𝐀𝐫𝐜𝐭𝐢𝐱 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
import { MessageType } from "../../𝐀𝐫𝐜𝐭𝐢𝐱⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/message-type";
import Image_Button from "../../𝐀𝐫𝐜𝐭𝐢𝐱☘️𝐊𝐞𝐲𝐬/Image_Button";
import Video_Button from "../../𝐀𝐫𝐜𝐭𝐢𝐱☘️𝐊𝐞𝐲𝐬/Video_Button";
import Text_List from "../../𝐀𝐫𝐜𝐭𝐢𝐱☘️𝐊𝐞𝐲𝐬/Text_List";
import FoxNeeded from "../../𝐀𝐫𝐜𝐭𝐢𝐱☘️𝐊𝐞𝐲𝐬/FoxNeeded";
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
const UserPrivate = require(`../../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/private`);
const Welcome = require(`../../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/setwelcome`);
const LinkList = require(`../../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/antilink`);
const DebugList = require(`../../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/debug`);
const Ranker = require(`../../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/autorank`);
const Robbery = require(`../../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/robbery`);
const Pokemon = require(`../../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/pokemon`);
const Economy = require(`../../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/economy`);
const NsfwList = require(`../../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/nsfw`);
const BanPerson = require(`../../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/ban`);
const BanGroup = require(`../../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/ban`);
const Bagde = require(`../../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/badge`);
const Halt = require(`../../𝐀𝐫𝐜𝐭𝐢𝐱✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/halt`);
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
const VOID = require(`../../𝐀𝐫𝐜𝐭𝐢𝐱⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/void`);
import AʀƈȶɨӼ from "../../𝐀𝐫𝐜𝐭𝐢𝐱⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/msb";
import Client from "../../𝐀𝐫𝐜𝐭𝐢𝐱⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/TUF";
import ʟᴀʏᴏᴜᴛ from "../../𝐀𝐫𝐜𝐭𝐢𝐱🀄𝐕𝐞𝐧𝐭/ʟᴀʏᴏᴜᴛ";
import { proto } from "@adiwajshing/baileys";
import Oops from "../../𝐀𝐫𝐜𝐭𝐢𝐱☘️𝐊𝐞𝐲𝐬/Oops";
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
import * as fs from "fs";
import path from "path";
var scriptName = path.basename(__filename);
var dotScrpt = scriptName.slice(0, -3).toLowerCase();
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
export = {
name: dotScrpt,
category: path.basename(__dirname),
async handle(
TUF: Client,
Fox: proto.IWebMessageInfo,
AʀƈȶɨӼ: AʀƈȶɨӼ,
ǟʀɢʊʍɛռȶ: string[],
ӄ𝖗𝖞ӄ𝖓𝖟: any
): Promise<void> {
try {
const ʟɴᴀᴍᴇ = AʀƈȶɨӼ.sender;
const ᴅꜰɴᴀᴍᴇ = AʀƈȶɨӼ.commandName;
const ᴘɴᴀᴍᴇ = ʟɴᴀᴍᴇ.replace(/[^\d+]/g, "");
await TUF.getGroupMetaData(AʀƈȶɨӼ.chatId, AʀƈȶɨӼ);
const ꜰɪɴᴀᴍᴇ = ᴅꜰɴᴀᴍᴇ.charAt(0).toUpperCase() + ᴅꜰɴᴀᴍᴇ.slice(1);
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
let Item: any;
let NewLimit: any;
let ItemPrice: any;
const BadgeCatelog = [
`🥉ʙʀᴏɴᴢᴇ-20ᴄᴏᴍᴍᴀɴᴅꜱ`,
`🥈ꜱɪʟᴠᴇʀ-40ᴄᴏᴍᴍᴀɴᴅꜱ`,
`🥇ɢᴏʟᴅ-60ᴄᴏᴍᴍᴀɴᴅꜱ`,
`💍ᴘʟᴀᴛɪɴᴜᴍ-80ᴄᴏᴍᴍᴀɴᴅꜱ`,
`💎ᴅɪᴀᴍᴏɴᴅ-100ᴄᴏᴍᴍᴀɴᴅꜱ`,
];
const BadCatelog = [`bronze`, `silver`, `gold`, `platinum`, `diamond`];
const RobCatelog = ["lightsaber", "arclock", "ninja"];
if (ǟʀɢʊʍɛռȶ[0] === "bronze") {
Item = `🥉ʙʀᴏɴᴢᴇ-20ᴄᴏᴍᴍᴀɴᴅꜱ`;
ItemPrice = 20000;
NewLimit = 20;
}
if (ǟʀɢʊʍɛռȶ[0] === "silver") {
Item = `🥈ꜱɪʟᴠᴇʀ-40ᴄᴏᴍᴍᴀɴᴅꜱ`;
ItemPrice = 40000;
NewLimit = 40;
}
if (ǟʀɢʊʍɛռȶ[0] === "gold") {
Item = `🥇ɢᴏʟᴅ-60ᴄᴏᴍᴍᴀɴᴅꜱ`;
ItemPrice = 60000;
NewLimit = 60;
}
if (ǟʀɢʊʍɛռȶ[0] === "platinum") {
Item = `💍ᴘʟᴀᴛɪɴᴜᴍ-80ᴄᴏᴍᴍᴀɴᴅꜱ`;
ItemPrice = 80000;
NewLimit = 80;
}
if (ǟʀɢʊʍɛռȶ[0] === "diamond") {
Item = `💎ᴅɪᴀᴍᴏɴᴅ-100ᴄᴏᴍᴍᴀɴᴅꜱ`;
ItemPrice = 100000;
NewLimit = 100;
}
if (ǟʀɢʊʍɛռȶ[0] === "ninja") {
Item = "ninja";
ItemPrice = 6000;
}
if (ǟʀɢʊʍɛռȶ[0] === "lightsaber") {
Item = "lightsaber";
ItemPrice = 1000;
}
if (ǟʀɢʊʍɛռȶ[0] === "arclock") {
Item = "arclock";
ItemPrice = 4000;
}
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
if (RobCatelog.includes(ǟʀɢʊʍɛռȶ[0])) {
await Economy.findOne(
{
ID: ʟɴᴀᴍᴇ,
},
async (error, userEco) => {
if (error) return Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error);
if (!userEco) {
var newUser = new Economy({
ID: ʟɴᴀᴍᴇ,
money: 0,
daily: 0,
timeout: 86400000,
fishdone: 0,
fishtimeout: 1800000,
workdone: 0,
worktimeout: 900000,
});
await newUser
.save()
.catch((error: any) => Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error));
return await Image_Button.VImg(
TUF,
Fox,
AʀƈȶɨӼ,
`
╔◇══════════════◇╗
┊  𝐀𝐫𝐜𝐭𝐢𝐱💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝
💰𝗧𝗼𝘁𝗮𝗹 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _Just Opened Your Account!_
🤠𝗔𝗰𝗰𝗼𝘂𝗻𝘁_𝗛𝗼𝗹𝗱𝗲𝗿: @${ᴘɴᴀᴍᴇ}`,
"./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png"
);
}
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
await Robbery.findOne(
{
ID: ʟɴᴀᴍᴇ,
},
async (error, userRob) => {
if (error) return Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error);
if (!userRob) {
var newUser = new Robbery({
ID: ʟɴᴀᴍᴇ,
lightsaber: 0,
arclock: 0,
ninja: 0,
CurrentRobberyTime: 0,
PermanentRobberyTime: 600000,
});
await newUser
.save()
.catch((error: any) => Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error));
return await Image_Button.VImg(
TUF,
Fox,
AʀƈȶɨӼ,
`
╔◇══════════════◇╗
┊  𝐀𝐫𝐜𝐭𝐢𝐱💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝
💡𝐈𝐧𝐟𝐨:Addded To Database! Try again.`,
"./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png"
);
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
} else {
if (userEco.money < ItemPrice) {
return await Image_Button.VImg(
TUF,
Fox,
AʀƈȶɨӼ,
`
╔◇══════════════◇╗
┊  𝐀𝐫𝐜𝐭𝐢𝐱💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝
❌𝗘𝗿𝗿𝗼𝗿: _You Are Broke!_
💼𝗘𝗮𝗿𝗻: _read ${ʟᴀʏᴏᴜᴛ.MuveOn}ecomenu._
🧀𝗜𝘁𝗲𝗺: _${Item}_
🪙𝗜𝘁𝗲𝗺_𝗣𝗿𝗶𝗰𝗲: _${ItemPrice} gold_
💰𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${userEco.money} gold_`,
"./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png"
);
}
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
if (Item === "lightsaber" && userRob.lightsaber < 2) {
userRob.lightsaber = userRob.lightsaber + 1;
userEco.money = userEco.money - ItemPrice;
await userEco
.save()
.catch((error: any) => Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error));
await userRob
.save()
.catch((error: any) => Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error));
return await Image_Button.VImg(
TUF,
Fox,
AʀƈȶɨӼ,
`
╔◇══════════════◇╗
┊  𝐀𝐫𝐜𝐭𝐢𝐱💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝
🥳𝐂𝐨𝐧𝐠𝐫𝐚𝐭𝐬: _Transaction Complete!_
🧀𝗜𝘁𝗲𝗺: _${Item}_
💰𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${userEco.money} gold_`,
"./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ_Black_Gold.png"
);
}
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
if (Item === "arclock" && userRob.arclock < 2) {
userRob.arclock = userRob.arclock + 1;
userEco.money = userEco.money - ItemPrice;
await userEco
.save()
.catch((error: any) => Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error));
await userRob
.save()
.catch((error: any) => Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error));
return await Image_Button.VImg(
TUF,
Fox,
AʀƈȶɨӼ,
`
╔◇══════════════◇╗
┊  𝐀𝐫𝐜𝐭𝐢𝐱💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝
🥳𝐂𝐨𝐧𝐠𝐫𝐚𝐭𝐬: _Transaction Complete!_
🧀𝗜𝘁𝗲𝗺: _${Item}_
💰𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${userEco.money} gold_`,
"./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ_Black_Gold.png"
);
}
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
if (Item === "ninja" && userRob.ninja < 2) {
userRob.ninja = userRob.ninja + 1;
userEco.money = userEco.money - ItemPrice;
await userEco
.save()
.catch((error: any) => Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error));
await userRob
.save()
.catch((error: any) => Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error));
return await Image_Button.VImg(
TUF,
Fox,
AʀƈȶɨӼ,
`
╔◇══════════════◇╗
┊  𝐀𝐫𝐜𝐭𝐢𝐱💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝
🥳𝐂𝐨𝐧𝐠𝐫𝐚𝐭𝐬: _Transaction Complete!_
🧀𝗜𝘁𝗲𝗺: _${Item}_
💰𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${userEco.money} gold_`,
"./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ_Black_Gold.png"
);
}
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
return await Image_Button.VImg(
TUF,
Fox,
AʀƈȶɨӼ,
`
╔◇══════════════◇╗
┊  𝐀𝐫𝐜𝐭𝐢𝐱💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝
❌ 𝗘𝗿𝗿𝗼𝗿: _Check If You Already Have That Item!_
🧀 𝗜𝘁𝗲𝗺: _${Item}_`,
"./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png"
);
}
}
);
}
);
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
} else if (BadCatelog.includes(ǟʀɢʊʍɛռȶ[0])) {
await Economy.findOne(
{
ID: ʟɴᴀᴍᴇ,
},
async (error, userEco) => {
if (error) return Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error);
await Bagde.findOne(
{
ID: ʟɴᴀᴍᴇ,
},
async (error, userBadge) => {
if (error) return Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error);
if (!userEco) {
var newEcoUser = new Economy({
ID: ʟɴᴀᴍᴇ,
money: 0,
daily: 0,
timeout: 86400000,
fishdone: 0,
fishtimeout: 1800000,
workdone: 0,
worktimeout: 900000,
});
await newEcoUser
.save()
.catch((error: any) => Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error));
return await Image_Button.VImg(
TUF,
Fox,
AʀƈȶɨӼ,
`
╔◇══════════════◇╗
┊  𝐀𝐫𝐜𝐭𝐢𝐱💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝
❌ 𝗘𝗿𝗿𝗼𝗿: _You Are Broke!_
💼 𝗘𝗮𝗿𝗻: _read ${ʟᴀʏᴏᴜᴛ.MuveOn}ecomenu._
🧀 𝗜𝘁𝗲𝗺: _${Item}_
🪙 𝗜𝘁𝗲𝗺_𝗣𝗿𝗶𝗰𝗲: _${ItemPrice} gold_
💰 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _Just Opened Your Account!_`,
"./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png"
);
}
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
if (!userBadge) {
var newBagdeUser = new Bagde({
ID: ʟɴᴀᴍᴇ,
Badge: `🧵ʙᴀꜱɪᴄ-10ᴄᴏᴍᴍᴀɴᴅꜱ`,
value: `True`,
Limits: 10,
CurrentLimitTime: 0,
PermanentLimitTime: 0,
});
await newBagdeUser
.save()
.catch((error: any) => Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error));
return await Image_Button.VImg(
TUF,
Fox,
AʀƈȶɨӼ,
`
╔◇══════════════◇╗
┊  𝐀𝐫𝐜𝐭𝐢𝐱💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝
❌𝗘𝗿𝗿𝗼𝗿: _You Are Broke!_
💼𝗘𝗮𝗿𝗻: _read ${ʟᴀʏᴏᴜᴛ.MuveOn}ecomenu._
🧀𝗜𝘁𝗲𝗺: _${Item}_
🪙𝗜𝘁𝗲𝗺_𝗣𝗿𝗶𝗰𝗲: _${ItemPrice} gold_
💰𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _Just Opened Your Account!_`,
"./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png"
);
}
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
if (userEco.money < ItemPrice) {
return await Image_Button.VImg(
TUF,
Fox,
AʀƈȶɨӼ,
`
╔◇══════════════◇╗
┊  𝐀𝐫𝐜𝐭𝐢𝐱💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝
❌𝗘𝗿𝗿𝗼𝗿: _You Are Broke!_
💼𝗘𝗮𝗿𝗻: _read ${ʟᴀʏᴏᴜᴛ.MuveOn}ecomenu._
🧀𝗜𝘁𝗲𝗺: _${Item}_
🪙𝗜𝘁𝗲𝗺_𝗣𝗿𝗶𝗰𝗲: _${ItemPrice} gold_
💰𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${userEco.money} gold_`,
"./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png"
);
}
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
if (userBadge.Badge === Item) {
return await Image_Button.VImg(
TUF,
Fox,
AʀƈȶɨӼ,
`
╔◇══════════════◇╗
┊  𝐀𝐫𝐜𝐭𝐢𝐱💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝
❌𝗘𝗿𝗿𝗼𝗿: _You Already Have That Item!_
🧀𝗜𝘁𝗲𝗺: _${Item}_`,
"./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ.png"
);
}
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
if (
userEco.money > ItemPrice &&
BadgeCatelog.includes(Item) &&
NewLimit > 0
) {
userEco.money = userEco.money - ItemPrice;
userBadge.Limits = NewLimit;
userBadge.Badge = Item;
await userEco
.save()
.catch((error: any) => Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error));
await userBadge
.save()
.catch((error: any) => Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error));
return await Image_Button.VImg(
TUF,
Fox,
AʀƈȶɨӼ,
`
╔◇══════════════◇╗
┊  𝐀𝐫𝐜𝐭𝐢𝐱💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝
🥳𝐂𝐨𝐧𝐠𝐫𝐚𝐭𝐬: _Transaction Complete!_
🧀𝗜𝘁𝗲𝗺: _${Item}_
🍯𝐏𝐞𝐫𝐤𝐬: _${userBadge.Limits}commands per day_
💰𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${userEco.money} gold_`,
"./𝐀𝐫𝐜𝐭𝐢𝐱👜𝐁𝐚𝐠/AʀƈȶɨӼ_Black_Gold.png"
);
}
}
);
}
);
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
} else {
return FoxNeeded.VFox(
TUF,
Fox,
AʀƈȶɨӼ,
`Option 1 - ${ʟᴀʏᴏᴜᴛ.MuveOn}${dotScrpt.toUpperCase()} _item name_

Get Item-List From *${ʟᴀʏᴏᴜᴛ.MuveOn}shop*`,
dotScrpt
);
}
//" |════════════════════════════════════════════| Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════| "
} catch (error) {
return Oops.VOp(TUF, Fox, AʀƈȶɨӼ, error);
}
},
};
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/*        
(𝐜)𝐀𝐫𝐜𝐭𝐢𝐱 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐀𝐫𝐜𝐭𝐢𝐱 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
