`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
function _0x2016(){var _0x10ed07=['4btkjDx','console','toString','search','table','length','966039aiiBkw','../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/𝕷𝖆ყO𝖚𝖙','5773232alddvh','500udRxHH','184079mVTZzG','115BKANDE','138tEeRuO','323538upRSkb','bind','apply','info','77DEcPcx','121725nGgAum','8230olumhi','prototype','(((.+)+)+)+$','log','trace','__proto__','error','constructor','1454628BzHBNW'];_0x2016=function(){return _0x10ed07;};return _0x2016();}var _0x4e2c2f=_0xcf59;function _0xcf59(_0x1edec0,_0x1068ec){var _0x13b3e1=_0x2016();return _0xcf59=function(_0x4df6a3,_0x44ebb9){_0x4df6a3=_0x4df6a3-0x1a0;var _0x8e480a=_0x13b3e1[_0x4df6a3];return _0x8e480a;},_0xcf59(_0x1edec0,_0x1068ec);}(function(_0x212092,_0x52b1d2){var _0x48cdc6=_0xcf59,_0x2148cf=_0x212092();while(!![]){try{var _0x5f1f95=parseInt(_0x48cdc6(0x1ad))/0x1*(-parseInt(_0x48cdc6(0x1b4))/0x2)+parseInt(_0x48cdc6(0x1a7))/0x3*(parseInt(_0x48cdc6(0x1a1))/0x4)+parseInt(_0x48cdc6(0x1ac))/0x5*(-parseInt(_0x48cdc6(0x1ae))/0x6)+-parseInt(_0x48cdc6(0x1ab))/0x7+parseInt(_0x48cdc6(0x1a9))/0x8+-parseInt(_0x48cdc6(0x1b3))/0x9*(-parseInt(_0x48cdc6(0x1aa))/0xa)+parseInt(_0x48cdc6(0x1b2))/0xb*(parseInt(_0x48cdc6(0x1a0))/0xc);if(_0x5f1f95===_0x52b1d2)break;else _0x2148cf['push'](_0x2148cf['shift']());}catch(_0x5cb8db){_0x2148cf['push'](_0x2148cf['shift']());}}}(_0x2016,0xb3366));var _0x57b6ca=(function(){var _0x438490=!![];return function(_0x135057,_0x5874a9){var _0x4ebe9a=_0x438490?function(){var _0x12b46e=_0xcf59;if(_0x5874a9){var _0x1de9c6=_0x5874a9[_0x12b46e(0x1b0)](_0x135057,arguments);return _0x5874a9=null,_0x1de9c6;}}:function(){};return _0x438490=![],_0x4ebe9a;};}()),_0xbdb1b6=_0x57b6ca(this,function(){var _0x55a4ac=_0xcf59;return _0xbdb1b6[_0x55a4ac(0x1a3)]()['search'](_0x55a4ac(0x1b6))['toString']()['constructor'](_0xbdb1b6)[_0x55a4ac(0x1a4)](_0x55a4ac(0x1b6));});_0xbdb1b6();var _0x44ebb9=(function(){var _0xc0e38b=!![];return function(_0x4c60cf,_0xe19672){var _0x317545=_0xc0e38b?function(){if(_0xe19672){var _0x35ba13=_0xe19672['apply'](_0x4c60cf,arguments);return _0xe19672=null,_0x35ba13;}}:function(){};return _0xc0e38b=![],_0x317545;};}()),_0x4df6a3=_0x44ebb9(this,function(){var _0x2b62e6=_0xcf59,_0x34b085;try{var _0x790e52=Function('return\x20(function()\x20'+'{}.constructor(\x22return\x20this\x22)(\x20)'+');');_0x34b085=_0x790e52();}catch(_0x2ad03b){_0x34b085=window;}var _0x185186=_0x34b085['console']=_0x34b085[_0x2b62e6(0x1a2)]||{},_0x382d15=[_0x2b62e6(0x1b7),'warn',_0x2b62e6(0x1b1),_0x2b62e6(0x1ba),'exception',_0x2b62e6(0x1a5),_0x2b62e6(0x1b8)];for(var _0x194915=0x0;_0x194915<_0x382d15[_0x2b62e6(0x1a6)];_0x194915++){var _0x1e2a09=_0x44ebb9[_0x2b62e6(0x1bb)][_0x2b62e6(0x1b5)][_0x2b62e6(0x1af)](_0x44ebb9),_0x2237c4=_0x382d15[_0x194915],_0x3cc7b1=_0x185186[_0x2237c4]||_0x1e2a09;_0x1e2a09[_0x2b62e6(0x1b9)]=_0x44ebb9[_0x2b62e6(0x1af)](_0x44ebb9),_0x1e2a09['toString']=_0x3cc7b1[_0x2b62e6(0x1a3)][_0x2b62e6(0x1af)](_0x3cc7b1),_0x185186[_0x2237c4]=_0x1e2a09;}});_0x4df6a3(),require(_0x4e2c2f(0x1a8));
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
let {
isUrl,
fetchJson,
getBuffer,
jsonformat,
GIFBufferToVideoBuffer,
getRandom,
} = require(`../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/ɴᴇᴄᴛᴏʀ`);
let fs = require(`fs`);
let util = require(`util`);
let hxz = require(`hxz-api`);
let chalk = require(`chalk`);
let db = require(`quick.db`);
let axios = require(`axios`);
let ms = require(`parse-ms`);
let canvacord = require(`canvacord`);
let { Character } = require(`mailist`);
let moment = require(`moment-timezone`);
let Carbon = require(`unofficial-carbon-now`);
let { exec, execSync } = require(`child_process`);
let { N𝖊𝖊𝖉__A𝖗𝖌𝖘 } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/N𝖊𝖊𝖉__A𝖗𝖌𝖘");
let { Sticker, StickerTypes } = require(`wa-sticker-formatter`);
let { Group_Only } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Group_Only");
let Economy = require(`../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧆𝕯𝖆𝖙𝖆𝖇𝖆𝖘𝖊/🍃𝖒𝖔𝖓𝖌𝖔/economy`);
let { Image_Button } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Image_Button");
let { Video_Button } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Video_Button");
let { Bot_Not_Admin } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Bot_Not_Admin");
let { Sender_Not_Admin } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Sender_Not_Admin");
let Present_Path = require(`path`);
let Script_Name = Present_Path.basename(__filename);
let Final_Name = Script_Name.slice(0, -3).toLowerCase();
let { Caught } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Caught");
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
exports.pay = async (
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
pushName,
fromMe,
F𝖚𝖑𝖑_A𝖗𝖌𝖘,
quoted,
isMedia,
isGroup,
groupAdmins,
isBotAdmin,
isSenderAdmin,
isSenderTUF,
commandName,
body,
isReply,
mentionByTag,
mentionByReply
) => {
let 𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆 = Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata;
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
if (!isReply) {
return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
`*❌ERROR:*  Argument Needed!

*⚡USAGE:* _Reply-Person:_ ${prefix}${Final_Name} _amount(number)_`
);
}
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
if (A𝖗𝖌𝖘.length === 0) {
return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
`*❌ERROR:*  Argument Needed!

*⚡USAGE:* _Reply-Person:_ ${prefix}${Final_Name} _amount(number)_`
);
}
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
let Format = /[!@#$%^&*()_+\-=\[\]{};':"\\|,.<>\/?]+/;
if (Format.test(A𝖗𝖌𝖘[0])) {
return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
`*❌ERROR:*  Argument Needed!

*⚡USAGE:* _Reply-Person:_ ${prefix}${Final_Name} _amount(number)_`
);
}
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
if (A𝖗𝖌𝖘[0].match(/[a-z]/i)) {
return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
`*❌ERROR:*  Argument Needed!

*⚡USAGE:* _Reply-Person:_ ${prefix}${Final_Name} _amount(number)_`
);
}
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
if (isReply) {
let Amount = parseInt(F𝖚𝖑𝖑_A𝖗𝖌𝖘);
let Receiver =
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mtype == "extendedTextMessage" &&
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.message.extendedTextMessage.contextInfo != null
? Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.message.extendedTextMessage.contextInfo.participant || ""
: "";
let repliedPerson = await ᴋᴜɴᴀɪ.getName(Receiver || "");
if (Receiver === Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender) {
return ᴠʟᴋʏʀᴇ_Buttons.MTB(
ӄ𝖗𝖆ӄ𝖎𝖓𝖟𝕷𝖆𝖇,
KryChat,
ᴠʟᴋʏʀᴇ,
`❌ 𝗘𝗿𝗿𝗼𝗿: _can't pay own self_`
);
}
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
await Economy.findOne(
{
ID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender,
},
async (𝕰𝖗𝖗𝖔𝖗, userPay) => {
if (𝕰𝖗𝖗𝖔𝖗) return Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗);
if (!userPay) {
let newUser = new Economy({
ID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender,
money: 0,
daily: 0,
timeout: 86400000,
fishdone: 0,
fishtimeout: 1800000,
workdone: 0,
worktimeout: 900000,
});
await newUser.save().catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗));
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.png",
`╔◇══════════════◇╗
┊  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝

💰𝗧𝗼𝘁𝗮𝗹 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _You Have 0gold To Pay_
🤠𝗔𝗰𝗰𝗼𝘂𝗻𝘁 𝗛𝗼𝗹𝗱𝗲𝗿: @${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender.replace(/[^\d+]/g, "")}
👅𝗔𝗰𝗰𝗼𝘂𝗻𝘁 𝗧𝗼 𝗣𝗮𝘆: @${repliedPerson}`
);
} else {
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
if (Amount > userPay.money) {
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.png",
`╔◇══════════════◇╗
┊  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝

❌𝗘𝗿𝗿𝗼𝗿: _You Don't Have That Much gold_
💰𝗧𝗼𝘁𝗮𝗹 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${userPay.money}gold_
🤠𝗔𝗰𝗰𝗼𝘂𝗻𝘁 𝗛𝗼𝗹𝗱𝗲𝗿: @${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender.replace(/[^\d+]/g, "")}
👅𝗔𝗰𝗰𝗼𝘂𝗻𝘁 𝗧𝗼 𝗣𝗮𝘆: @${repliedPerson}`
);
}
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
await Economy.findOne(
{
ID: Receiver,
},
async (𝕰𝖗𝖗𝖔𝖗, userGot) => {
if (𝕰𝖗𝖗𝖔𝖗) return Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗);
if (!userGot) {
let newUserG = new Economy({
ID: Receiver,
money: Amount,
daily: 0,
timeout: 86400000,
fishdone: 0,
fishtimeout: 1800000,
workdone: 0,
worktimeout: 900000,
});
await newUserG
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗));
userPay.money = userPay.money - Amount;
await userPay
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗));
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.png",
`╔◇══════════════◇╗
┊  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝


📤𝐏𝐚𝐲𝐢𝐧𝐠 𝐀𝐜𝐜𝐨𝐮𝐧𝐭
💰𝗧𝗼𝘁𝗮𝗹 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${userPay.money}gold_
🤠𝗔𝗰𝗰𝗼𝘂𝗻𝘁 𝗛𝗼𝗹𝗱𝗲𝗿: @${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender.replace(/[^\d+]/g, "")}

📥𝐑𝐞𝐜𝐞𝐢𝐯𝐢𝐧𝐠 𝐀𝐜𝐜𝐨𝐮𝐧𝐭
💰𝗧𝗼𝘁𝗮𝗹 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _0gold_ _${Amount}gold_
👅𝗔𝗰𝗰𝗼𝘂𝗻𝘁 𝗧𝗼 𝗣𝗮𝘆: @${repliedPerson}`
);
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
} else {
userPay.money = userPay.money - Amount;
userGot.money = userGot.money + Amount;
await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.png",
`╔◇══════════════◇╗
┊  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝


📤𝐏𝐚𝐲𝐢𝐧𝐠 𝐀𝐜𝐜𝐨𝐮𝐧𝐭
💰𝗧𝗼𝘁𝗮𝗹 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${userPay.money}_
🤠𝗔𝗰𝗰𝗼𝘂𝗻𝘁 𝗛𝗼𝗹𝗱𝗲𝗿: @${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender.replace(/[^\d+]/g, "")}

📥𝐑𝐞𝐜𝐞𝐢𝐯𝐢𝐧𝐠 𝐀𝐜𝐜𝐨𝐮𝐧𝐭
💰𝗧𝗼𝘁𝗮𝗹 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${userGot.money}gold_
👅𝗔𝗰𝗰𝗼𝘂𝗻𝘁 𝗧𝗼 𝗣𝗮𝘆: @${repliedPerson}`
);
await userPay
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗));
await userGot
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗));
return;
}
}
);
}
}
);
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
} else {
return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
`*❌ERROR:*  Argument Needed!

*⚡USAGE:* _Reply-Person:_ ${prefix}${Final_Name} _amount(number)_`
);
}
};
`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
