("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
 * * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
 */
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/𝕷𝖆ყO𝖚𝖙");
let {
  isUrl,
  fetchJson,
  getBuffer,
  jsonformat,
  GIFBufferToVideoBuffer,
  getRandom,
} = require(`../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/ɴᴇᴄᴛᴏʀ`);
let fs = require(`fs`);
let util = require(`util`);
let hxz = require(`hxz-api`);
let chalk = require(`chalk`);
let db = require(`quick.db`);
let axios = require(`axios`);
let ms = require(`parse-ms`);
let canvacord = require(`canvacord`);
let { Character } = require(`mailist`);
let moment = require(`moment-timezone`);
let Carbon = require(`unofficial-carbon-now`);
let { exec, execSync } = require(`child_process`);
let { N𝖊𝖊𝖉__A𝖗𝖌𝖘 } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/N𝖊𝖊𝖉__A𝖗𝖌𝖘");
let { Sticker, StickerTypes } = require(`wa-sticker-formatter`);
let { Group_Only } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Group_Only");
let Economy = require(`../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧆𝕯𝖆𝖙𝖆𝖇𝖆𝖘𝖊/🍃𝖒𝖔𝖓𝖌𝖔/economy`);
let { Image_Button } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Image_Button");
let { Video_Button } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Video_Button");
let { Bot_Not_Admin } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Bot_Not_Admin");
let { Sender_Not_Admin } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Sender_Not_Admin");
let Present_Path = require(`path`);
let Script_Name = Present_Path.basename(__filename);
let Final_Name = Script_Name.slice(0, -3).toLowerCase();
let { Caught } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Caught");
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
exports.pay = async (
  ᴋᴜɴᴀɪ,
  Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
  A𝖗𝖌𝖘,
  pushName,
  fromMe,
  F𝖚𝖑𝖑_A𝖗𝖌𝖘,
  quoted,
  isMedia,
  isGroup,
  groupMetadata,
  groupName,
  participants,
  groupAdmins,
  isBotAdmin,
  isSenderAdmin,
  isSenderTUF,
  commandName,
  body,
  isReply,
  mentionByTag,
  mentionByReply
) => {
  if (!Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.isGroup) return await Group_Only(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊);
  `|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
  if (!isReply) {
    return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
      ᴋᴜɴᴀɪ,
      Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
      `*❌ERROR:*  Argument Needed!

*⚡USAGE:* _Reply-Person:_ ${prefix}${Final_Name} _amount(number)_`
    );
  }
  `|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
  if (A𝖗𝖌𝖘.length === 0) {
    return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
      ᴋᴜɴᴀɪ,
      Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
      `*❌ERROR:*  Argument Needed!

*⚡USAGE:* _Reply-Person:_ ${prefix}${Final_Name} _amount(number)_`
    );
  }
  `|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
  let Format = /[!@#$%^&*()_+\-=\[\]{};':"\\|,.<>\/?]+/;
  if (Format.test(A𝖗𝖌𝖘[0])) {
    return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
      ᴋᴜɴᴀɪ,
      Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
      `*❌ERROR:*  Argument Needed!

*⚡USAGE:* _Reply-Person:_ ${prefix}${Final_Name} _amount(number)_`
    );
  }
  `|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
  if (A𝖗𝖌𝖘[0].match(/[a-z]/i)) {
    return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
      ᴋᴜɴᴀɪ,
      Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
      `*❌ERROR:*  Argument Needed!

*⚡USAGE:* _Reply-Person:_ ${prefix}${Final_Name} _amount(number)_`
    );
  }
  `|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
  if (isReply) {
    let Amount = parseInt(F𝖚𝖑𝖑_A𝖗𝖌𝖘);
    let Receiver =
      Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mtype == `extendedTextMessage` &&
      Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.message.extendedTextMessage.contextInfo != null
        ? Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.message.extendedTextMessage.contextInfo.mentionedJid
        : [];
    let քɛʀֆօռɢօȶռʊʍ = Receiver.substring(0, Receiver.length - 15);
    if (Receiver === Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender) {
      return ᴠʟᴋʏʀᴇ_Buttons.MTB(
        ӄ𝖗𝖆ӄ𝖎𝖓𝖟𝕷𝖆𝖇,
        KryChat,
        ᴠʟᴋʏʀᴇ,
        `❌ 𝗘𝗿𝗿𝗼𝗿: _can't pay own self_`
      );
    }
    `|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
    await Economy.findOne(
      {
        ID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender,
      },
      async (𝕰𝖗𝖗𝖔𝖗, userPay) => {
        if (𝕰𝖗𝖗𝖔𝖗) return Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗);
        if (!userPay) {
          let newUser = new Economy({
            ID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender,
            money: 0,
            daily: 0,
            timeout: 86400000,
            fishdone: 0,
            fishtimeout: 1800000,
            workdone: 0,
            worktimeout: 900000,
          });
          await newUser.save().catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗));
          return await Image_Button(
            ᴋᴜɴᴀɪ,
            Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
            A𝖗𝖌𝖘,
            "./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.png",
            `╔◇══════════════◇╗
┊  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝

💰𝗧𝗼𝘁𝗮𝗹 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _You Have 0gold To Pay_
🤠𝗔𝗰𝗰𝗼𝘂𝗻𝘁 𝗛𝗼𝗹𝗱𝗲𝗿: @${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender.replace(/[^\d+]/g, "")}
👅𝗔𝗰𝗰𝗼𝘂𝗻𝘁 𝗧𝗼 𝗣𝗮𝘆: @${քɛʀֆօռɢօȶռʊʍ}`
          );
        } else {
          `|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
          if (Amount > userPay.money) {
            return await Image_Button(
              ᴋᴜɴᴀɪ,
              Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
              A𝖗𝖌𝖘,
              "./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.png",
              `╔◇══════════════◇╗
┊  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝

❌𝗘𝗿𝗿𝗼𝗿: _You Don't Have That Much gold_
💰𝗧𝗼𝘁𝗮𝗹 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${userPay.money}gold_
🤠𝗔𝗰𝗰𝗼𝘂𝗻𝘁 𝗛𝗼𝗹𝗱𝗲𝗿: @${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender.replace(/[^\d+]/g, "")}
👅𝗔𝗰𝗰𝗼𝘂𝗻𝘁 𝗧𝗼 𝗣𝗮𝘆: @${քɛʀֆօռɢօȶռʊʍ}`
            );
          }
          `|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
          await Economy.findOne(
            {
              ID: Receiver,
            },
            async (𝕰𝖗𝖗𝖔𝖗, userGot) => {
              if (𝕰𝖗𝖗𝖔𝖗) return Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗);
              if (!userGot) {
                let newUserG = new Economy({
                  ID: Receiver,
                  money: Amount,
                  daily: 0,
                  timeout: 86400000,
                  fishdone: 0,
                  fishtimeout: 1800000,
                  workdone: 0,
                  worktimeout: 900000,
                });
                await newUserG
                  .save()
                  .catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗));
                userPay.money = userPay.money - Amount;
                await userPay
                  .save()
                  .catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗));
                return await Image_Button(
                  ᴋᴜɴᴀɪ,
                  Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                  A𝖗𝖌𝖘,
                  "./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.png",
                  `╔◇══════════════◇╗
┊  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝


📤𝐏𝐚𝐲𝐢𝐧𝐠 𝐀𝐜𝐜𝐨𝐮𝐧𝐭
💰𝗧𝗼𝘁𝗮𝗹 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${userPay.money}gold_
🤠𝗔𝗰𝗰𝗼𝘂𝗻𝘁 𝗛𝗼𝗹𝗱𝗲𝗿: @${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender.replace(/[^\d+]/g, "")}

📥𝐑𝐞𝐜𝐞𝐢𝐯𝐢𝐧𝐠 𝐀𝐜𝐜𝐨𝐮𝐧𝐭
💰𝗧𝗼𝘁𝗮𝗹 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _0gold_ _${Amount}gold_
👅𝗔𝗰𝗰𝗼𝘂𝗻𝘁 𝗧𝗼 𝗣𝗮𝘆: @${քɛʀֆօռɢօȶռʊʍ}`
                );
                `|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
              } else {
                userPay.money = userPay.money - Amount;
                userGot.money = userGot.money + Amount;
                await Image_Button(
                  ᴋᴜɴᴀɪ,
                  Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
                  A𝖗𝖌𝖘,
                  "./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.png",
                  `╔◇══════════════◇╗
┊  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞💵𝐁𝐚𝐧𝐤
╚◇══════════════◇╝


📤𝐏𝐚𝐲𝐢𝐧𝐠 𝐀𝐜𝐜𝐨𝐮𝐧𝐭
💰𝗧𝗼𝘁𝗮𝗹 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${userPay.money}_
🤠𝗔𝗰𝗰𝗼𝘂𝗻𝘁 𝗛𝗼𝗹𝗱𝗲𝗿: @${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender.replace(/[^\d+]/g, "")}

📥𝐑𝐞𝐜𝐞𝐢𝐯𝐢𝐧𝐠 𝐀𝐜𝐜𝐨𝐮𝐧𝐭
💰𝗧𝗼𝘁𝗮𝗹 𝗕𝗮𝗹𝗮𝗻𝗰𝗲: _${userGot.money}gold_
👅𝗔𝗰𝗰𝗼𝘂𝗻𝘁 𝗧𝗼 𝗣𝗮𝘆: @${քɛʀֆօռɢօȶռʊʍ}`
                );
                await userPay
                  .save()
                  .catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗));
                await userGot
                  .save()
                  .catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, 𝕰𝖗𝖗𝖔𝖗));
                return;
              }
            }
          );
        }
      }
    );
    `|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
  } else {
    return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
      ᴋᴜɴᴀɪ,
      Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
      `*❌ERROR:*  Argument Needed!
    
    *⚡USAGE:* _Reply-Person:_ ${prefix}${Final_Name} _amount(number)_`
    );
  }
};
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
/*
 * * * * * * * * * * |        (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!        * * * * * * * * * *
 */
("|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|");
