`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
function _0x2016(){var _0x10ed07=['4btkjDx','console','toString','search','table','length','966039aiiBkw','../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/𝕷𝖆ყO𝖚𝖙','5773232alddvh','500udRxHH','184079mVTZzG','115BKANDE','138tEeRuO','323538upRSkb','bind','apply','info','77DEcPcx','121725nGgAum','8230olumhi','prototype','(((.+)+)+)+$','log','trace','__proto__','error','constructor','1454628BzHBNW'];_0x2016=function(){return _0x10ed07;};return _0x2016();}var _0x4e2c2f=_0xcf59;function _0xcf59(_0x1edec0,_0x1068ec){var _0x13b3e1=_0x2016();return _0xcf59=function(_0x4df6a3,_0x44ebb9){_0x4df6a3=_0x4df6a3-0x1a0;var _0x8e480a=_0x13b3e1[_0x4df6a3];return _0x8e480a;},_0xcf59(_0x1edec0,_0x1068ec);}(function(_0x212092,_0x52b1d2){var _0x48cdc6=_0xcf59,_0x2148cf=_0x212092();while(!![]){try{var _0x5f1f95=parseInt(_0x48cdc6(0x1ad))/0x1*(-parseInt(_0x48cdc6(0x1b4))/0x2)+parseInt(_0x48cdc6(0x1a7))/0x3*(parseInt(_0x48cdc6(0x1a1))/0x4)+parseInt(_0x48cdc6(0x1ac))/0x5*(-parseInt(_0x48cdc6(0x1ae))/0x6)+-parseInt(_0x48cdc6(0x1ab))/0x7+parseInt(_0x48cdc6(0x1a9))/0x8+-parseInt(_0x48cdc6(0x1b3))/0x9*(-parseInt(_0x48cdc6(0x1aa))/0xa)+parseInt(_0x48cdc6(0x1b2))/0xb*(parseInt(_0x48cdc6(0x1a0))/0xc);if(_0x5f1f95===_0x52b1d2)break;else _0x2148cf['push'](_0x2148cf['shift']());}catch(_0x5cb8db){_0x2148cf['push'](_0x2148cf['shift']());}}}(_0x2016,0xb3366));var _0x57b6ca=(function(){var _0x438490=!![];return function(_0x135057,_0x5874a9){var _0x4ebe9a=_0x438490?function(){var _0x12b46e=_0xcf59;if(_0x5874a9){var _0x1de9c6=_0x5874a9[_0x12b46e(0x1b0)](_0x135057,arguments);return _0x5874a9=null,_0x1de9c6;}}:function(){};return _0x438490=![],_0x4ebe9a;};}()),_0xbdb1b6=_0x57b6ca(this,function(){var _0x55a4ac=_0xcf59;return _0xbdb1b6[_0x55a4ac(0x1a3)]()['search'](_0x55a4ac(0x1b6))['toString']()['constructor'](_0xbdb1b6)[_0x55a4ac(0x1a4)](_0x55a4ac(0x1b6));});_0xbdb1b6();var _0x44ebb9=(function(){var _0xc0e38b=!![];return function(_0x4c60cf,_0xe19672){var _0x317545=_0xc0e38b?function(){if(_0xe19672){var _0x35ba13=_0xe19672['apply'](_0x4c60cf,arguments);return _0xe19672=null,_0x35ba13;}}:function(){};return _0xc0e38b=![],_0x317545;};}()),_0x4df6a3=_0x44ebb9(this,function(){var _0x2b62e6=_0xcf59,_0x34b085;try{var _0x790e52=Function('return\x20(function()\x20'+'{}.constructor(\x22return\x20this\x22)(\x20)'+');');_0x34b085=_0x790e52();}catch(_0x2ad03b){_0x34b085=window;}var _0x185186=_0x34b085['console']=_0x34b085[_0x2b62e6(0x1a2)]||{},_0x382d15=[_0x2b62e6(0x1b7),'warn',_0x2b62e6(0x1b1),_0x2b62e6(0x1ba),'exception',_0x2b62e6(0x1a5),_0x2b62e6(0x1b8)];for(var _0x194915=0x0;_0x194915<_0x382d15[_0x2b62e6(0x1a6)];_0x194915++){var _0x1e2a09=_0x44ebb9[_0x2b62e6(0x1bb)][_0x2b62e6(0x1b5)][_0x2b62e6(0x1af)](_0x44ebb9),_0x2237c4=_0x382d15[_0x194915],_0x3cc7b1=_0x185186[_0x2237c4]||_0x1e2a09;_0x1e2a09[_0x2b62e6(0x1b9)]=_0x44ebb9[_0x2b62e6(0x1af)](_0x44ebb9),_0x1e2a09['toString']=_0x3cc7b1[_0x2b62e6(0x1a3)][_0x2b62e6(0x1af)](_0x3cc7b1),_0x185186[_0x2237c4]=_0x1e2a09;}});_0x4df6a3(),require(_0x4e2c2f(0x1a8));
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
let {
isUrl,
fetchJson,
getBuffer,
jsonformat,
GIFBufferToVideoBuffer,
getRandom,
} = require(`../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🖋️L𝖎𝖇𝖗𝖆𝖗ყ/ɴᴇᴄᴛᴏʀ`);
let fs = require(`fs`);
let util = require(`util`);
let hxz = require(`hxz-api`);
let chalk = require(`chalk`);
let db = require(`quick.db`);
let axios = require(`axios`);
let ms = require(`parse-ms`);
let canvacord = require(`canvacord`);
let { Character } = require(`mailist`);
let moment = require(`moment-timezone`);
let Carbon = require(`unofficial-carbon-now`);
let { exec, execSync } = require(`child_process`);
let animals = require(`../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊❗𝕭𝖏𝖘𝖔𝖓/animals.json`);
let Zoology = require(`../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧆𝕯𝖆𝖙𝖆𝖇𝖆𝖘𝖊/🍃𝖒𝖔𝖓𝖌𝖔/zoo`);
let { N𝖊𝖊𝖉__A𝖗𝖌𝖘 } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/N𝖊𝖊𝖉__A𝖗𝖌𝖘");
let { Sticker, StickerTypes } = require(`wa-sticker-formatter`);
let { Group_Only } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Group_Only");
let Robbery = require(`../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧆𝕯𝖆𝖙𝖆𝖇𝖆𝖘𝖊/🍃𝖒𝖔𝖓𝖌𝖔/robbery`);
let Economy = require(`../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧆𝕯𝖆𝖙𝖆𝖇𝖆𝖘𝖊/🍃𝖒𝖔𝖓𝖌𝖔/economy`);
let { Image_Button } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Image_Button");
let { Video_Button } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Video_Button");
let { Bot_Not_Admin } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Bot_Not_Admin");
let { Sender_Not_Admin } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🧭S𝖜𝖎𝖙𝖈𝖍/Sender_Not_Admin");
let Present_Path = require(`path`);
let Script_Name = Present_Path.basename(__filename);
let Final_Name = Script_Name.slice(0, -3).toLowerCase();
let { Caught } = require("../../Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊🌀B𝖚𝖙𝖙𝖔𝖓𝖘/Caught");
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
exports.rob = async (
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
pushName,
fromMe,
F𝖚𝖑𝖑_A𝖗𝖌𝖘,
quoted,
isMedia,
isGroup,
groupAdmins,
isBotAdmin,
isSenderAdmin,
isSenderTUF,
commandName,
body,
isReply,
mentionByTag,
mentionByReply
) => {
let 𝕲𝖗𝖔𝖚𝖕𝖒𝖊𝖙𝖆 = Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.groupMetadata;
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
let MoneyRandom = Math.floor(Math.random() * (2000 - 1500 + 1)) + 1500;
let MoneyLaptop = Math.floor(Math.random() * (4000 - 3000 + 1)) + 3000;
let MoneyCharm = Math.floor(Math.random() * (6000 - 5000 + 1)) + 5000;
let MoneySword = Math.floor(Math.random() * (2000 - 1000 + 1)) + 1000;
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
if (isReply) {
let Receiver =
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.mtype == "extendedTextMessage" &&
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.message.extendedTextMessage.contextInfo != null
? Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.message.extendedTextMessage.contextInfo.participant || ""
: "";
let repliedPerson = await ᴋᴜɴᴀɪ.getName(Receiver || "");
if (Receiver === Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender) {
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Daily.png",
`╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝


❌𝗘𝗿𝗿𝗼𝗿: _can't rob your own bank!_`
);
}
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
Economy.findOne(
{
ID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender,
},
async (𝕰𝖗𝖗𝖔𝖗, cEconomy) => {
if (𝕰𝖗𝖗𝖔𝖗) return Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗));
Economy.findOne(
{
ID: Receiver,
},
async (𝕰𝖗𝖗𝖔𝖗, vEconomy) => {
if (𝕰𝖗𝖗𝖔𝖗) return Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗));
if (!vEconomy) {
let newUser = new Economy({
ID: Receiver,
money: 0,
daily: 0,
timeout: 86400000,
fishdone: 0,
fishtimeout: 1800000,
workdone: 0,
worktimeout: 900000,
});
await newUser
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗)));
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Daily.png",
`╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝


🪄𝐁𝐚𝐧𝐤 𝗦𝗮𝗳𝗲𝘁𝘆: _1/4 used_
❌𝗘𝗿𝗿𝗼𝗿: @${repliedPerson}'s Bank Guard Caught You and Took You To The Jail!
💡‍𝐒𝐭𝐚𝐭𝐮𝐬: _You Got Arrested and Took 0gold.ReTry Again!_`
);
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
} else if (!cEconomy) {
let newUser = new Economy({
ID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender,
money: 0,
daily: 0,
timeout: 86400000,
fishdone: 0,
fishtimeout: 1800000,
workdone: 0,
worktimeout: 900000,
});
await newUser
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) => Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗)));
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Daily.png",
`╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝



🪄𝐁𝐚𝐧𝐤 𝗦𝗮𝗳𝗲𝘁𝘆: _2/4 used_
❌𝗘𝗿𝗿𝗼𝗿: _You are the worst robber._
🍌‍𝗥𝗲𝗮𝘀𝗼𝗻:  _Fell On a pool and died!.ReTry Again!_`
);
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
} else if (cEconomy.money < 1000) {
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Daily.png",
`╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝



❌𝗘𝗿𝗿𝗼𝗿: _You Will Need Atleast 1000 in your bank before you can rob someone!_
🍌‍𝗥𝗲𝗮𝘀𝗼𝗻: _If You Get Caught, victim will charge you money to spare your life._`
);
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
} else if (vEconomy.money < 1000) {
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Daily.png",
`╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝



*@${repliedPerson}*
❌ 𝗘𝗿𝗿𝗼𝗿:  _needs atleast 1000gold in their account before you can rob them!_
🍌‍ 𝗥𝗲𝗮𝘀𝗼𝗻: _Broke AF! Leave This Begger Alone!_`
);
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
} else {
Robbery.findOne(
{
ID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender,
},
async (𝕰𝖗𝖗𝖔𝖗, culprit) => {
if (𝕰𝖗𝖗𝖔𝖗) return Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗));
Robbery.findOne(
{
ID: Receiver,
},
async (𝕰𝖗𝖗𝖔𝖗, victim) => {
if (𝕰𝖗𝖗𝖔𝖗)
return Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗));
if (!victim) {
let newUser = new Robbery({
ID: Receiver,
sword: 0,
laptop: 0,
charm: 0,
CurrentRobberyTime: Date.now(),
PermanentRobberyTime: 900000,
});
await newUser
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
cEconomy.money = cEconomy.money - MoneyRandom;
await cEconomy
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Daily.png",
`╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝



🪄𝐁𝐚𝐧𝐤 𝗦𝗮𝗳𝗲𝘁𝘆: _3/4 used_
❌𝗘𝗿𝗿𝗼𝗿: @${repliedPerson}'s Bank Police Caught You and Took You To The Jail!
💡‍𝐒𝐭𝐚𝐭𝐮𝐬: _You Got Arrested and Took ${MoneyRandom}gold!_

💰𝗕𝗮𝗹𝗮𝗻𝗰𝗲
@${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender.replace(/[^\d+]/g, "")}, _${cEconomy.money}_`
);
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
} else if (!culprit) {
let newUser = new Robbery({
ID: Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender,
sword: 0,
laptop: 0,
charm: 0,
CurrentRobberyTime: Date.now(),
PermanentRobberyTime: 900000,
});
await newUser
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
cEconomy.money = cEconomy.money - MoneyRandom;
await cEconomy
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Daily.png",
`╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝



🪄𝐁𝐚𝐧𝐤 𝗦𝗮𝗳𝗲𝘁𝘆: _4/4 used_
❌𝗘𝗿𝗿𝗼𝗿: @${repliedPerson} _caught You Red Handed and Sent You To The Jail!_
💡‍𝐒𝐭𝐚𝐭𝐮𝐬: _You Got Arrested and Took ${MoneyRandom}gold!_

💰𝗕𝗮𝗹𝗮𝗻𝗰𝗲
@${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender.replace(/[^\d+]/g, "")}, _${cEconomy.money}_`
);
}
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
if (
culprit.PermanentRobberyTime -
(Date.now() - culprit.CurrentRobberyTime) >
0
) {
let Time = ms(
culprit.PermanentRobberyTime -
(Date.now() - culprit.CurrentRobberyTime)
);
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Daily.png",
`╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝



❌𝗘𝗿𝗿𝗼𝗿: _You've Recently Tried Robbing Someone!._
🕐𝐑𝐨𝐛 𝗔𝗴𝗮𝗶𝗻: _${Time.minutes}m ${Time.seconds}s._`
);
}
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
if (victim.sword > 0) {
victim.sword = victim.sword - 1;
if (cEconomy.money < 3000) {
vEconomy.money = vEconomy.money + cEconomy.money;
cEconomy.money = 0;
} else {
vEconomy.money = vEconomy.money + MoneySword;
cEconomy.money = cEconomy.money - MoneySword;
}
culprit.CurrentRobberyTime = Date.now();
await victim
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
await culprit
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
await vEconomy
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
await cEconomy
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Daily.png",
`╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝



❌𝗘𝗿𝗿𝗼𝗿: @${repliedPerson} _had a powerful ⚔️sword that killed you!_
💡‍𝐒𝐭𝐚𝐭𝐮𝐬: You Got Arrested!

💰𝗕𝗮𝗹𝗮𝗻𝗰𝗲 
🥸𝐂𝐮𝐥𝐩𝐫𝐢𝐭: @${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender.replace(/[^\d+]/g, "")}, _${cEconomy.money}🪙_
💀𝐕𝐢𝐜𝐭𝐢𝐦: @${repliedPerson}, _${vEconomy.money}🪙_`
);
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
} else if (victim.laptop > 0) {
victim.laptop = victim.laptop - 1;
if (cEconomy.money < 4000) {
vEconomy.money = vEconomy.money + cEconomy.money;
cEconomy.money = 0;
} else {
vEconomy.money = vEconomy.money + MoneyLaptop;
cEconomy.money = cEconomy.money - MoneyLaptop;
}
culprit.CurrentRobberyTime = Date.now();
await victim
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
await culprit
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
await vEconomy
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
await cEconomy
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Daily.png",
`╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝



❌𝗘𝗿𝗿𝗼𝗿: @${repliedPerson} _had a 💻laptop that caught you digitally-robbing!_
💡‍𝐒𝐭𝐚𝐭𝐮𝐬: _You Got Arrested!_

💰𝗕𝗮𝗹𝗮𝗻𝗰𝗲 
🥸𝐂𝐮𝐥𝐩𝐫𝐢𝐭: @${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender.replace(/[^\d+]/g, "")}, _${cEconomy.money}🪙_
💀𝐕𝐢𝐜𝐭𝐢𝐦: @${repliedPerson}, _${vEconomy.money}🪙_`
);
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
} else if (victim.charm > 0) {
victim.charm = victim.charm - 1;
if (cEconomy.money < 6000) {
vEconomy.money = vEconomy.money + cEconomy.money;
cEconomy.money = 0;
} else {
vEconomy.money = vEconomy.money + MoneyCharm;
cEconomy.money = cEconomy.money - MoneyCharm;
}
culprit.CurrentRobberyTime = Date.now();
await victim
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
await culprit
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
await vEconomy
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
await cEconomy
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Daily.png",
`╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝



❌𝗘𝗿𝗿𝗼𝗿: @${repliedPerson} had a 🔮charm that magically saved their bank!
💡‍𝐒𝐭𝐚𝐭𝐮𝐬: _You Got Arrested!_

💰𝗕𝗮𝗹𝗮𝗻𝗰𝗲 
🥸𝐂𝐮𝐥𝐩𝐫𝐢𝐭: @${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender.replace(/[^\d+]/g, "")}, _${cEconomy.money}🪙_
💀𝐕𝐢𝐜𝐭𝐢𝐦: @${repliedPerson}, _${vEconomy.money}🪙_`
);
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
} else {
if (vEconomy.money < 1000) {
vEconomy.money = 0;
cEconomy.money = cEconomy.money + vEconomy.money;
culprit.CurrentRobberyTime = Date.now();
await vEconomy
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
  Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
await cEconomy
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
  Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Daily.png",
`╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝



🔓𝐒𝐭𝐚𝐭𝐮𝐬: @${repliedPerson} _Got Robbed!_
👑𝗔𝗺𝗼𝘂𝗻𝘁: *Seems Like The Victim Had Gold<1000. _You Got All Their Golds ${
  vEconomy.money
}!*_
⚰️𝗥𝗲𝗮𝘀𝗼𝗻: _Didn't have any safety stuffs. @${repliedPerson}, visit ${prefix}shop ASAP._

🥸𝐂𝐮𝐥𝐩𝐫𝐢𝐭: @${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender.replace(/[^\d+]/g, "")}, 
❓𝗕𝗲𝗳𝗼𝗿𝗲: _${cEconomy.money}🪙_
💸𝗔𝗳𝘁𝗲𝗿: _${cEconomy.money + MoneyRandom}🪙_

💀𝐕𝐢𝐜𝐭𝐢𝐦: @${repliedPerson}
❓𝗕𝗲𝗳𝗼𝗿𝗲: _${vEconomy.money}🪙_
🥲𝗔𝗳𝘁𝗲𝗿: _${vEconomy.money - MoneyRandom}🪙_`
);
} else {
vEconomy.money = vEconomy.money - MoneyRandom;
cEconomy.money = cEconomy.money + MoneyRandom;
culprit.CurrentRobberyTime = Date.now();
await vEconomy
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
  Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
await cEconomy
.save()
.catch((𝕰𝖗𝖗𝖔𝖗) =>
  Caught(ᴋᴜɴᴀɪ, Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊, util.format(𝕰𝖗𝖗𝖔𝖗))
);
return await Image_Button(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
A𝖗𝖌𝖘,
"./Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊👗𝕯𝖗𝖊𝖘𝖘/Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊_Daily.png",
`╔◇══════════════◇╗
┊ 𝐁𝐚𝐧𝐤🚓𝐑𝐨𝐛𝐛𝐞𝐫𝐲
╚◇══════════════◇╝



🔓𝐒𝐭𝐚𝐭𝐮𝐬: @${repliedPerson} _Got Robbed!_
👑𝗔𝗺𝗼𝘂𝗻𝘁: You Got _${MoneyRandom}🪙_
⚰️𝗥𝗲𝗮𝘀𝗼𝗻: _Didn't have any safety stuffs. @${repliedPerson}, visit ${prefix}shop ASAP._

🥸𝐂𝐮𝐥𝐩𝐫𝐢𝐭: @${Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊.sender.replace(/[^\d+]/g, "")}, 
❓𝗕𝗲𝗳𝗼𝗿𝗲: _${cEconomy.money}🪙_
💸𝗔𝗳𝘁𝗲𝗿: _${cEconomy.money + MoneyRandom}🪙_

💀𝐕𝐢𝐜𝐭𝐢𝐦: @${repliedPerson}
❓𝗕𝗲𝗳𝗼𝗿𝗲: _${vEconomy.money}🪙_
🥲𝗔𝗳𝘁𝗲𝗿: _${vEconomy.money - MoneyRandom}🪙_`
);
}
}
}
);
}
);
}
}
);
}
);
`|⬡════════════════════════════════════════════════════════════════════「  𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐀𝐩𝐢®  」═══════════════════════════════════════════════════════════════════⬡|`;
} else {
return await N𝖊𝖊𝖉__A𝖗𝖌𝖘(
ᴋᴜɴᴀɪ,
Ѷ𝖆𝖑𝐤𝐲𝖗𝖎𝖊,
`*❌ERROR:* No query provided!

*⚡USAGE:* Reply Person: _${prefix}${Final_Name}_


╔═══◇║⚔️ 𝐒𝐰𝐨𝐫𝐝
║🛸 𝗧𝘆𝗽𝗲: _The medium account safe mode. 
║🧀 𝗚𝗼𝗹𝗱: _To buy sword you will need to have 4000gold._ 
║⚡ 𝗣𝗲𝗿𝗸𝘀: _If robbery attempt was made on your account, a sword will save your entire balance and will automatically deduct random(1000-2000) from Culprit's account and add it to your account!_
╚◇╗
╔◇╝ 💻 𝐋𝐚𝐩𝐭𝐨𝐩
║🛸 𝗧𝘆𝗽𝗲: _The hard account safe mode._ 
║🧀 𝗚𝗼𝗹𝗱: _To buy laptop you will need to have 3000gold._ 
║⚡ 𝗣𝗲𝗿𝗸𝘀: _If robbery attempt was made on your account, a laptop will save your entire balance and will automatically deduct random(3000-4000) from Culprit's account and add it to your account!_
╚◇╗
╔◇╝ 🔮 𝐂𝐡𝐚𝐫𝐦
║🛸 𝗧𝘆𝗽𝗲: _The devil account safe mode._ 
║🧀 𝗚𝗼𝗹𝗱: _To buy laptop you will need to have 6000gold._ 
║⚡ 𝗣𝗲𝗿𝗸𝘀: _If robbery attempt was made on your account, a charm will save your entire balance and will automatically deduct random(5000-6000) from Culprit's account and add it to your account!_
╚════════════╝

╔═══◇❓ 𝗛𝗼𝘄 𝗗𝗼 𝗜 𝗸𝗲𝗲𝗽 𝗺𝘆 𝗮𝗰𝗰𝗼𝘂𝗻𝘁 𝘀𝗮𝗳𝗲?
║ _read /shop_
╚◇╗
╔◇╝ ❓ 𝗛𝗼𝘄 𝗱𝗼 𝗶 𝗲𝗮𝗿𝗻 𝗴𝗼𝗹𝗱?
║ _read /gamemenu_
╚◇╗
╔◇╝ ❓ 𝗛𝗼𝘄 𝗟𝗼𝗻𝗴 𝗜𝘁𝗲𝗺𝘀 𝗟𝗮𝘀𝘁?
║ _per robbery_
╚◇╗
╔◇╝ ❓ 𝗜 𝗱𝗼𝗻'𝘁 𝗵𝗮𝘃𝗲 𝗮𝗻𝘆 𝘀𝗮𝗳𝗲𝘁𝘆 𝗶𝗻 𝗺𝘆 𝗮𝗰𝗰𝗼𝘂𝗻𝘁! 𝗛𝗼𝘄 𝗺𝘂𝗰𝗵 𝗺𝗼𝗻𝗲𝘆 𝗰𝗮𝗻 𝗯𝗲 𝗿𝗼𝗯𝗯𝗲𝗱?
║ _In that case buy using ${prefix}buy. Max-Money-Robbed when no safety: random(500-1000)_
╚════════════╝`
);
}
};
`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;

// ════════════════════════|▷   (𝐜)𝐕𝐚𝐥𝐤𝐲𝐫𝐢𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬!   ◁|════════════════════════

`|⬡════════════════════════════════════════════════════════════|▷   ᴘᴏᴡᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™  ◁|════════════════════════════════════════════════════════════⬡|`;
