`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/*        
(𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
import { MessageType } from "../../𝐕𝐥𝐤𝐲𝐫𝐞⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/message-type";
import { proto } from "@adiwajshing/baileys";
import Client from "../../𝐕𝐥𝐤𝐲𝐫𝐞⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/TUF";
import Vʟӄʏʀɛ from "../../𝐕𝐥𝐤𝐲𝐫𝐞⚜️𝐊𝐫𝐲𝐨𝐓𝐞𝐤/msb";
import ʟᴀʏᴏᴜᴛ from "../../𝐕𝐥𝐤𝐲𝐫𝐞🀄𝐕𝐞𝐧𝐭/ʟᴀʏᴏᴜᴛ";
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐕𝐥𝐤𝐲𝐫𝐞 𝐀𝐩𝐢®   」                                                                            「   𝐕𝐥𝐤𝐲𝐫𝐞 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
import * as fs from 'fs';
import path from 'path';
var scriptName = path.basename(__filename);
var dotScrpt = scriptName.slice(0, -3).toLowerCase();
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐕𝐥𝐤𝐲𝐫𝐞 𝐀𝐩𝐢®   」                                                                            「   𝐕𝐥𝐤𝐲𝐫𝐞 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
export = {
name: dotScrpt,
category: path.basename(__dirname),
async handle(
TUF: Client,
Fox: proto.IWebMessageInfo,
Vʟӄʏʀɛ: Vʟӄʏʀɛ,
ǟʀɢʊʍɛռȶ: string[],
ӄ𝖗𝖞ӄ𝖓𝖟
): Promise<void> {
const ʟɴᴀᴍᴇ = Vʟӄʏʀɛ.sender;
const ᴅꜰɴᴀᴍᴇ = Vʟӄʏʀɛ.commandName;
const ᴘɴᴀᴍᴇ = ʟɴᴀᴍᴇ.replace(/[^\d+]/g, "");
let grup: any;
try {
grup = await TUF.getGroupMetaData(Vʟӄʏʀɛ.chatId, Vʟӄʏʀɛ);
} catch (e) {
console.log(e);
}
const ꜰɪɴᴀᴍᴇ = ᴅꜰɴᴀᴍᴇ.charAt(0).toUpperCase() + ᴅꜰɴᴀᴍᴇ.slice(1);
/*
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
「   𝐕𝐥𝐤𝐲𝐫𝐞 𝐀𝐩𝐢®   」                                                                            「   𝐕𝐥𝐤𝐲𝐫𝐞 𝐀𝐩𝐢®   」
⦓════════════════════════════════════════════| ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ |═══════════════════════════════════════════⦔
*/
await TUF.sendMessage(
Vʟӄʏʀɛ.chatId,
{
quoted: Fox,
timestamp: Date(),
contextInfo: { mentionedJid: [Vʟӄʏʀɛ.sender] },
image: { url: "./𝐕𝐥𝐤𝐲𝐫𝐞👜𝐁𝐚𝐠/Vʟӄʏʀɛ_Sky.png" },
caption: `┌─「 𝐕𝐥𝐤𝐲𝐫𝐞 𝐏𝐫𝐨𝐭𝐨® 」
├• *ɴᴀᴍᴇ:* ${Vʟӄʏʀɛ.sName}
├• *ᴍᴇɴᴛɪᴏɴ:* @${Vʟӄʏʀɛ.sender.replace(/[^\d+]/g, "")}
├• *ᴄᴏᴍᴍᴀɴᴅ:* ${Vʟӄʏʀɛ.commandName}
└────────────────◇

┌─「 🍙 𝐀𝐧𝐢𝐦𝐞
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}anime:*  _search any anime_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}ranimewall:*  _get random anime wallpaper_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}smile:*  _@tag or reply_ 
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}yes:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}bite:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}blush:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}bored:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}confused:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}cry:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}goodnight:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}happy:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}hi5:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}poke:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}sad:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}thinking:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}cuddle:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}hug:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}pat:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}slap:*  _@tag or reply_ 
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}wink:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}angry:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}baka:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}bonk:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}bully:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}bye:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}chase:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}cheer:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}cringe:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}dab:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}dance:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}die:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}facepalm:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}feed:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}glomp:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}hold:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}hate:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}hi:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}kill:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}lick:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}love:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}lurk:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}nervous:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}nope:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}nom:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}nuzzle:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}panic:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}peck:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}poke:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}pout:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}run:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}sip:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}shoot:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}shrug:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}sleep:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}smug:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}stab:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}stare:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}tease:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}tickle:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}thumbsup:*  _@tag or reply_
├• *${ʟᴀʏᴏᴜᴛ.MuveOn}wag:*  _@tag or reply_
└────────────◇`,
footer: "*⦓ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 𝐁𝐞𝐭𝐚❗ ⦔*",
buttons: [
{
buttonId: `${ʟᴀʏᴏᴜᴛ.MuveOn}help`,
buttonText: { displayText: `${ʟᴀʏᴏᴜᴛ.MuveOn}help` },
type: 1,
},
{
buttonId: `${ʟᴀʏᴏᴜᴛ.MuveOn}menu`,
buttonText: { displayText: `${ʟᴀʏᴏᴜᴛ.MuveOn}menu` },
type: 1,
},
],
headerType: 4,
},
MessageType.buttonsMessage
);
},
};
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
/*        
(𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
`|⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡|`;
