("⦓⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡⦔");
/* 
(𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
("⦓⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡⦔");
const UserPrivate = require(`../𝐕𝐥𝐤𝐲𝐫𝐞✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/private`);
const Welcome = require(`../𝐕𝐥𝐤𝐲𝐫𝐞✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/setwelcome`);
const LinkList = require(`../𝐕𝐥𝐤𝐲𝐫𝐞✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/antilink`);
const DebugList = require(`../𝐕𝐥𝐤𝐲𝐫𝐞✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/debug`);
const Ranker = require(`../𝐕𝐥𝐤𝐲𝐫𝐞✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/autorank`);
const Image_Button = require(`../𝐕𝐥𝐤𝐲𝐫𝐞☘️𝐊𝐞𝐲𝐬/Image_Button`);
const BanPerson = require(`../𝐕𝐥𝐤𝐲𝐫𝐞✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/ban`);
const NsfwList = require(`../𝐕𝐥𝐤𝐲𝐫𝐞✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/nsfw`);
const BanGroup = require(`../𝐕𝐥𝐤𝐲𝐫𝐞✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/ban`);
const Bagde = require(`../𝐕𝐥𝐤𝐲𝐫𝐞✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/badge`);
const Halt = require(`../𝐕𝐥𝐤𝐲𝐫𝐞✈️𝐂𝐨𝐧𝐧𝐞𝐜𝐭/🍃mongo/halt`);
const chalkAnimation = require("chalkercli");
import ʟᴀʏᴏᴜᴛ from "../𝐕𝐥𝐤𝐲𝐫𝐞🀄𝐕𝐞𝐧𝐭/ʟᴀʏᴏᴜᴛ";
import { Boom } from "@hapi/boom";
import Kolor from "chalk";
// ⦓═════════════════════════════════「 𝐕𝐥𝐤𝐲𝐫𝐞 𝐀𝐩𝐢®」        ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™    「 𝐕𝐥𝐤𝐲𝐫𝐞 𝐀𝐩𝐢®」═════════════════════════════════⦔
const ProID = async (
TUF: any,
Fox: any,
Vʟӄʏʀɛ: any,
ӄ𝖗𝖞ӄ𝖓𝖟: any
): Promise<void> => {
console.clear();
let GroupInviteLink = Vʟӄʏʀɛ.body;
let GroupLinkRegex = /chat.whatsapp.com\/([0-9A-Za-z]{20,24})/i;
let [_, MetaCode] = GroupInviteLink.match(GroupLinkRegex) || [];
// ⦓═════════════════════════════════「 𝐕𝐥𝐤𝐲𝐫𝐞 𝐀𝐩𝐢®」        ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™    「 𝐕𝐥𝐤𝐲𝐫𝐞 𝐀𝐩𝐢®」═════════════════════════════════⦔
if (Vʟӄʏʀɛ.isCmd) return;
const GroupMetadata = await ӄ𝖗𝖞ӄ𝖓𝖟.groupGetInviteInfo(MetaCode);
console.log(GroupMetadata);
let 𝕻𝕻𝖑𝖊𝖙𝖊𝖗: any;
try {
𝕻𝕻𝖑𝖊𝖙𝖊𝖗 = await ӄ𝖗𝖞ӄ𝖓𝖟.profilePictureUrl(GroupMetadata.gid, "image");
} catch {
𝕻𝕻𝖑𝖊𝖙𝖊𝖗 = "./𝐕𝐥𝐤𝐲𝐫𝐞👜𝐁𝐚𝐠/Vʟӄʏʀɛ.png";
}
// ⦓═════════════════════════════════「 𝐕𝐥𝐤𝐲𝐫𝐞 𝐀𝐩𝐢®」        ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™    「 𝐕𝐥𝐤𝐲𝐫𝐞 𝐀𝐩𝐢®」═════════════════════════════════⦔
if (GroupMetadata.size < 20) {
return await Image_Button.VImg(
TUF,
Fox,
Vʟӄʏʀɛ,
`❌𝗘𝗿𝗿𝗼𝗿: ${GroupMetadata.subject} has _${GroupMetadata.size}/20 members!_`,
𝕻𝕻𝖑𝖊𝖙𝖊𝖗
);
} else {
await ӄ𝖗𝖞ӄ𝖓𝖟.groupAcceptInvite(MetaCode);
return await Image_Button.VImg(
TUF,
Fox,
Vʟӄʏʀɛ,
`🔓𝐒𝐭𝐚𝐭𝐮𝐬: _Auto Joined Group!_

📜𝐆𝐫𝐨𝐮𝐩: ${GroupMetadata.subject}
💞𝐌𝐞𝐦𝐛𝐞𝐫: ${GroupMetadata.size}
📝𝐃𝐞𝐬𝐜𝐫𝐢𝐩𝐭𝐢𝐨𝐧: ${GroupMetadata.desc}`,
𝕻𝕻𝖑𝖊𝖙𝖊𝖗
);
}
};
// ⦓═════════════════════════════════「 𝐕𝐥𝐤𝐲𝐫𝐞 𝐀𝐩𝐢®」        ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™    「 𝐕𝐥𝐤𝐲𝐫𝐞 𝐀𝐩𝐢®」═════════════════════════════════⦔
export = {
ProID: ProID,
};
("⦓⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡⦔");
/* 
(𝐜)𝐕𝐥𝐤𝐲𝐫𝐞 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
*/
("⦓⬡════════════════════════════════════════════|❝ Ⓒ𝐕𝐥𝐤𝐲𝐫𝐞 ☊ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴋʀᴀᴋɪɴᴢʟᴀʙ™ ❞|═══════════════════════════════════════════⬡⦔");
`
2022-06-17T18:21:41.753761+00:00 app[worker.1]: {
2022-06-17T18:21:41.753776+00:00 app[worker.1]:   id: '120363041425736157@g.us',
2022-06-17T18:21:41.753784+00:00 app[worker.1]:   subject: '⦓ ©𝐕𝐥𝐤𝐲𝐫𝐞 ༒ 𝐓𝐞𝐬𝐭𝐞𝐫𝐬 ⦔',
2022-06-17T18:21:41.753785+00:00 app[worker.1]:   subjectOwner: '918436686758@s.whatsapp.net',
2022-06-17T18:21:41.753785+00:00 app[worker.1]:   subjectTime: 1655485099,
2022-06-17T18:21:41.753785+00:00 app[worker.1]:   size: 15,
2022-06-17T18:21:41.753786+00:00 app[worker.1]:   creation: 1654108500,
2022-06-17T18:21:41.753786+00:00 app[worker.1]:   owner: '918436686758@s.whatsapp.net',
2022-06-17T18:21:41.753787+00:00 app[worker.1]:   desc: <Buffer 2a e2 80 a2 20 f0 9d 90 80 f0 9d 90 ab f0 9d 90 9c f0 9d 90 ad f0 9d 90 a2 f0 9d 90 b1 20 f0 9d 90 80 f0 9d 90 88 20 e2 80 a2 2a 0a 0a 57 65 62 73 69 ... 76 more bytes>,
2022-06-17T18:21:41.753787+00:00 app[worker.1]:   descId: 'C2326D296A3C706826DB2A3B10F2571A',
2022-06-17T18:21:41.753787+00:00 app[worker.1]:   restrict: false,
2022-06-17T18:21:41.753788+00:00 app[worker.1]:   announce: false,
2022-06-17T18:21:41.753788+00:00 app[worker.1]:   participants: [
2022-06-17T18:21:41.753788+00:00 app[worker.1]:     { id: '917407243946@s.whatsapp.net', admin: null },
2022-06-17T18:21:41.753789+00:00 app[worker.1]:     { id: '27748187589@s.whatsapp.net', admin: null },
2022-06-17T18:21:41.753789+00:00 app[worker.1]:     { id: '918436686758@s.whatsapp.net', admin: 'superadmin' }
2022-06-17T18:21:41.753789+00:00 app[worker.1]:   ],
2022-06-17T18:21:41.753789+00:00 app[worker.1]:   ephemeralDuration: undefined
2022-06-17T18:21:41.753789+00:00 app[worker.1]: }
`;
